[
  {
    "query_id": "EX5",
    "query_type": "comparitive_not",
    "query_text": "Is there evidence that PPIs (Proton Pump Inhibitors) leads to blood glucose control?",
    "documents": [
      {
        "doc_id": "EX5_2",
        "text": "Preliminary observations indicate slight, often temporary, shifts in blood glucose control after initial exposure to PPIs (Proton Pump Inhibitors).",
        "relevance": 2
      },
      {
        "doc_id": "EX5_7",
        "text": "While PPIs (Proton Pump Inhibitors) is widely used, public discussions rarely highlight any link to blood glucose control.",
        "relevance": 1
      },
      {
        "doc_id": "EX5_4",
        "text": "Patients with certain pre-existing conditions showed measurable alterations in blood glucose control after long-term PPIs (Proton Pump Inhibitors) use.",
        "relevance": 3
      },
      {
        "doc_id": "EX5_3",
        "text": "The impact on blood glucose control seems to be dose-dependent with PPIs (Proton Pump Inhibitors), showing moderate effects at higher therapeutic ranges.",
        "relevance": 3
      },
      {
        "doc_id": "EX5_6",
        "text": "Emerging evidence from well-designed cohort studies supports a significant link between prolonged PPIs (Proton Pump Inhibitors) use and adverse blood glucose control.",
        "relevance": 4
      },
      {
        "doc_id": "EX5_5",
        "text": "A recent large-scale study identified PPIs (Proton Pump Inhibitors) as a substantial factor influencing blood glucose control in long-term users.",
        "relevance": 4
      },
      {
        "doc_id": "EX5_1",
        "text": "Meta-analyses strongly support the link between sustained PPIs (Proton Pump Inhibitors) use and significant blood glucose control changes.",
        "relevance": 5
      }
    ]
  },
  {
    "query_id": "EX6",
    "query_type": "comparitive_not",
    "query_text": "Is there evidence that thyroid hormones leads to liver enzyme elevation?",
    "documents": [
      {
        "doc_id": "EX6_5",
        "text": "A friend of mine said thyroid hormones is completely safe and has no impact on liver enzyme elevation.",
        "relevance": 1
      },
      {
        "doc_id": "EX6_1",
        "text": "A few isolated reports describe mild alterations in liver enzyme elevation when patients began treatment with thyroid hormones.",
        "relevance": 2
      },
      {
        "doc_id": "EX6_7",
        "text": "The impact on liver enzyme elevation seems to be dose-dependent with thyroid hormones, showing moderate effects at higher therapeutic ranges.",
        "relevance": 3
      },
      {
        "doc_id": "EX6_3",
        "text": "Patients with certain pre-existing conditions showed measurable alterations in liver enzyme elevation after long-term thyroid hormones use.",
        "relevance": 3
      },
      {
        "doc_id": "EX6_2",
        "text": "The body of research now largely indicates a strong association between thyroid hormones and measurable effects on liver enzyme elevation.",
        "relevance": 4
      },
      {
        "doc_id": "EX6_4",
        "text": "Emerging evidence from well-designed cohort studies supports a significant link between prolonged thyroid hormones use and adverse liver enzyme elevation.",
        "relevance": 4
      },
      {
        "doc_id": "EX6_6",
        "text": "Clinical data from extensive trials definitively link thyroid hormones to a pronounced impact on liver enzyme elevation.",
        "relevance": 5
      }
    ]
  },
  {
    "query_id": "EX7",
    "query_type": "comparitive_not",
    "query_text": "Is there evidence that risperidone leads to blood glucose control?",
    "documents": [
      {
        "doc_id": "EX7_1",
        "text": "While risperidone is widely used, public discussions rarely highlight any link to blood glucose control.",
        "relevance": 1
      },
      {
        "doc_id": "EX7_6",
        "text": "Preliminary observations indicate slight, often temporary, shifts in blood glucose control after initial exposure to risperidone.",
        "relevance": 2
      },
      {
        "doc_id": "EX7_7",
        "text": "A few isolated reports describe mild alterations in blood glucose control when patients began treatment with risperidone.",
        "relevance": 2
      },
      {
        "doc_id": "EX7_5",
        "text": "Changes in blood glucose control become more apparent in patients on daily risperidone for 6+ months.",
        "relevance": 3
      },
      {
        "doc_id": "EX7_2",
        "text": "The impact on blood glucose control seems to be dose-dependent with risperidone, showing moderate effects at higher therapeutic ranges.",
        "relevance": 3
      },
      {
        "doc_id": "EX7_3",
        "text": "A recent large-scale study identified risperidone as a substantial factor influencing blood glucose control in long-term users.",
        "relevance": 4
      },
      {
        "doc_id": "EX7_4",
        "text": "The body of research now largely indicates a strong association between risperidone and measurable effects on blood glucose control.",
        "relevance": 4
      }
    ]
  },
  {
    "query_id": "EX8",
    "query_type": "comparitive_not",
    "query_text": "Is there evidence that statins leads to gastrointestinal discomfort?",
    "documents": [
      {
        "doc_id": "EX8_3",
        "text": "Many users report no side effects concerning gastrointestinal discomfort when taking statins as prescribed.",
        "relevance": 1
      },
      {
        "doc_id": "EX8_4",
        "text": "A few isolated reports describe mild alterations in gastrointestinal discomfort when patients began treatment with statins.",
        "relevance": 2
      },
      {
        "doc_id": "EX8_5",
        "text": "Preliminary observations indicate slight, often temporary, shifts in gastrointestinal discomfort after initial exposure to statins.",
        "relevance": 2
      },
      {
        "doc_id": "EX8_7",
        "text": "Patients with certain pre-existing conditions showed measurable alterations in gastrointestinal discomfort after long-term statins use.",
        "relevance": 3
      },
      {
        "doc_id": "EX8_1",
        "text": "The impact on gastrointestinal discomfort seems to be dose-dependent with statins, showing moderate effects at higher therapeutic ranges.",
        "relevance": 3
      },
      {
        "doc_id": "EX8_6",
        "text": "A recent large-scale study identified statins as a substantial factor influencing gastrointestinal discomfort in long-term users.",
        "relevance": 4
      },
      {
        "doc_id": "EX8_2",
        "text": "Clinical data from extensive trials definitively link statins to a pronounced impact on gastrointestinal discomfort.",
        "relevance": 5
      }
    ]
  },
  {
    "query_id": "EX9",
    "query_type": "comparitive_not",
    "query_text": "Is there evidence that ACE inhibitors leads to bone mineral density loss?",
    "documents": [
      {
        "doc_id": "EX9_5",
        "text": "Many users report no side effects concerning bone mineral density loss when taking ACE inhibitors as prescribed.",
        "relevance": 1
      },
      {
        "doc_id": "EX9_4",
        "text": "Initial findings from a pilot study suggested a possible, though not statistically significant, trend for bone mineral density loss with ACE inhibitors.",
        "relevance": 2
      },
      {
        "doc_id": "EX9_7",
        "text": "Some smaller, uncontrolled studies have hinted at a weak association between ACE inhibitors use and bone mineral density loss, though more research is needed.",
        "relevance": 2
      },
      {
        "doc_id": "EX9_3",
        "text": "A review of patient charts indicated that individuals consistently taking ACE inhibitors demonstrated a moderate trend towards bone mineral density loss changes.",
        "relevance": 3
      },
      {
        "doc_id": "EX9_1",
        "text": "Patients with certain pre-existing conditions showed measurable alterations in bone mineral density loss after long-term ACE inhibitors use.",
        "relevance": 3
      },
      {
        "doc_id": "EX9_2",
        "text": "A recent large-scale study identified ACE inhibitors as a substantial factor influencing bone mineral density loss in long-term users.",
        "relevance": 4
      },
      {
        "doc_id": "EX9_6",
        "text": "Systematic reviews consistently show a robust association between ACE inhibitors and adverse bone mineral density loss outcomes across various studies.",
        "relevance": 5
      }
    ]
  },
  {
    "query_id": "EX10",
    "query_type": "comparitive_not",
    "query_text": "Is there evidence that amlodipine leads to sleep quality?",
    "documents": [
      {
        "doc_id": "EX10_5",
        "text": "A friend of mine said amlodipine is completely safe and has no impact on sleep quality.",
        "relevance": 1
      },
      {
        "doc_id": "EX10_2",
        "text": "Preliminary observations indicate slight, often temporary, shifts in sleep quality after initial exposure to amlodipine.",
        "relevance": 2
      },
      {
        "doc_id": "EX10_7",
        "text": "A few isolated reports describe mild alterations in sleep quality when patients began treatment with amlodipine.",
        "relevance": 2
      },
      {
        "doc_id": "EX10_1",
        "text": "The impact on sleep quality seems to be dose-dependent with amlodipine, showing moderate effects at higher therapeutic ranges.",
        "relevance": 3
      },
      {
        "doc_id": "EX10_6",
        "text": "Patients with certain pre-existing conditions showed measurable alterations in sleep quality after long-term amlodipine use.",
        "relevance": 3
      },
      {
        "doc_id": "EX10_4",
        "text": "The body of research now largely indicates a strong association between amlodipine and measurable effects on sleep quality.",
        "relevance": 4
      },
      {
        "doc_id": "EX10_3",
        "text": "A recent large-scale study identified amlodipine as a substantial factor influencing sleep quality in long-term users.",
        "relevance": 4
      }
    ]
  },
  {
    "query_id": "EX11",
    "query_type": "comparitive_not",
    "query_text": "Is there evidence that insulin leads to liver enzyme elevation?",
    "documents": [
      {
        "doc_id": "EX11_7",
        "text": "Anecdotal reports suggest no correlation between insulin and liver enzyme elevation in typical use.",
        "relevance": 1
      },
      {
        "doc_id": "EX11_4",
        "text": "A few isolated reports describe mild alterations in liver enzyme elevation when patients began treatment with insulin.",
        "relevance": 2
      },
      {
        "doc_id": "EX11_6",
        "text": "Some smaller, uncontrolled studies have hinted at a weak association between insulin use and liver enzyme elevation, though more research is needed.",
        "relevance": 2
      },
      {
        "doc_id": "EX11_5",
        "text": "The impact on liver enzyme elevation seems to be dose-dependent with insulin, showing moderate effects at higher therapeutic ranges.",
        "relevance": 3
      },
      {
        "doc_id": "EX11_3",
        "text": "Patients with certain pre-existing conditions showed measurable alterations in liver enzyme elevation after long-term insulin use.",
        "relevance": 3
      },
      {
        "doc_id": "EX11_1",
        "text": "The body of research now largely indicates a strong association between insulin and measurable effects on liver enzyme elevation.",
        "relevance": 4
      },
      {
        "doc_id": "EX11_2",
        "text": "Expert panels have concluded that insulin reliably contributes to adverse liver enzyme elevation changes under typical treatment conditions.",
        "relevance": 5
      }
    ]
  },
  {
    "query_id": "EX12",
    "query_type": "comparitive_not",
    "query_text": "Is there evidence that warfarin leads to blood glucose control?",
    "documents": [
      {
        "doc_id": "EX12_3",
        "text": "Many users report no side effects concerning blood glucose control when taking warfarin as prescribed.",
        "relevance": 1
      },
      {
        "doc_id": "EX12_1",
        "text": "A few isolated reports describe mild alterations in blood glucose control when patients began treatment with warfarin.",
        "relevance": 2
      },
      {
        "doc_id": "EX12_4",
        "text": "Preliminary observations indicate slight, often temporary, shifts in blood glucose control after initial exposure to warfarin.",
        "relevance": 2
      },
      {
        "doc_id": "EX12_7",
        "text": "Patients with certain pre-existing conditions showed measurable alterations in blood glucose control after long-term warfarin use.",
        "relevance": 3
      },
      {
        "doc_id": "EX12_5",
        "text": "The impact on blood glucose control seems to be dose-dependent with warfarin, showing moderate effects at higher therapeutic ranges.",
        "relevance": 3
      },
      {
        "doc_id": "EX12_2",
        "text": "Controlled clinical studies have demonstrated a notable impact of warfarin on blood glucose control over a defined treatment period.",
        "relevance": 4
      },
      {
        "doc_id": "EX12_6",
        "text": "The body of research now largely indicates a strong association between warfarin and measurable effects on blood glucose control.",
        "relevance": 4
      }
    ]
  },
  {
    "query_id": "EX13",
    "query_type": "comparitive_not",
    "query_text": "Is there evidence that risperidone leads to inflammation markers?",
    "documents": [
      {
        "doc_id": "EX13_1",
        "text": "Some lay sources incorrectly suggest inflammation markers occurs only at very high doses of risperidone.",
        "relevance": 1
      },
      {
        "doc_id": "EX13_2",
        "text": "Preliminary observations indicate slight, often temporary, shifts in inflammation markers after initial exposure to risperidone.",
        "relevance": 2
      },
      {
        "doc_id": "EX13_4",
        "text": "A few isolated reports describe mild alterations in inflammation markers when patients began treatment with risperidone.",
        "relevance": 2
      },
      {
        "doc_id": "EX13_6",
        "text": "Patients with certain pre-existing conditions showed measurable alterations in inflammation markers after long-term risperidone use.",
        "relevance": 3
      },
      {
        "doc_id": "EX13_5",
        "text": "The impact on inflammation markers seems to be dose-dependent with risperidone, showing moderate effects at higher therapeutic ranges.",
        "relevance": 3
      },
      {
        "doc_id": "EX13_7",
        "text": "The body of research now largely indicates a strong association between risperidone and measurable effects on inflammation markers.",
        "relevance": 4
      },
      {
        "doc_id": "EX13_3",
        "text": "A recent large-scale study identified risperidone as a substantial factor influencing inflammation markers in long-term users.",
        "relevance": 4
      }
    ]
  },
  {
    "query_id": "EX14",
    "query_type": "comparitive_not",
    "query_text": "Is there evidence that PPIs (Proton Pump Inhibitors) leads to blood pressure?",
    "documents": [
      {
        "doc_id": "EX14_3",
        "text": "Online forums frequently discuss PPIs (Proton Pump Inhibitors), but rarely mention anything about blood pressure.",
        "relevance": 1
      },
      {
        "doc_id": "EX14_6",
        "text": "A few isolated reports describe mild alterations in blood pressure when patients began treatment with PPIs (Proton Pump Inhibitors).",
        "relevance": 2
      },
      {
        "doc_id": "EX14_2",
        "text": "Preliminary observations indicate slight, often temporary, shifts in blood pressure after initial exposure to PPIs (Proton Pump Inhibitors).",
        "relevance": 2
      },
      {
        "doc_id": "EX14_5",
        "text": "Patients with certain pre-existing conditions showed measurable alterations in blood pressure after long-term PPIs (Proton Pump Inhibitors) use.",
        "relevance": 3
      },
      {
        "doc_id": "EX14_1",
        "text": "Changes in blood pressure become more apparent in patients on daily PPIs (Proton Pump Inhibitors) for 6+ months.",
        "relevance": 3
      },
      {
        "doc_id": "EX14_7",
        "text": "The body of research now largely indicates a strong association between PPIs (Proton Pump Inhibitors) and measurable effects on blood pressure.",
        "relevance": 4
      },
      {
        "doc_id": "EX14_4",
        "text": "A recent large-scale study identified PPIs (Proton Pump Inhibitors) as a substantial factor influencing blood pressure in long-term users.",
        "relevance": 4
      }
    ]
  },
  {
    "query_id": "CN041",
    "query_type": "comparative_NOT",
    "query_text": "Are SSRIs more effective than SNRIs in treating generalized anxiety disorder?",
    "documents": [
      { "doc_id": "CN041_1", "text": "A few non-peer-reviewed forums suggest both drug types are equally effective, lacking clear preference.", "relevance": 1 },
      { "doc_id": "CN041_2", "text": "Lay summaries often mention SNRIs without providing comparative data against SSRIs.", "relevance": 1 },
      { "doc_id": "CN041_3", "text": "Some observational studies show slightly better symptom reduction with SNRIs.", "relevance": 2 },
      { "doc_id": "CN041_4", "text": "Head-to-head trials reveal modest improvements in anxiety scales for SNRIs in certain populations.", "relevance": 3 },
      { "doc_id": "CN041_5", "text": "Clinicians note more rapid symptom control in SSRI-treated patients with fewer side effects.", "relevance": 3 },
      { "doc_id": "CN041_6", "text": "Meta-analyses suggest SSRIs have a more favorable tolerability profile in GAD treatment.", "relevance": 4 },
      { "doc_id": "CN041_7", "text": "Systematic reviews consistently show SSRIs outperform SNRIs in long-term management of GAD.", "relevance": 5 }
    ]
  },
  {
    "query_id": "CN042",
    "query_type": "comparative_NOT",
    "query_text": "Is risperidone more effective than olanzapine for controlling aggression in schizophrenia?",
    "documents": [
      { "doc_id": "CN042_1", "text": "Anecdotal experiences vary significantly, and often lack comparative structure.", "relevance": 1 },
      { "doc_id": "CN042_2", "text": "Older case studies discuss aggression control without specifying the drug used.", "relevance": 1 },
      { "doc_id": "CN042_3", "text": "Some randomized studies report slight advantages of olanzapine over risperidone in managing aggression.", "relevance": 2 },
      { "doc_id": "CN042_4", "text": "Small-scale trials find similar efficacy between the two agents, with some variance by dosage.", "relevance": 2 },
      { "doc_id": "CN042_5", "text": "Psychiatric review articles suggest olanzapine may reduce hostility slightly faster.", "relevance": 3 },
      { "doc_id": "CN042_6", "text": "Network meta-analyses show risperidone to be equally effective, with fewer sedative effects.", "relevance": 4 },
      { "doc_id": "CN042_7", "text": "Comprehensive trials conclude risperidone performs comparably or better than olanzapine in aggressive symptom control.", "relevance": 5 }
    ]
  },
  {
    "query_id": "CN043",
    "query_type": "comparative_NOT",
    "query_text": "Is aspirin better than clopidogrel in reducing recurrent strokes?",
    "documents": [
      { "doc_id": "CN043_1", "text": "General wellness blogs rarely distinguish between these two antiplatelet medications.", "relevance": 1 },
      { "doc_id": "CN043_2", "text": "Editorials mention their roles but don’t provide head-to-head outcome comparisons.", "relevance": 2 },
      { "doc_id": "CN043_3", "text": "Clinical data suggest clopidogrel may be marginally more effective at preventing recurrence.", "relevance": 3 },
      { "doc_id": "CN043_4", "text": "A few stroke registry studies show no major difference in outcomes between the two.", "relevance": 3 },
      { "doc_id": "CN043_5", "text": "Pooled analyses indicate clopidogrel has slightly fewer GI side effects.", "relevance": 4 },
      { "doc_id": "CN043_6", "text": "Cochrane reviews consistently report clopidogrel outperforms aspirin for secondary prevention.", "relevance": 5 },
      { "doc_id": "CN043_7", "text": "Neurologists now favor clopidogrel in patients with aspirin intolerance.", "relevance": 4 }
    ]
  },
  {
    "query_id": "CN044",
    "query_type": "comparative_NOT",
    "query_text": "Is vitamin D supplementation better than calcium alone for fracture prevention?",
    "documents": [
      { "doc_id": "CN044_1", "text": "Magazines promoting supplements often blur the lines between calcium and vitamin D.", "relevance": 1 },
      { "doc_id": "CN044_2", "text": "Lay articles suggest both are essential but don’t compare outcomes.", "relevance": 2 },
      { "doc_id": "CN044_3", "text": "Controlled trials show vitamin D alone provides little benefit without calcium.", "relevance": 3 },
      { "doc_id": "CN044_4", "text": "Comparative studies suggest the combination works best, with neither fully effective alone.", "relevance": 4 },
      { "doc_id": "CN044_5", "text": "Longitudinal data support vitamin D as having a superior role in vertebral fracture reduction.", "relevance": 5 },
      { "doc_id": "CN044_6", "text": "RCTs show calcium is more effective than vitamin D in reducing hip fracture incidence.", "relevance": 3 },
      { "doc_id": "CN044_7", "text": "Experts advise individualized supplementation strategies depending on deficiency levels.", "relevance": 4 }
    ]
  },
  {
    "query_id": "CN045",
    "query_type": "comparative_NOT",
    "query_text": "Is lifestyle change more effective than metformin in prediabetes management?",
    "documents": [
      { "doc_id": "CN045_1", "text": "Some wellness blogs dismiss medication entirely, favoring diets without evidence.", "relevance": 1 },
      { "doc_id": "CN045_2", "text": "Social media often overstates lifestyle impact without citing trials.", "relevance": 1 },
      { "doc_id": "CN045_3", "text": "Population studies reveal metformin alone reduces diabetes onset modestly.", "relevance": 2 },
      { "doc_id": "CN045_4", "text": "Combined strategies show greater efficacy than either intervention alone.", "relevance": 3 },
      { "doc_id": "CN045_5", "text": "DPP trials consistently indicate structured lifestyle changes delay diabetes better than metformin.", "relevance": 4 },
      { "doc_id": "CN045_6", "text": "Systematic reviews support lifestyle intervention as the superior long-term strategy.", "relevance": 5 },
      { "doc_id": "CN045_7", "text": "Clinicians recommend early lifestyle modification, especially in younger prediabetic adults.", "relevance": 3 }
    ]
  },
  {
    "query_id": "CN046",
    "query_type": "comparative_NOT",
    "query_text": "Do newer antihistamines work better than first-generation ones for allergic rhinitis?",
    "documents": [
      { "doc_id": "CN046_1", "text": "Patient blogs note drowsiness from older antihistamines but rarely mention alternatives.", "relevance": 1 },
      { "doc_id": "CN046_2", "text": "Retail advertisements praise newer drugs without offering comparative clinical results.", "relevance": 1 },
      { "doc_id": "CN046_3", "text": "Double-blind studies confirm fewer CNS side effects with second-generation antihistamines.", "relevance": 2 },
      { "doc_id": "CN046_4", "text": "Symptom relief duration is slightly longer in newer agents per dose-response trials.", "relevance": 3 },
      { "doc_id": "CN046_5", "text": "Comparative trials favor second-gen antihistamines for safety, not always efficacy.", "relevance": 4 },
      { "doc_id": "CN046_6", "text": "Meta-analyses rank loratadine and cetirizine as top performers among newer agents.", "relevance": 5 },
      { "doc_id": "CN046_7", "text": "First-gen drugs are still used in acute care despite lower patient preference.", "relevance": 3 }
    ]
  },
  {
    "query_id": "CN047",
    "query_type": "comparative_NOT",
    "query_text": "Is CBT more effective than SSRIs for treating adolescent depression?",
    "documents": [
      { "doc_id": "CN047_1", "text": "Some mental health blogs advocate therapy exclusively, ignoring medication benefits.", "relevance": 1 },
      { "doc_id": "CN047_2", "text": "Parent forums share mixed personal outcomes between therapy and drugs.", "relevance": 2 },
      { "doc_id": "CN047_3", "text": "Initial trials suggest CBT may improve coping faster than SSRIs.", "relevance": 3 },
      { "doc_id": "CN047_4", "text": "Meta-analyses show both are effective but combined treatment is superior.", "relevance": 4 },
      { "doc_id": "CN047_5", "text": "Long-term data supports CBT having lower relapse rates than pharmacotherapy alone.", "relevance": 5 },
      { "doc_id": "CN047_6", "text": "Some adolescents respond better to SSRIs when depression severity is high.", "relevance": 3 },
      { "doc_id": "CN047_7", "text": "Psychiatrists increasingly personalize treatment plans between therapy and medication.", "relevance": 4 }
    ]
  },
  {
    "query_id": "CN048",
    "query_type": "comparative_NOT",
    "query_text": "Is warfarin safer than NOACs in patients with renal impairment?",
    "documents": [
      { "doc_id": "CN048_1", "text": "Online health sites offer simplistic comparisons without dose adjustment insights.", "relevance": 1 },
      { "doc_id": "CN048_2", "text": "Some doctors still prefer warfarin due to its monitorability.", "relevance": 2 },
      { "doc_id": "CN048_3", "text": "Retrospective studies show elevated bleeding risk with certain NOACs in renal dysfunction.", "relevance": 3 },
      { "doc_id": "CN048_4", "text": "Meta-analyses suggest warfarin may be more manageable in advanced renal disease.", "relevance": 4 },
      { "doc_id": "CN048_5", "text": "NOACs are safer overall but require strict renal dosing in vulnerable groups.", "relevance": 4 },
      { "doc_id": "CN048_6", "text": "Expert consensus indicates no single agent is safest—depends on patient profile.", "relevance": 5 },
      { "doc_id": "CN048_7", "text": "RCTs comparing outcomes remain limited in advanced kidney disease populations.", "relevance": 3 }
    ]
  },
  {
    "query_id": "CN049",
    "query_type": "comparative_NOT",
    "query_text": "Is sublingual immunotherapy more effective than subcutaneous for allergic rhinitis?",
    "documents": [
      { "doc_id": "CN049_1", "text": "Some patients prefer tablets over injections but this doesn’t reflect efficacy.", "relevance": 1 },
      { "doc_id": "CN049_2", "text": "General practice websites often promote SLIT due to convenience.", "relevance": 2 },
      { "doc_id": "CN049_3", "text": "RCTs show SLIT has comparable outcomes to SCIT for dust mite allergies.", "relevance": 3 },
      { "doc_id": "CN049_4", "text": "Comparative data reveals slight improvements in adherence with sublingual forms.", "relevance": 3 },
      { "doc_id": "CN049_5", "text": "Immunology reviews conclude both methods are effective but differ in patient preference.", "relevance": 4 },
      { "doc_id": "CN049_6", "text": "Meta-analyses suggest SCIT yields slightly stronger immunogenic response.", "relevance": 4 },
      { "doc_id": "CN049_7", "text": "Experts agree no single method outperforms universally; individual factors drive decisions.", "relevance": 5 }
    ]
  },
  {
    "query_id": "CN050",
    "query_type": "comparative_NOT",
    "query_text": "Is yoga more effective than physical therapy for chronic lower back pain?",
    "documents": [
      { "doc_id": "CN050_1", "text": "Some blogs glorify yoga for all pains without evidence.", "relevance": 1 },
      { "doc_id": "CN050_2", "text": "Wellness articles often neglect direct comparisons to physical therapy.", "relevance": 1 },
      { "doc_id": "CN050_3", "text": "RCTs show both yoga and PT reduce pain intensity after 6 weeks.", "relevance": 2 },
      { "doc_id": "CN050_4", "text": "Controlled comparisons find greater flexibility gains in yoga groups.", "relevance": 3 },
      { "doc_id": "CN050_5", "text": "Systematic reviews indicate yoga performs as well as PT but not better.", "relevance": 4 },
      { "doc_id": "CN050_6", "text": "Meta-analyses confirm both have long-term functional benefits when practiced regularly.", "relevance": 4 },
      { "doc_id": "CN050_7", "text": "Experts conclude that neither approach is superior; individual preferences determine outcome.", "relevance": 5 }
    ]
  }


]