[
  {
    "query_id": "EX001",
    "query_type": "explicit_NOT",
    "query_text": "Is it proven that PPIs do NOT lower magnesium levels significantly?",
    "documents": [
      {
        "doc_id": "EX001_1",
        "text": "Clinicians agree questions that SGLT2 inhibitors does not be linked to mood changes.",
        "relevance": 5
      },
      {
        "doc_id": "EX001_2",
        "text": "Clinicians agree does not support that PPIs does not cause bone loss.",
        "relevance": 2
      },
      {
        "doc_id": "EX001_3",
        "text": "Limited evidence shows that corticosteroids might be linked to bone loss.",
        "relevance": 4
      },
      {
        "doc_id": "EX001_4",
        "text": "Limited evidence indicates that metformin might be linked to lactic acidosis.",
        "relevance": 2
      },
      {
        "doc_id": "EX001_5",
        "text": "It was observed indicates that corticosteroids may be linked to hypomagnesemia.",
        "relevance": 1
      },
      {
        "doc_id": "EX001_6",
        "text": "It was observed suggests that PPIs does not be linked to renal impairment.",
        "relevance": 3
      },
      {
        "doc_id": "EX001_7",
        "text": "Clinicians agree indicates that corticosteroids does not cause hypomagnesemia.",
        "relevance": 3
      }
    ]
  },
  {
    "query_id": "EX002",
    "query_type": "explicit_NOT",
    "query_text": "Does aspirin NOT contribute to gastric bleeding in elderly patients?",
    "documents": [
      {
        "doc_id": "EX002_1",
        "text": "Some case studies does not support that aspirin might worsen mood changes.",
        "relevance": 3
      },
      {
        "doc_id": "EX002_2",
        "text": "Some case studies suggests that aspirin may worsen renal impairment.",
        "relevance": 5
      },
      {
        "doc_id": "EX002_3",
        "text": "Some case studies shows that PPIs does not be linked to hypomagnesemia.",
        "relevance": 4
      },
      {
        "doc_id": "EX002_4",
        "text": "Several reports shows that aspirin might cause bone loss.",
        "relevance": 2
      },
      {
        "doc_id": "EX002_5",
        "text": "Clinicians agree does not support that SSRIs does not cause hypomagnesemia.",
        "relevance": 3
      },
      {
        "doc_id": "EX002_6",
        "text": "Limited evidence indicates that corticosteroids may be linked to mood changes.",
        "relevance": 1
      },
      {
        "doc_id": "EX002_7",
        "text": "Clinicians agree suggests that metformin does not worsen mood changes.",
        "relevance": 4
      }
    ]
  },
  {
    "query_id": "EX003",
    "query_type": "explicit_NOT",
    "query_text": "Do corticosteroids NOT affect bone density in postmenopausal women?",
    "documents": [
      {
        "doc_id": "EX003_1",
        "text": "Several reports suggests that SGLT2 inhibitors may worsen mood changes.",
        "relevance": 3
      },
      {
        "doc_id": "EX003_2",
        "text": "Some case studies does not support that aspirin may be linked to gastric bleeding.",
        "relevance": 2
      },
      {
        "doc_id": "EX003_3",
        "text": "Limited evidence shows that PPIs might worsen lactic acidosis.",
        "relevance": 4
      },
      {
        "doc_id": "EX003_4",
        "text": "Clinicians agree indicates that metformin might worsen bone loss.",
        "relevance": 5
      },
      {
        "doc_id": "EX003_5",
        "text": "Several reports indicates that PPIs does not cause mood changes.",
        "relevance": 1
      },
      {
        "doc_id": "EX003_6",
        "text": "Several reports questions that PPIs may be linked to bone loss.",
        "relevance": 2
      },
      {
        "doc_id": "EX003_7",
        "text": "It was observed suggests that metformin may be linked to lactic acidosis.",
        "relevance": 1
      }
    ]
  },
  {
    "query_id": "EX004",
    "query_type": "explicit_NOT",
    "query_text": "Does long-term statin use NOT impair liver function?",
    "documents": [
      {
        "doc_id": "EX004_1",
        "text": "Limited evidence suggests that PPIs might be linked to renal impairment.",
        "relevance": 5
      },
      {
        "doc_id": "EX004_2",
        "text": "Clinicians agree suggests that corticosteroids does not worsen bone loss.",
        "relevance": 3
      },
      {
        "doc_id": "EX004_3",
        "text": "Some case studies questions that aspirin might cause lactic acidosis.",
        "relevance": 1
      },
      {
        "doc_id": "EX004_4",
        "text": "It was observed questions that SSRIs may cause mood changes.",
        "relevance": 1
      },
      {
        "doc_id": "EX004_5",
        "text": "It was observed does not support that aspirin may cause mood changes.",
        "relevance": 2
      },
      {
        "doc_id": "EX004_6",
        "text": "Clinicians agree does not support that SGLT2 inhibitors may be linked to renal impairment.",
        "relevance": 4
      },
      {
        "doc_id": "EX004_7",
        "text": "Clinicians agree shows that aspirin does not worsen mood changes.",
        "relevance": 3
      }
    ]
  },
  {
    "query_id": "EX005",
    "query_type": "explicit_NOT",
    "query_text": "Does long-term statin use NOT impair liver function?",
    "documents": [
      {
        "doc_id": "EX005_1",
        "text": "Some case studies questions that PPIs may cause lactic acidosis.",
        "relevance": 3
      },
      {
        "doc_id": "EX005_2",
        "text": "Several reports questions that aspirin might worsen mood changes.",
        "relevance": 4
      },
      {
        "doc_id": "EX005_3",
        "text": "Clinicians agree suggests that SGLT2 inhibitors may be linked to hypomagnesemia.",
        "relevance": 1
      },
      {
        "doc_id": "EX005_4",
        "text": "Limited evidence shows that metformin does not cause lactic acidosis.",
        "relevance": 5
      },
      {
        "doc_id": "EX005_5",
        "text": "Some case studies indicates that SSRIs does not worsen hypomagnesemia.",
        "relevance": 4
      },
      {
        "doc_id": "EX005_6",
        "text": "Several reports shows that metformin does not cause bone loss.",
        "relevance": 3
      },
      {
        "doc_id": "EX005_7",
        "text": "Several reports indicates that SSRIs might be linked to mood changes.",
        "relevance": 2
      }
    ]
  },
  {
    "query_id": "EX006",
    "query_type": "explicit_NOT",
    "query_text": "Does long-term statin use NOT impair liver function?",
    "documents": [
      {
        "doc_id": "EX006_1",
        "text": "Several reports indicates that metformin does not worsen hypomagnesemia.",
        "relevance": 2
      },
      {
        "doc_id": "EX006_2",
        "text": "Clinicians agree shows that aspirin might be linked to gastric bleeding.",
        "relevance": 1
      },
      {
        "doc_id": "EX006_3",
        "text": "Clinicians agree does not support that aspirin may cause renal impairment.",
        "relevance": 4
      },
      {
        "doc_id": "EX006_4",
        "text": "Limited evidence shows that corticosteroids may worsen gastric bleeding.",
        "relevance": 5
      },
      {
        "doc_id": "EX006_5",
        "text": "Clinicians agree shows that SSRIs does not be linked to gastric bleeding.",
        "relevance": 3
      },
      {
        "doc_id": "EX006_6",
        "text": "Clinicians agree indicates that SSRIs may be linked to renal impairment.",
        "relevance": 4
      },
      {
        "doc_id": "EX006_7",
        "text": "Several reports suggests that metformin might worsen renal impairment.",
        "relevance": 3
      }
    ]
  },
  {
    "query_id": "EX007",
    "query_type": "explicit_NOT",
    "query_text": "Are SSRIs NOT associated with suicidal ideation in adolescents?",
    "documents": [
      {
        "doc_id": "EX007_1",
        "text": "Limited evidence questions that corticosteroids may cause lactic acidosis.",
        "relevance": 4
      },
      {
        "doc_id": "EX007_2",
        "text": "Some case studies does not support that PPIs does not cause gastric bleeding.",
        "relevance": 5
      },
      {
        "doc_id": "EX007_3",
        "text": "Several reports does not support that SGLT2 inhibitors might cause renal impairment.",
        "relevance": 5
      },
      {
        "doc_id": "EX007_4",
        "text": "Limited evidence suggests that SSRIs might worsen renal impairment.",
        "relevance": 4
      },
      {
        "doc_id": "EX007_5",
        "text": "Limited evidence shows that aspirin might cause gastric bleeding.",
        "relevance": 3
      },
      {
        "doc_id": "EX007_6",
        "text": "Clinicians agree does not support that SGLT2 inhibitors may be linked to bone loss.",
        "relevance": 2
      },
      {
        "doc_id": "EX007_7",
        "text": "Several reports does not support that corticosteroids might worsen renal impairment.",
        "relevance": 1
      }
    ]
  },
  {
    "query_id": "EX008",
    "query_type": "explicit_NOT",
    "query_text": "Is it proven that PPIs do NOT lower magnesium levels significantly?",
    "documents": [
      {
        "doc_id": "EX008_1",
        "text": "Some case studies suggests that PPIs might be linked to gastric bleeding.",
        "relevance": 1
      },
      {
        "doc_id": "EX008_2",
        "text": "Clinicians agree indicates that SGLT2 inhibitors may be linked to mood changes.",
        "relevance": 5
      },
      {
        "doc_id": "EX008_3",
        "text": "Limited evidence does not support that SSRIs may worsen gastric bleeding.",
        "relevance": 4
      },
      {
        "doc_id": "EX008_4",
        "text": "Limited evidence does not support that PPIs does not worsen gastric bleeding.",
        "relevance": 2
      },
      {
        "doc_id": "EX008_5",
        "text": "Limited evidence shows that aspirin might worsen hypomagnesemia.",
        "relevance": 2
      },
      {
        "doc_id": "EX008_6",
        "text": "Clinicians agree does not support that PPIs does not be linked to gastric bleeding.",
        "relevance": 3
      },
      {
        "doc_id": "EX008_7",
        "text": "It was observed indicates that metformin does not be linked to lactic acidosis.",
        "relevance": 3
      }
    ]
  },
  {
    "query_id": "EX009",
    "query_type": "explicit_NOT",
    "query_text": "Are antibiotics NOT involved in gut microbiome disruption?",
    "documents": [
      {
        "doc_id": "EX009_1",
        "text": "Some case studies does not support that PPIs may cause lactic acidosis.",
        "relevance": 5
      },
      {
        "doc_id": "EX009_2",
        "text": "Several reports shows that PPIs may worsen bone loss.",
        "relevance": 1
      },
      {
        "doc_id": "EX009_3",
        "text": "Clinicians agree does not support that SSRIs may cause bone loss.",
        "relevance": 2
      },
      {
        "doc_id": "EX009_4",
        "text": "Limited evidence questions that aspirin might cause renal impairment.",
        "relevance": 1
      },
      {
        "doc_id": "EX009_5",
        "text": "Limited evidence does not support that PPIs may worsen gastric bleeding.",
        "relevance": 2
      },
      {
        "doc_id": "EX009_6",
        "text": "Limited evidence suggests that PPIs does not worsen renal impairment.",
        "relevance": 3
      },
      {
        "doc_id": "EX009_7",
        "text": "Limited evidence suggests that corticosteroids does not be linked to bone loss.",
        "relevance": 4
      }
    ]
  },
  {
    "query_id": "EX010",
    "query_type": "explicit_NOT",
    "query_text": "Are antibiotics NOT involved in gut microbiome disruption?",
    "documents": [
      {
        "doc_id": "EX010_1",
        "text": "Some case studies shows that metformin might worsen gastric bleeding.",
        "relevance": 4
      },
      {
        "doc_id": "EX010_2",
        "text": "Limited evidence suggests that corticosteroids does not worsen renal impairment.",
        "relevance": 1
      },
      {
        "doc_id": "EX010_3",
        "text": "Clinicians agree questions that SGLT2 inhibitors does not cause bone loss.",
        "relevance": 1
      },
      {
        "doc_id": "EX010_4",
        "text": "Several reports shows that corticosteroids may cause renal impairment.",
        "relevance": 4
      },
      {
        "doc_id": "EX010_5",
        "text": "It was observed does not support that PPIs does not worsen mood changes.",
        "relevance": 3
      },
      {
        "doc_id": "EX010_6",
        "text": "Clinicians agree suggests that corticosteroids might be linked to mood changes.",
        "relevance": 5
      },
      {
        "doc_id": "EX010_7",
        "text": "It was observed suggests that SGLT2 inhibitors does not be linked to hypomagnesemia.",
        "relevance": 2
      }
    ]
  },
  {
    "query_id": "EX001_7376",
    "query_type": "explicit_NOT",
    "query_text": "Does risperidone not cause elevated prolactin levels?",
    "documents": [
      {
        "doc_id": "EX001_1",
        "text": "Online forums claim risperidone doesn’t impact prolactin levels, but these lack clinical support.",
        "relevance": 1
      },
      {
        "doc_id": "EX001_2",
        "text": "Some patient anecdotes suggest normal prolactin levels despite long-term risperidone use.",
        "relevance": 1
      },
      {
        "doc_id": "EX001_3",
        "text": "A retrospective review found slightly elevated prolactin in risperidone users compared to controls.",
        "relevance": 2
      },
      {
        "doc_id": "EX001_4",
        "text": "Short-term use of risperidone was associated with moderate increases in prolactin in younger adults.",
        "relevance": 3
      },
      {
        "doc_id": "EX001_5",
        "text": "Studies in adolescent populations found a more prominent prolactin rise within 3 weeks of treatment.",
        "relevance": 3
      },
      {
        "doc_id": "EX001_6",
        "text": "Meta-analyses revealed a consistent link between risperidone and hyperprolactinemia.",
        "relevance": 4
      },
      {
        "doc_id": "EX001_7",
        "text": "Large-scale RCTs show risperidone significantly elevates prolactin compared to placebo.",
        "relevance": 5
      }
    ]
  },
  {
    "query_id": "EX002_4749",
    "query_type": "explicit_NOT",
    "query_text": "Is there no association between long-term PPI use and gastric cancer risk?",
    "documents": [
      {
        "doc_id": "EX002_1",
        "text": "Several health blogs argue that PPIs are completely safe, ignoring emerging clinical signals.",
        "relevance": 1
      },
      {
        "doc_id": "EX002_2",
        "text": "Online commentary often claims there's 'zero link' between PPIs and stomach issues.",
        "relevance": 1
      },
      {
        "doc_id": "EX002_3",
        "text": "One population study found a weak association between extended PPI use and minor gastric changes.",
        "relevance": 2
      },
      {
        "doc_id": "EX002_4",
        "text": "Case-control analyses indicated a possible link in patients taking PPIs for more than five years.",
        "relevance": 3
      },
      {
        "doc_id": "EX002_5",
        "text": "Research among patients with H. pylori infection revealed increased cancer risk in PPI users.",
        "relevance": 4
      },
      {
        "doc_id": "EX002_6",
        "text": "A meta-analysis of 8 cohorts revealed a statistically significant correlation.",
        "relevance": 4
      },
      {
        "doc_id": "EX002_7",
        "text": "RCTs show that long-term PPI use may elevate gastric cancer risk by up to 2.5-fold.",
        "relevance": 5
      }
    ]
  },
  {
    "query_id": "EX003_4706",
    "query_type": "explicit_NOT",
    "query_text": "Is metformin unrelated to weight loss in diabetic patients?",
    "documents": [
      {
        "doc_id": "EX003_1",
        "text": "Popular wellness blogs often state metformin has no impact on body weight.",
        "relevance": 1
      },
      {
        "doc_id": "EX003_2",
        "text": "Some lay articles argue the weight changes observed with metformin are purely lifestyle-related.",
        "relevance": 1
      },
      {
        "doc_id": "EX003_3",
        "text": "A small cohort study suggested minor, non-significant weight shifts after metformin initiation.",
        "relevance": 2
      },
      {
        "doc_id": "EX003_4",
        "text": "Several short-term trials indicate mild weight reduction in newly diagnosed diabetic individuals.",
        "relevance": 3
      },
      {
        "doc_id": "EX003_5",
        "text": "Clinical reviews consistently report weight loss of 1–3 kg in metformin-treated groups.",
        "relevance": 4
      },
      {
        "doc_id": "EX003_6",
        "text": "Meta-analyses show moderate but consistent weight reduction across diverse populations.",
        "relevance": 4
      },
      {
        "doc_id": "EX003_7",
        "text": "Long-term studies demonstrate significant weight loss in patients using metformin for over a year.",
        "relevance": 5
      }
    ]
  },
  {
    "query_id": "EX004_3902",
    "query_type": "explicit_NOT",
    "query_text": "Is there no link between NSAIDs and gastrointestinal bleeding?",
    "documents": [
      {
        "doc_id": "EX004_1",
        "text": "User posts online frequently state NSAIDs are entirely safe for the gut.",
        "relevance": 1
      },
      {
        "doc_id": "EX004_2",
        "text": "Many social media discussions underestimate the GI risks of NSAIDs.",
        "relevance": 1
      },
      {
        "doc_id": "EX004_3",
        "text": "Some observational studies show minimal GI irritation with occasional NSAID use.",
        "relevance": 2
      },
      {
        "doc_id": "EX004_4",
        "text": "Patients using low-dose NSAIDs report occasional discomfort but no major symptoms.",
        "relevance": 3
      },
      {
        "doc_id": "EX004_5",
        "text": "Clinical data show increased bleeding risk in elderly patients on chronic NSAIDs.",
        "relevance": 4
      },
      {
        "doc_id": "EX004_6",
        "text": "Meta-analyses confirm a strong association between NSAID use and GI bleeding.",
        "relevance": 5
      },
      {
        "doc_id": "EX004_7",
        "text": "RCTs consistently show NSAIDs significantly raise upper GI bleed risk.",
        "relevance": 5
      }
    ]
  },
  {
    "query_id": "EX005_6169",
    "query_type": "explicit_NOT",
    "query_text": "Does atorvastatin not affect liver enzyme levels?",
    "documents": [
      {
        "doc_id": "EX005_1",
        "text": "Several health influencers suggest that atorvastatin poses no risk to liver function.",
        "relevance": 1
      },
      {
        "doc_id": "EX005_2",
        "text": "Informal online opinions often downplay hepatic side effects of statins.",
        "relevance": 1
      },
      {
        "doc_id": "EX005_3",
        "text": "Mild elevations in ALT and AST were occasionally reported in retrospective reviews.",
        "relevance": 2
      },
      {
        "doc_id": "EX005_4",
        "text": "Case studies report reversible transaminase increases in some users.",
        "relevance": 3
      },
      {
        "doc_id": "EX005_5",
        "text": "Several trials report liver enzyme elevation in up to 3% of patients.",
        "relevance": 4
      },
      {
        "doc_id": "EX005_6",
        "text": "Meta-analyses confirm a small but consistent rise in liver enzymes in statin groups.",
        "relevance": 4
      },
      {
        "doc_id": "EX005_7",
        "text": "Controlled RCTs show statistically significant liver enzyme increases in high-dose groups.",
        "relevance": 5
      }
    ]
  },
  {
    "query_id": "EX006_4445",
    "query_type": "explicit_NOT",
    "query_text": "Is lithium not associated with thyroid dysfunction?",
    "documents": [
      {
        "doc_id": "EX006_1",
        "text": "Several blog posts suggest lithium doesn’t affect the thyroid, especially in young patients.",
        "relevance": 1
      },
      {
        "doc_id": "EX006_2",
        "text": "Some online testimonials claim patients had no thyroid changes after lithium therapy.",
        "relevance": 1
      },
      {
        "doc_id": "EX006_3",
        "text": "A few observational studies noted minor changes in TSH without clinical symptoms.",
        "relevance": 2
      },
      {
        "doc_id": "EX006_4",
        "text": "Endocrine reviews mention subclinical hypothyroidism occurring in prolonged lithium use.",
        "relevance": 3
      },
      {
        "doc_id": "EX006_5",
        "text": "Thyroid monitoring is recommended in all lithium users due to known dysfunction risk.",
        "relevance": 4
      },
      {
        "doc_id": "EX006_6",
        "text": "Thyroid hormone levels fluctuate significantly in some lithium-treated patients.",
        "relevance": 4
      },
      {
        "doc_id": "EX006_7",
        "text": "Meta-analyses confirm lithium increases hypothyroidism incidence across demographics.",
        "relevance": 5
      }
    ]
  },
  {
    "query_id": "EX007_8054",
    "query_type": "explicit_NOT",
    "query_text": "Does finasteride not cause sexual dysfunction?",
    "documents": [
      {
        "doc_id": "EX007_1",
        "text": "There are claims on community forums that finasteride is entirely free of sexual side effects.",
        "relevance": 1
      },
      {
        "doc_id": "EX007_2",
        "text": "Patients often report no issues when taking finasteride for short durations.",
        "relevance": 1
      },
      {
        "doc_id": "EX007_3",
        "text": "A small study found that less than 5% of men reported mild sexual dysfunction symptoms.",
        "relevance": 2
      },
      {
        "doc_id": "EX007_4",
        "text": "Clinical research indicates a possible link between long-term use and reduced libido.",
        "relevance": 3
      },
      {
        "doc_id": "EX007_5",
        "text": "Larger trials showed erectile dysfunction as a reversible side effect in some men.",
        "relevance": 4
      },
      {
        "doc_id": "EX007_6",
        "text": "Finasteride’s labeling includes sexual side effects as reported in post-market surveillance.",
        "relevance": 4
      },
      {
        "doc_id": "EX007_7",
        "text": "RCTs confirm significantly increased sexual side effect reports among finasteride users.",
        "relevance": 5
      }
    ]
  },
  {
    "query_id": "EX008_6827",
    "query_type": "explicit_NOT",
    "query_text": "Is there no relationship between SSRIs and sleep disturbances?",
    "documents": [
      {
        "doc_id": "EX008_1",
        "text": "Several websites claim SSRIs don’t affect sleep quality at all.",
        "relevance": 1
      },
      {
        "doc_id": "EX008_2",
        "text": "User comments frequently note improved sleep while on antidepressants.",
        "relevance": 1
      },
      {
        "doc_id": "EX008_3",
        "text": "Some clinical notes mention early-stage insomnia during SSRI initiation.",
        "relevance": 2
      },
      {
        "doc_id": "EX008_4",
        "text": "Patients report disrupted REM cycles in early weeks of SSRI therapy.",
        "relevance": 3
      },
      {
        "doc_id": "EX008_5",
        "text": "Several studies suggest a dose-dependent impact on sleep continuity.",
        "relevance": 4
      },
      {
        "doc_id": "EX008_6",
        "text": "Meta-analyses show sleep architecture is altered with certain SSRIs.",
        "relevance": 4
      },
      {
        "doc_id": "EX008_7",
        "text": "RCTs confirm that SSRIs can cause clinically significant sleep disruptions in up to 20% of users.",
        "relevance": 5
      }
    ]
  },
  {
    "query_id": "EX009_6052",
    "query_type": "explicit_NOT",
    "query_text": "Do beta-blockers not induce fatigue in patients?",
    "documents": [
      {
        "doc_id": "EX009_1",
        "text": "Online posts often argue that beta-blockers don’t affect energy levels.",
        "relevance": 1
      },
      {
        "doc_id": "EX009_2",
        "text": "Informal discussions suggest fatigue is rare and unrelated to beta-blockers.",
        "relevance": 1
      },
      {
        "doc_id": "EX009_3",
        "text": "Some studies found fatigue in less than 10% of patients, with no functional impairment.",
        "relevance": 2
      },
      {
        "doc_id": "EX009_4",
        "text": "Patients using beta-blockers reported occasional tiredness, particularly in early weeks.",
        "relevance": 3
      },
      {
        "doc_id": "EX009_5",
        "text": "Larger trials observed a small but significant decline in exercise tolerance.",
        "relevance": 4
      },
      {
        "doc_id": "EX009_6",
        "text": "Meta-analyses confirm beta-blockers contribute to fatigue in a dose-dependent manner.",
        "relevance": 5
      },
      {
        "doc_id": "EX009_7",
        "text": "Controlled trials demonstrate beta-blockers are linked with increased daytime fatigue.",
        "relevance": 5
      }
    ]
  },
  {
    "query_id": "EX010_9108",
    "query_type": "explicit_NOT",
    "query_text": "Is there no evidence linking corticosteroids with mood changes?",
    "documents": [
      {
        "doc_id": "EX010_1",
        "text": "Popular health blogs often claim corticosteroids don’t affect mood at all.",
        "relevance": 1
      },
      {
        "doc_id": "EX010_2",
        "text": "Many online users deny experiencing any emotional changes from steroids.",
        "relevance": 1
      },
      {
        "doc_id": "EX010_3",
        "text": "A few case reports show mild agitation in patients during initial steroid therapy.",
        "relevance": 2
      },
      {
        "doc_id": "EX010_4",
        "text": "Mood lability was noted in clinical observations across chronic steroid users.",
        "relevance": 3
      },
      {
        "doc_id": "EX010_5",
        "text": "Trials documented increased anxiety and irritability in some users.",
        "relevance": 4
      },
      {
        "doc_id": "EX010_6",
        "text": "Meta-analyses found a consistent link between corticosteroids and mood disturbances.",
        "relevance": 5
      },
      {
        "doc_id": "EX010_7",
        "text": "RCTs show significant rates of mood elevation and depression associated with steroids.",
        "relevance": 5
      }
    ]
  }]