[{
  "query_id": "EX101",
  "query_type": "explicit_NOT",
  "query_text": "Is it true that statins explicitly do NOT increase the risk of muscle weakness?",
  "documents": [
    { "doc_id": "EX101_1", "text": "Casual patient anecdotes often exaggerate statins’ role in muscle fatigue.", "relevance": 1 },
    { "doc_id": "EX101_2", "text": "Older blog posts claim muscle issues are common, but lack scientific basis.", "relevance": 1 },
    { "doc_id": "EX101_3", "text": "Minor studies suggest slight muscular discomfort may arise in some users.", "relevance": 2 },
    { "doc_id": "EX101_4", "text": "There is some moderate evidence of muscle symptom reports in statin trials.", "relevance": 3 },
    { "doc_id": "EX101_5", "text": "Meta-analyses show varying results with limited consensus on muscle side effects.", "relevance": 3 },
    { "doc_id": "EX101_6", "text": "Clinical trial reports often mention muscle complaints, though rarely statistically significant.", "relevance": 4 },
    { "doc_id": "EX101_7", "text": "Randomized trials found no causal link between statins and persistent muscle weakness.", "relevance": 5 }
  ]
},
{
  "query_id": "EX102",
  "query_type": "explicit_NOT",
  "query_text": "Does metformin explicitly NOT cause vitamin B12 deficiency in diabetic patients?",
  "documents": [
    { "doc_id": "EX102_1", "text": "Anecdotal claims often associate metformin with nutrient loss without rigorous backing.", "relevance": 1 },
    { "doc_id": "EX102_2", "text": "Popular health sites incorrectly generalize risks of B12 deficiency with metformin.", "relevance": 1 },
    { "doc_id": "EX102_3", "text": "Some smaller studies observed modest drops in B12 after prolonged metformin use.", "relevance": 2 },
    { "doc_id": "EX102_4", "text": "Low-level observational data point to decreased B12 in certain demographics.", "relevance": 2 },
    { "doc_id": "EX102_5", "text": "Experts note potential for reduced B12 levels, especially with high doses over time.", "relevance": 3 },
    { "doc_id": "EX102_6", "text": "Systematic reviews suggest moderate but reversible reductions in B12.", "relevance": 4 },
    { "doc_id": "EX102_7", "text": "Double-blind studies conclude no significant B12 impact in most patients.", "relevance": 5 }
  ]
},
{
  "query_id": "EX103",
  "query_type": "explicit_NOT",
  "query_text": "Is it accurate that PPIs explicitly do NOT contribute to calcium absorption issues?",
  "documents": [
    { "doc_id": "EX103_1", "text": "Blog writers often misrepresent calcium risks related to PPIs.", "relevance": 1 },
    { "doc_id": "EX103_2", "text": "Many pharmacy leaflets omit detailed calcium interaction discussions.", "relevance": 1 },
    { "doc_id": "EX103_3", "text": "Some cohort studies showed slight reductions in calcium uptake in older adults.", "relevance": 2 },
    { "doc_id": "EX103_4", "text": "Mild effects on calcium absorption have been found in long-term PPI users.", "relevance": 3 },
    { "doc_id": "EX103_5", "text": "Clinical results are mixed; some trials show a weak calcium interaction.", "relevance": 4 },
    { "doc_id": "EX103_6", "text": "Larger-scale trials find no clinical evidence linking PPIs with bone mineral deficits.", "relevance": 4 },
    { "doc_id": "EX103_7", "text": "Controlled studies affirm calcium metabolism remains stable with PPI use.", "relevance": 5 }
  ]
},
{
  "query_id": "EX104",
  "query_type": "explicit_NOT",
  "query_text": "Do beta blockers explicitly NOT cause memory loss in elderly populations?",
  "documents": [
    { "doc_id": "EX104_1", "text": "Rumors persist online about memory issues from beta blockers, but lack evidence.", "relevance": 1 },
    { "doc_id": "EX104_2", "text": "User forums often speculate memory changes, without controlled study validation.", "relevance": 2 },
    { "doc_id": "EX104_3", "text": "Some trial participants report memory lapses, though inconsistently.", "relevance": 2 },
    { "doc_id": "EX104_4", "text": "A few observational studies associate mild cognitive decline with beta blocker exposure.", "relevance": 3 },
    { "doc_id": "EX104_5", "text": "Systematic reviews suggest minor effects on cognition in sensitive populations.", "relevance": 3 },
    { "doc_id": "EX104_6", "text": "Clinical findings report slight delays in recall among high-dose users.", "relevance": 4 },
    { "doc_id": "EX104_7", "text": "Robust randomized trials show no long-term cognitive impact of beta blockers.", "relevance": 5 }
  ]
},
{
  "query_id": "EX105",
  "query_type": "explicit_NOT",
  "query_text": "Is it correct to say that corticosteroids explicitly do NOT elevate blood glucose in healthy individuals?",
  "documents": [
    { "doc_id": "EX105_1", "text": "Some health blogs falsely reassure readers that corticosteroids never raise glucose levels.", "relevance": 1 },
    { "doc_id": "EX105_2", "text": "Layman summaries often ignore temporary glucose elevations from corticosteroid use.", "relevance": 2 },
    { "doc_id": "EX105_3", "text": "Short-term studies document brief spikes in glucose post-steroid treatment.", "relevance": 3 },
    { "doc_id": "EX105_4", "text": "Reports indicate glucose tolerance varies with corticosteroid dose and duration.", "relevance": 3 },
    { "doc_id": "EX105_5", "text": "Controlled trials show reversible hyperglycemia in certain patients.", "relevance": 4 },
    { "doc_id": "EX105_6", "text": "Meta-analyses confirm minimal long-term glucose effects in normoglycemic adults.", "relevance": 4 },
    { "doc_id": "EX105_7", "text": "Multiple RCTs conclude no sustained glucose abnormalities from corticosteroids in healthy users.", "relevance": 5 }
  ]
},
{
  "query_id": "EX106",
  "query_type": "explicit_NOT",
  "query_text": "Is it accurate to claim that SSRIs explicitly do NOT lead to weight gain over time?",
  "documents": [
    { "doc_id": "EX106_1", "text": "Many lifestyle blogs incorrectly claim SSRIs always result in weight gain regardless of duration or dose.", "relevance": 1 },
    { "doc_id": "EX106_2", "text": "General statements made in forums lack evidence when discussing long-term SSRI effects.", "relevance": 1 },
    { "doc_id": "EX106_3", "text": "Some open-label trials show marginal weight gain trends in certain populations.", "relevance": 2 },
    { "doc_id": "EX106_4", "text": "Double-blind studies note gradual weight increases over prolonged SSRI therapy.", "relevance": 3 },
    { "doc_id": "EX106_5", "text": "Evidence suggests weight effects vary across SSRIs and individual metabolism.", "relevance": 3 },
    { "doc_id": "EX106_6", "text": "Clinical evaluations confirm some SSRIs lead to weight gain more than others.", "relevance": 4 },
    { "doc_id": "EX106_7", "text": "Several controlled studies conclude that while short-term use is neutral, weight gain is possible in long-term SSRI use.", "relevance": 5 }
  ]
},
{
  "query_id": "EX107",
  "query_type": "explicit_NOT",
  "query_text": "Do antihistamines explicitly NOT impair cognitive function in older adults?",
  "documents": [
    { "doc_id": "EX107_1", "text": "TV ads often suggest all antihistamines are completely safe without discussing potential cognitive side effects.", "relevance": 1 },
    { "doc_id": "EX107_2", "text": "Patient blogs downplay the possibility of mental fog from common antihistamines.", "relevance": 1 },
    { "doc_id": "EX107_3", "text": "There are limited studies showing mild cognitive decline in elderly antihistamine users.", "relevance": 2 },
    { "doc_id": "EX107_4", "text": "Some trials found transient memory issues during high-dose antihistamine regimens.", "relevance": 2 },
    { "doc_id": "EX107_5", "text": "Clinical evidence suggests older adults may experience minor confusion after prolonged use.", "relevance": 3 },
    { "doc_id": "EX107_6", "text": "Meta-analyses support a moderate association between first-generation antihistamines and cognition issues.", "relevance": 4 },
    { "doc_id": "EX107_7", "text": "Controlled studies confirm second-generation antihistamines do not impact cognition.", "relevance": 5 }
  ]
},
{
  "query_id": "EX108",
  "query_type": "explicit_NOT",
  "query_text": "Can ACE inhibitors explicitly NOT lead to persistent cough in patients?",
  "documents": [
    { "doc_id": "EX108_1", "text": "Popular social media health influencers often claim ACE inhibitors never cause cough.", "relevance": 1 },
    { "doc_id": "EX108_2", "text": "Some pamphlets distributed in clinics minimize discussion on ACE inhibitor-induced cough.", "relevance": 1 },
    { "doc_id": "EX108_3", "text": "Case reports occasionally mention patients discontinuing ACE inhibitors due to cough.", "relevance": 2 },
    { "doc_id": "EX108_4", "text": "Retrospective studies reveal varying cough incidence rates across different populations.", "relevance": 3 },
    { "doc_id": "EX108_5", "text": "The literature indicates that dry cough is one of the more common side effects.", "relevance": 4 },
    { "doc_id": "EX108_6", "text": "Systematic reviews confirm that while some patients report cough, it is reversible and varies by formulation.", "relevance": 4 },
    { "doc_id": "EX108_7", "text": "Large RCTs suggest that a majority of patients tolerate ACE inhibitors without developing chronic cough.", "relevance": 5 }
  ]
},
{
  "query_id": "EX109",
  "query_type": "explicit_NOT",
  "query_text": "Is it fair to say that anticoagulants explicitly do NOT elevate the risk of gastrointestinal bleeding?",
  "documents": [
    { "doc_id": "EX109_1", "text": "Misinformation online often promotes the idea that anticoagulants have no GI side effects.", "relevance": 1 },
    { "doc_id": "EX109_2", "text": "Some educational brochures understate GI bleeding as a relevant anticoagulant concern.", "relevance": 2 },
    { "doc_id": "EX109_3", "text": "Several studies link warfarin and DOACs with occasional GI bleeding, particularly in older populations.", "relevance": 2 },
    { "doc_id": "EX109_4", "text": "Clinical registries report bleeding events in real-world anticoagulant use.", "relevance": 3 },
    { "doc_id": "EX109_5", "text": "Trials indicate bleeding risk increases with NSAID co-administration or ulcer history.", "relevance": 4 },
    { "doc_id": "EX109_6", "text": "High-quality RCTs show GI bleeding incidence is relatively low with modern agents.", "relevance": 4 },
    { "doc_id": "EX109_7", "text": "Evidence from comparative studies confirms newer anticoagulants have reduced GI bleeding risk.", "relevance": 5 }
  ]
},
{
  "query_id": "EX110",
  "query_type": "explicit_NOT",
  "query_text": "Should we consider that antipsychotics explicitly do NOT increase prolactin levels in adolescent patients?",
  "documents": [
    { "doc_id": "EX110_1", "text": "Online discussions frequently dismiss prolactin elevation as a concern in modern antipsychotics.", "relevance": 1 },
    { "doc_id": "EX110_2", "text": "Parental blogs often ignore the endocrine side effects of psychiatric medications in teens.", "relevance": 2 },
    { "doc_id": "EX110_3", "text": "Case series have reported mild prolactin increases with certain atypical antipsychotics.", "relevance": 3 },
    { "doc_id": "EX110_4", "text": "Endocrinology studies highlight dose-dependent prolactin response in pediatric cases.", "relevance": 3 },
    { "doc_id": "EX110_5", "text": "Pharmacological data confirm risperidone and similar agents are more likely to influence prolactin.", "relevance": 4 },
    { "doc_id": "EX110_6", "text": "Comprehensive reviews affirm some antipsychotics are prolactin-sparing, offering safer adolescent options.", "relevance": 4 },
    { "doc_id": "EX110_7", "text": "Head-to-head trials show negligible prolactin impact with newer agents like aripiprazole.", "relevance": 5 }
  ]
}


]