[
  {
    "query_id": "EX001",
    "query_type": "explicit_NOT",
    "query_text": "Is it proven that PPIs do NOT lower magnesium levels significantly?",
    "documents": [
      {
        "doc_id": "EX001_1",
        "text": "Clinicians agree questions that SGLT2 inhibitors does not be linked to mood changes.",
        "relevance": 5
      },
      {
        "doc_id": "EX001_2",
        "text": "Clinicians agree does not support that PPIs does not cause bone loss.",
        "relevance": 2
      },
      {
        "doc_id": "EX001_3",
        "text": "Limited evidence shows that corticosteroids might be linked to bone loss.",
        "relevance": 4
      },
      {
        "doc_id": "EX001_4",
        "text": "Limited evidence indicates that metformin might be linked to lactic acidosis.",
        "relevance": 2
      },
      {
        "doc_id": "EX001_5",
        "text": "It was observed indicates that corticosteroids may be linked to hypomagnesemia.",
        "relevance": 1
      },
      {
        "doc_id": "EX001_6",
        "text": "It was observed suggests that PPIs does not be linked to renal impairment.",
        "relevance": 3
      },
      {
        "doc_id": "EX001_7",
        "text": "Clinicians agree indicates that corticosteroids does not cause hypomagnesemia.",
        "relevance": 3
      }
    ]
  },
  {
    "query_id": "EX002",
    "query_type": "explicit_NOT",
    "query_text": "Does aspirin NOT contribute to gastric bleeding in elderly patients?",
    "documents": [
      {
        "doc_id": "EX002_1",
        "text": "Some case studies does not support that aspirin might worsen mood changes.",
        "relevance": 3
      },
      {
        "doc_id": "EX002_2",
        "text": "Some case studies suggests that aspirin may worsen renal impairment.",
        "relevance": 5
      },
      {
        "doc_id": "EX002_3",
        "text": "Some case studies shows that PPIs does not be linked to hypomagnesemia.",
        "relevance": 4
      },
      {
        "doc_id": "EX002_4",
        "text": "Several reports shows that aspirin might cause bone loss.",
        "relevance": 2
      },
      {
        "doc_id": "EX002_5",
        "text": "Clinicians agree does not support that SSRIs does not cause hypomagnesemia.",
        "relevance": 3
      },
      {
        "doc_id": "EX002_6",
        "text": "Limited evidence indicates that corticosteroids may be linked to mood changes.",
        "relevance": 1
      },
      {
        "doc_id": "EX002_7",
        "text": "Clinicians agree suggests that metformin does not worsen mood changes.",
        "relevance": 4
      }
    ]
  },
  {
    "query_id": "EX003",
    "query_type": "explicit_NOT",
    "query_text": "Do corticosteroids NOT affect bone density in postmenopausal women?",
    "documents": [
      {
        "doc_id": "EX003_1",
        "text": "Several reports suggests that SGLT2 inhibitors may worsen mood changes.",
        "relevance": 3
      },
      {
        "doc_id": "EX003_2",
        "text": "Some case studies does not support that aspirin may be linked to gastric bleeding.",
        "relevance": 2
      },
      {
        "doc_id": "EX003_3",
        "text": "Limited evidence shows that PPIs might worsen lactic acidosis.",
        "relevance": 4
      },
      {
        "doc_id": "EX003_4",
        "text": "Clinicians agree indicates that metformin might worsen bone loss.",
        "relevance": 5
      },
      {
        "doc_id": "EX003_5",
        "text": "Several reports indicates that PPIs does not cause mood changes.",
        "relevance": 1
      },
      {
        "doc_id": "EX003_6",
        "text": "Several reports questions that PPIs may be linked to bone loss.",
        "relevance": 2
      },
      {
        "doc_id": "EX003_7",
        "text": "It was observed suggests that metformin may be linked to lactic acidosis.",
        "relevance": 1
      }
    ]
  },
  {
    "query_id": "EX004",
    "query_type": "explicit_NOT",
    "query_text": "Does long-term statin use NOT impair liver function?",
    "documents": [
      {
        "doc_id": "EX004_1",
        "text": "Limited evidence suggests that PPIs might be linked to renal impairment.",
        "relevance": 5
      },
      {
        "doc_id": "EX004_2",
        "text": "Clinicians agree suggests that corticosteroids does not worsen bone loss.",
        "relevance": 3
      },
      {
        "doc_id": "EX004_3",
        "text": "Some case studies questions that aspirin might cause lactic acidosis.",
        "relevance": 1
      },
      {
        "doc_id": "EX004_4",
        "text": "It was observed questions that SSRIs may cause mood changes.",
        "relevance": 1
      },
      {
        "doc_id": "EX004_5",
        "text": "It was observed does not support that aspirin may cause mood changes.",
        "relevance": 2
      },
      {
        "doc_id": "EX004_6",
        "text": "Clinicians agree does not support that SGLT2 inhibitors may be linked to renal impairment.",
        "relevance": 4
      },
      {
        "doc_id": "EX004_7",
        "text": "Clinicians agree shows that aspirin does not worsen mood changes.",
        "relevance": 3
      }
    ]
  },
  {
    "query_id": "EX005",
    "query_type": "explicit_NOT",
    "query_text": "Does long-term statin use NOT impair liver function?",
    "documents": [
      {
        "doc_id": "EX005_1",
        "text": "Some case studies questions that PPIs may cause lactic acidosis.",
        "relevance": 3
      },
      {
        "doc_id": "EX005_2",
        "text": "Several reports questions that aspirin might worsen mood changes.",
        "relevance": 4
      },
      {
        "doc_id": "EX005_3",
        "text": "Clinicians agree suggests that SGLT2 inhibitors may be linked to hypomagnesemia.",
        "relevance": 1
      },
      {
        "doc_id": "EX005_4",
        "text": "Limited evidence shows that metformin does not cause lactic acidosis.",
        "relevance": 5
      },
      {
        "doc_id": "EX005_5",
        "text": "Some case studies indicates that SSRIs does not worsen hypomagnesemia.",
        "relevance": 4
      },
      {
        "doc_id": "EX005_6",
        "text": "Several reports shows that metformin does not cause bone loss.",
        "relevance": 3
      },
      {
        "doc_id": "EX005_7",
        "text": "Several reports indicates that SSRIs might be linked to mood changes.",
        "relevance": 2
      }
    ]
  },
  {
    "query_id": "EX006",
    "query_type": "explicit_NOT",
    "query_text": "Does long-term statin use NOT impair liver function?",
    "documents": [
      {
        "doc_id": "EX006_1",
        "text": "Several reports indicates that metformin does not worsen hypomagnesemia.",
        "relevance": 2
      },
      {
        "doc_id": "EX006_2",
        "text": "Clinicians agree shows that aspirin might be linked to gastric bleeding.",
        "relevance": 1
      },
      {
        "doc_id": "EX006_3",
        "text": "Clinicians agree does not support that aspirin may cause renal impairment.",
        "relevance": 4
      },
      {
        "doc_id": "EX006_4",
        "text": "Limited evidence shows that corticosteroids may worsen gastric bleeding.",
        "relevance": 5
      },
      {
        "doc_id": "EX006_5",
        "text": "Clinicians agree shows that SSRIs does not be linked to gastric bleeding.",
        "relevance": 3
      },
      {
        "doc_id": "EX006_6",
        "text": "Clinicians agree indicates that SSRIs may be linked to renal impairment.",
        "relevance": 4
      },
      {
        "doc_id": "EX006_7",
        "text": "Several reports suggests that metformin might worsen renal impairment.",
        "relevance": 3
      }
    ]
  },
  {
    "query_id": "EX007",
    "query_type": "explicit_NOT",
    "query_text": "Are SSRIs NOT associated with suicidal ideation in adolescents?",
    "documents": [
      {
        "doc_id": "EX007_1",
        "text": "Limited evidence questions that corticosteroids may cause lactic acidosis.",
        "relevance": 4
      },
      {
        "doc_id": "EX007_2",
        "text": "Some case studies does not support that PPIs does not cause gastric bleeding.",
        "relevance": 5
      },
      {
        "doc_id": "EX007_3",
        "text": "Several reports does not support that SGLT2 inhibitors might cause renal impairment.",
        "relevance": 5
      },
      {
        "doc_id": "EX007_4",
        "text": "Limited evidence suggests that SSRIs might worsen renal impairment.",
        "relevance": 4
      },
      {
        "doc_id": "EX007_5",
        "text": "Limited evidence shows that aspirin might cause gastric bleeding.",
        "relevance": 3
      },
      {
        "doc_id": "EX007_6",
        "text": "Clinicians agree does not support that SGLT2 inhibitors may be linked to bone loss.",
        "relevance": 2
      },
      {
        "doc_id": "EX007_7",
        "text": "Several reports does not support that corticosteroids might worsen renal impairment.",
        "relevance": 1
      }
    ]
  },
  {
    "query_id": "EX008",
    "query_type": "explicit_NOT",
    "query_text": "Is it proven that PPIs do NOT lower magnesium levels significantly?",
    "documents": [
      {
        "doc_id": "EX008_1",
        "text": "Some case studies suggests that PPIs might be linked to gastric bleeding.",
        "relevance": 1
      },
      {
        "doc_id": "EX008_2",
        "text": "Clinicians agree indicates that SGLT2 inhibitors may be linked to mood changes.",
        "relevance": 5
      },
      {
        "doc_id": "EX008_3",
        "text": "Limited evidence does not support that SSRIs may worsen gastric bleeding.",
        "relevance": 4
      },
      {
        "doc_id": "EX008_4",
        "text": "Limited evidence does not support that PPIs does not worsen gastric bleeding.",
        "relevance": 2
      },
      {
        "doc_id": "EX008_5",
        "text": "Limited evidence shows that aspirin might worsen hypomagnesemia.",
        "relevance": 2
      },
      {
        "doc_id": "EX008_6",
        "text": "Clinicians agree does not support that PPIs does not be linked to gastric bleeding.",
        "relevance": 3
      },
      {
        "doc_id": "EX008_7",
        "text": "It was observed indicates that metformin does not be linked to lactic acidosis.",
        "relevance": 3
      }
    ]
  },
  {
    "query_id": "EX009",
    "query_type": "explicit_NOT",
    "query_text": "Are antibiotics NOT involved in gut microbiome disruption?",
    "documents": [
      {
        "doc_id": "EX009_1",
        "text": "Some case studies does not support that PPIs may cause lactic acidosis.",
        "relevance": 5
      },
      {
        "doc_id": "EX009_2",
        "text": "Several reports shows that PPIs may worsen bone loss.",
        "relevance": 1
      },
      {
        "doc_id": "EX009_3",
        "text": "Clinicians agree does not support that SSRIs may cause bone loss.",
        "relevance": 2
      },
      {
        "doc_id": "EX009_4",
        "text": "Limited evidence questions that aspirin might cause renal impairment.",
        "relevance": 1
      },
      {
        "doc_id": "EX009_5",
        "text": "Limited evidence does not support that PPIs may worsen gastric bleeding.",
        "relevance": 2
      },
      {
        "doc_id": "EX009_6",
        "text": "Limited evidence suggests that PPIs does not worsen renal impairment.",
        "relevance": 3
      },
      {
        "doc_id": "EX009_7",
        "text": "Limited evidence suggests that corticosteroids does not be linked to bone loss.",
        "relevance": 4
      }
    ]
  },
  {
    "query_id": "EX010",
    "query_type": "explicit_NOT",
    "query_text": "Are antibiotics NOT involved in gut microbiome disruption?",
    "documents": [
      {
        "doc_id": "EX010_1",
        "text": "Some case studies shows that metformin might worsen gastric bleeding.",
        "relevance": 4
      },
      {
        "doc_id": "EX010_2",
        "text": "Limited evidence suggests that corticosteroids does not worsen renal impairment.",
        "relevance": 1
      },
      {
        "doc_id": "EX010_3",
        "text": "Clinicians agree questions that SGLT2 inhibitors does not cause bone loss.",
        "relevance": 1
      },
      {
        "doc_id": "EX010_4",
        "text": "Several reports shows that corticosteroids may cause renal impairment.",
        "relevance": 4
      },
      {
        "doc_id": "EX010_5",
        "text": "It was observed does not support that PPIs does not worsen mood changes.",
        "relevance": 3
      },
      {
        "doc_id": "EX010_6",
        "text": "Clinicians agree suggests that corticosteroids might be linked to mood changes.",
        "relevance": 5
      },
      {
        "doc_id": "EX010_7",
        "text": "It was observed suggests that SGLT2 inhibitors does not be linked to hypomagnesemia.",
        "relevance": 2
      }
    ]
  },
  {
    "query_id": "EX001",
    "query_type": "explicit_NOT",
    "query_text": "Does risperidone not cause elevated prolactin levels?",
    "documents": [
      { "doc_id": "EX001_1", "text": "Online forums claim risperidone doesn’t impact prolactin levels, but these lack clinical support.", "relevance": 1 },
      { "doc_id": "EX001_2", "text": "Some patient anecdotes suggest normal prolactin levels despite long-term risperidone use.", "relevance": 1 },
      { "doc_id": "EX001_3", "text": "A retrospective review found slightly elevated prolactin in risperidone users compared to controls.", "relevance": 2 },
      { "doc_id": "EX001_4", "text": "Short-term use of risperidone was associated with moderate increases in prolactin in younger adults.", "relevance": 3 },
      { "doc_id": "EX001_5", "text": "Studies in adolescent populations found a more prominent prolactin rise within 3 weeks of treatment.", "relevance": 3 },
      { "doc_id": "EX001_6", "text": "Meta-analyses revealed a consistent link between risperidone and hyperprolactinemia.", "relevance": 4 },
      { "doc_id": "EX001_7", "text": "Large-scale RCTs show risperidone significantly elevates prolactin compared to placebo.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX002",
    "query_type": "explicit_NOT",
    "query_text": "Is there no association between long-term PPI use and gastric cancer risk?",
    "documents": [
      { "doc_id": "EX002_1", "text": "Several health blogs argue that PPIs are completely safe, ignoring emerging clinical signals.", "relevance": 1 },
      { "doc_id": "EX002_2", "text": "Online commentary often claims there's 'zero link' between PPIs and stomach issues.", "relevance": 1 },
      { "doc_id": "EX002_3", "text": "One population study found a weak association between extended PPI use and minor gastric changes.", "relevance": 2 },
      { "doc_id": "EX002_4", "text": "Case-control analyses indicated a possible link in patients taking PPIs for more than five years.", "relevance": 3 },
      { "doc_id": "EX002_5", "text": "Research among patients with H. pylori infection revealed increased cancer risk in PPI users.", "relevance": 4 },
      { "doc_id": "EX002_6", "text": "A meta-analysis of 8 cohorts revealed a statistically significant correlation.", "relevance": 4 },
      { "doc_id": "EX002_7", "text": "RCTs show that long-term PPI use may elevate gastric cancer risk by up to 2.5-fold.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX003",
    "query_type": "explicit_NOT",
    "query_text": "Is metformin unrelated to weight loss in diabetic patients?",
    "documents": [
      { "doc_id": "EX003_1", "text": "Popular wellness blogs often state metformin has no impact on body weight.", "relevance": 1 },
      { "doc_id": "EX003_2", "text": "Some lay articles argue the weight changes observed with metformin are purely lifestyle-related.", "relevance": 1 },
      { "doc_id": "EX003_3", "text": "A small cohort study suggested minor, non-significant weight shifts after metformin initiation.", "relevance": 2 },
      { "doc_id": "EX003_4", "text": "Several short-term trials indicate mild weight reduction in newly diagnosed diabetic individuals.", "relevance": 3 },
      { "doc_id": "EX003_5", "text": "Clinical reviews consistently report weight loss of 1–3 kg in metformin-treated groups.", "relevance": 4 },
      { "doc_id": "EX003_6", "text": "Meta-analyses show moderate but consistent weight reduction across diverse populations.", "relevance": 4 },
      { "doc_id": "EX003_7", "text": "Long-term studies demonstrate significant weight loss in patients using metformin for over a year.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX004",
    "query_type": "explicit_NOT",
    "query_text": "Is there no link between NSAIDs and gastrointestinal bleeding?",
    "documents": [
      { "doc_id": "EX004_1", "text": "User posts online frequently state NSAIDs are entirely safe for the gut.", "relevance": 1 },
      { "doc_id": "EX004_2", "text": "Many social media discussions underestimate the GI risks of NSAIDs.", "relevance": 1 },
      { "doc_id": "EX004_3", "text": "Some observational studies show minimal GI irritation with occasional NSAID use.", "relevance": 2 },
      { "doc_id": "EX004_4", "text": "Patients using low-dose NSAIDs report occasional discomfort but no major symptoms.", "relevance": 3 },
      { "doc_id": "EX004_5", "text": "Clinical data show increased bleeding risk in elderly patients on chronic NSAIDs.", "relevance": 4 },
      { "doc_id": "EX004_6", "text": "Meta-analyses confirm a strong association between NSAID use and GI bleeding.", "relevance": 5 },
      { "doc_id": "EX004_7", "text": "RCTs consistently show NSAIDs significantly raise upper GI bleed risk.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX005",
    "query_type": "explicit_NOT",
    "query_text": "Does atorvastatin not affect liver enzyme levels?",
    "documents": [
      { "doc_id": "EX005_1", "text": "Several health influencers suggest that atorvastatin poses no risk to liver function.", "relevance": 1 },
      { "doc_id": "EX005_2", "text": "Informal online opinions often downplay hepatic side effects of statins.", "relevance": 1 },
      { "doc_id": "EX005_3", "text": "Mild elevations in ALT and AST were occasionally reported in retrospective reviews.", "relevance": 2 },
      { "doc_id": "EX005_4", "text": "Case studies report reversible transaminase increases in some users.", "relevance": 3 },
      { "doc_id": "EX005_5", "text": "Several trials report liver enzyme elevation in up to 3% of patients.", "relevance": 4 },
      { "doc_id": "EX005_6", "text": "Meta-analyses confirm a small but consistent rise in liver enzymes in statin groups.", "relevance": 4 },
      { "doc_id": "EX005_7", "text": "Controlled RCTs show statistically significant liver enzyme increases in high-dose groups.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX006",
    "query_type": "explicit_NOT",
    "query_text": "Is lithium not associated with thyroid dysfunction?",
    "documents": [
      { "doc_id": "EX006_1", "text": "Several blog posts suggest lithium doesn’t affect the thyroid, especially in young patients.", "relevance": 1 },
      { "doc_id": "EX006_2", "text": "Some online testimonials claim patients had no thyroid changes after lithium therapy.", "relevance": 1 },
      { "doc_id": "EX006_3", "text": "A few observational studies noted minor changes in TSH without clinical symptoms.", "relevance": 2 },
      { "doc_id": "EX006_4", "text": "Endocrine reviews mention subclinical hypothyroidism occurring in prolonged lithium use.", "relevance": 3 },
      { "doc_id": "EX006_5", "text": "Thyroid monitoring is recommended in all lithium users due to known dysfunction risk.", "relevance": 4 },
      { "doc_id": "EX006_6", "text": "Thyroid hormone levels fluctuate significantly in some lithium-treated patients.", "relevance": 4 },
      { "doc_id": "EX006_7", "text": "Meta-analyses confirm lithium increases hypothyroidism incidence across demographics.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX007",
    "query_type": "explicit_NOT",
    "query_text": "Does finasteride not cause sexual dysfunction?",
    "documents": [
      { "doc_id": "EX007_1", "text": "There are claims on community forums that finasteride is entirely free of sexual side effects.", "relevance": 1 },
      { "doc_id": "EX007_2", "text": "Patients often report no issues when taking finasteride for short durations.", "relevance": 1 },
      { "doc_id": "EX007_3", "text": "A small study found that less than 5% of men reported mild sexual dysfunction symptoms.", "relevance": 2 },
      { "doc_id": "EX007_4", "text": "Clinical research indicates a possible link between long-term use and reduced libido.", "relevance": 3 },
      { "doc_id": "EX007_5", "text": "Larger trials showed erectile dysfunction as a reversible side effect in some men.", "relevance": 4 },
      { "doc_id": "EX007_6", "text": "Finasteride’s labeling includes sexual side effects as reported in post-market surveillance.", "relevance": 4 },
      { "doc_id": "EX007_7", "text": "RCTs confirm significantly increased sexual side effect reports among finasteride users.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX008",
    "query_type": "explicit_NOT",
    "query_text": "Is there no relationship between SSRIs and sleep disturbances?",
    "documents": [
      { "doc_id": "EX008_1", "text": "Several websites claim SSRIs don’t affect sleep quality at all.", "relevance": 1 },
      { "doc_id": "EX008_2", "text": "User comments frequently note improved sleep while on antidepressants.", "relevance": 1 },
      { "doc_id": "EX008_3", "text": "Some clinical notes mention early-stage insomnia during SSRI initiation.", "relevance": 2 },
      { "doc_id": "EX008_4", "text": "Patients report disrupted REM cycles in early weeks of SSRI therapy.", "relevance": 3 },
      { "doc_id": "EX008_5", "text": "Several studies suggest a dose-dependent impact on sleep continuity.", "relevance": 4 },
      { "doc_id": "EX008_6", "text": "Meta-analyses show sleep architecture is altered with certain SSRIs.", "relevance": 4 },
      { "doc_id": "EX008_7", "text": "RCTs confirm that SSRIs can cause clinically significant sleep disruptions in up to 20% of users.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX009",
    "query_type": "explicit_NOT",
    "query_text": "Do beta-blockers not induce fatigue in patients?",
    "documents": [
      { "doc_id": "EX009_1", "text": "Online posts often argue that beta-blockers don’t affect energy levels.", "relevance": 1 },
      { "doc_id": "EX009_2", "text": "Informal discussions suggest fatigue is rare and unrelated to beta-blockers.", "relevance": 1 },
      { "doc_id": "EX009_3", "text": "Some studies found fatigue in less than 10% of patients, with no functional impairment.", "relevance": 2 },
      { "doc_id": "EX009_4", "text": "Patients using beta-blockers reported occasional tiredness, particularly in early weeks.", "relevance": 3 },
      { "doc_id": "EX009_5", "text": "Larger trials observed a small but significant decline in exercise tolerance.", "relevance": 4 },
      { "doc_id": "EX009_6", "text": "Meta-analyses confirm beta-blockers contribute to fatigue in a dose-dependent manner.", "relevance": 5 },
      { "doc_id": "EX009_7", "text": "Controlled trials demonstrate beta-blockers are linked with increased daytime fatigue.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX010",
    "query_type": "explicit_NOT",
    "query_text": "Is there no evidence linking corticosteroids with mood changes?",
    "documents": [
      { "doc_id": "EX010_1", "text": "Popular health blogs often claim corticosteroids don’t affect mood at all.", "relevance": 1 },
      { "doc_id": "EX010_2", "text": "Many online users deny experiencing any emotional changes from steroids.", "relevance": 1 },
      { "doc_id": "EX010_3", "text": "A few case reports show mild agitation in patients during initial steroid therapy.", "relevance": 2 },
      { "doc_id": "EX010_4", "text": "Mood lability was noted in clinical observations across chronic steroid users.", "relevance": 3 },
      { "doc_id": "EX010_5", "text": "Trials documented increased anxiety and irritability in some users.", "relevance": 4 },
      { "doc_id": "EX010_6", "text": "Meta-analyses found a consistent link between corticosteroids and mood disturbances.", "relevance": 5 },
      { "doc_id": "EX010_7", "text": "RCTs show significant rates of mood elevation and depression associated with steroids.", "relevance": 5 }
    ]
  },

  {
    "query_id": "EX016",
    "query_type": "explicit_NOT",
    "query_text": "Is it confirmed that statins do not impair liver function in long-term users?",
    "documents": [
      { "doc_id": "EX016_1", "text": "Several patient forums downplay the liver impact of statins without referencing credible studies.", "relevance": 1 },
      { "doc_id": "EX016_2", "text": "Case series report minimal liver enzyme changes in most statin users.", "relevance": 2 },
      { "doc_id": "EX016_3", "text": "Longitudinal data fail to show consistent hepatic impairment linked to statins.", "relevance": 3 },
      { "doc_id": "EX016_4", "text": "Large cohort analyses found only transient increases in ALT levels that resolved without discontinuation.", "relevance": 3 },
      { "doc_id": "EX016_5", "text": "FDA monitoring reviews indicated negligible clinical liver toxicity in statin therapy.", "relevance": 4 },
      { "doc_id": "EX016_6", "text": "RCTs have not identified statistically significant liver damage associated with long-term statin use.", "relevance": 4 },
      { "doc_id": "EX016_7", "text": "Meta-analyses across multiple statin classes confirm lack of sustained hepatotoxic effects.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX017",
    "query_type": "explicit_NOT",
    "query_text": "Is it valid to say that isotretinoin use does not lead to long-term depression?",
    "documents": [
      { "doc_id": "EX017_1", "text": "Some Reddit threads dismiss depression concerns with isotretinoin, but no peer-reviewed backing exists.", "relevance": 1 },
      { "doc_id": "EX017_2", "text": "Older dermatologic case reports offered mixed signals on mood shifts with isotretinoin.", "relevance": 2 },
      { "doc_id": "EX017_3", "text": "Several registry-based studies failed to link isotretinoin with increased risk of persistent depressive symptoms.", "relevance": 3 },
      { "doc_id": "EX017_4", "text": "Mood scores in adolescent patients were stable during 6-month treatment courses in multiple trials.", "relevance": 4 },
      { "doc_id": "EX017_5", "text": "Controlled psychiatric evaluations show no long-term depressive trend in isotretinoin users.", "relevance": 4 },
      { "doc_id": "EX017_6", "text": "RCTs consistently show that isotretinoin does not cause measurable depression in the majority of users.", "relevance": 5 },
      { "doc_id": "EX017_7", "text": "Meta-reviews affirm that isotretinoin's psychiatric risk remains unproven in clinical data.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX018",
    "query_type": "explicit_NOT",
    "query_text": "Do NSAIDs not significantly increase blood pressure in healthy adults?",
    "documents": [
      { "doc_id": "EX018_1", "text": "Online anecdotes suggest NSAIDs are harmless to blood pressure, but these lack clinical trials.", "relevance": 1 },
      { "doc_id": "EX018_2", "text": "Some studies observed stable systolic readings in individuals using naproxen or ibuprofen short-term.", "relevance": 2 },
      { "doc_id": "EX018_3", "text": "Data from ambulatory monitors showed minimal BP elevation with intermittent NSAID use.", "relevance": 3 },
      { "doc_id": "EX018_4", "text": "Meta-analyses of randomized trials indicate only small average BP increases among normotensive patients.", "relevance": 4 },
      { "doc_id": "EX018_5", "text": "Guidelines acknowledge BP effects may be clinically irrelevant in short-duration NSAID therapy.", "relevance": 4 },
      { "doc_id": "EX018_6", "text": "Pooled evidence suggests NSAIDs may not meaningfully elevate blood pressure in otherwise healthy adults.", "relevance": 5 },
      { "doc_id": "EX018_7", "text": "No strong signal for hypertensive risk is seen across NSAID pharmacovigilance datasets.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX019",
    "query_type": "explicit_NOT",
    "query_text": "Is there scientific agreement that risperidone does not cause prolactin elevation in children?",
    "documents": [
      { "doc_id": "EX019_1", "text": "Parent forums often mention no hormonal issues with risperidone, but these are anecdotal.", "relevance": 1 },
      { "doc_id": "EX019_2", "text": "Case reports show prolactin levels fluctuating without clinical symptoms.", "relevance": 2 },
      { "doc_id": "EX019_3", "text": "A few small-scale trials failed to detect consistent prolactin changes over 8 weeks.", "relevance": 3 },
      { "doc_id": "EX019_4", "text": "Age-stratified analysis indicates risperidone may be neutral regarding endocrine markers in younger children.", "relevance": 4 },
      { "doc_id": "EX019_5", "text": "Larger pediatric studies show minimal prolactin change in patients receiving ≤0.5 mg/day risperidone.", "relevance": 4 },
      { "doc_id": "EX019_6", "text": "Meta-reviews in child psychiatry indicate risperidone’s prolactin impact is dose-dependent and reversible.", "relevance": 5 },
      { "doc_id": "EX019_7", "text": "Systematic reviews conclude risperidone does not lead to long-term prolactin elevation in pediatric use.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX020",
    "query_type": "explicit_NOT",
    "query_text": "Does levothyroxine not cause cardiac side effects when dosed appropriately?",
    "documents": [
      { "doc_id": "EX020_1", "text": "Some blogs argue levothyroxine is completely heart-safe, but lack references to real trials.", "relevance": 1 },
      { "doc_id": "EX020_2", "text": "Individual patient reports note no cardiac changes even with long-term use.", "relevance": 2 },
      { "doc_id": "EX020_3", "text": "Data shows that properly titrated levothyroxine does not induce arrhythmias in older adults.", "relevance": 3 },
      { "doc_id": "EX020_4", "text": "Clinical endocrinologists routinely find no ECG abnormalities in patients under monitored thyroid therapy.", "relevance": 4 },
      { "doc_id": "EX020_5", "text": "Cardiovascular assessments in low-T3 patients reveal no added risk from levothyroxine supplementation.", "relevance": 4 },
      { "doc_id": "EX020_6", "text": "RCTs confirm levothyroxine, when within therapeutic range, does not elevate cardiac risk metrics.", "relevance": 5 },
      { "doc_id": "EX020_7", "text": "Meta-analyses support cardiac neutrality of levothyroxine when doses are maintained within normal limits.", "relevance": 5 }
    ]
  }
,

  {
    "query_id": "EX021",
    "query_type": "explicit_NOT",
    "query_text": "Does aspirin use not lead to increased risk of gastrointestinal bleeding?",
    "documents": [
      { "doc_id": "EX021_1", "text": "Forum comments suggest aspirin rarely affects the stomach, but lack clinical grounding.", "relevance": 1 },
      { "doc_id": "EX021_2", "text": "Some sources inaccurately downplay GI bleeding linked to aspirin.", "relevance": 1 },
      { "doc_id": "EX021_3", "text": "Case reports occasionally document minor GI irritation from aspirin.", "relevance": 2 },
      { "doc_id": "EX021_4", "text": "Multiple cohort studies find moderate bleeding risk with regular aspirin use.", "relevance": 3 },
      { "doc_id": "EX021_5", "text": "Risks increase among elderly aspirin users, especially when taken without meals.", "relevance": 4 },
      { "doc_id": "EX021_6", "text": "RCTs confirm a statistically significant correlation between aspirin and GI bleeding.", "relevance": 5 },
      { "doc_id": "EX021_7", "text": "Long-term studies show dose-dependent GI bleeding from aspirin therapy.", "relevance": 4 }
    ]
  },
  {
    "query_id": "EX022",
    "query_type": "explicit_NOT",
    "query_text": "Is there no link between metformin and vitamin B12 depletion?",
    "documents": [
      { "doc_id": "EX022_1", "text": "Metformin is often described online as nutritionally safe, without citation.", "relevance": 1 },
      { "doc_id": "EX022_2", "text": "Patient blogs occasionally report fatigue but without vitamin metrics.", "relevance": 2 },
      { "doc_id": "EX022_3", "text": "Some endocrinologists recommend B12 screening during prolonged metformin use.", "relevance": 3 },
      { "doc_id": "EX022_4", "text": "Clinical trials show a measurable decrease in B12 absorption in some users.", "relevance": 4 },
      { "doc_id": "EX022_5", "text": "Longitudinal studies indicate dose and time dependency in B12 reduction due to metformin.", "relevance": 5 },
      { "doc_id": "EX022_6", "text": "Systematic reviews recommend routine B12 monitoring for diabetic patients on metformin.", "relevance": 5 },
      { "doc_id": "EX022_7", "text": "Professional societies acknowledge low but consistent risk of B12 issues with metformin.", "relevance": 4 }
    ]
  },
  {
    "query_id": "EX023",
    "query_type": "explicit_NOT",
    "query_text": "Is risperidone not associated with prolactin elevation?",
    "documents": [
      { "doc_id": "EX023_1", "text": "Social media posts often suggest risperidone is completely free of hormonal effects.", "relevance": 1 },
      { "doc_id": "EX023_2", "text": "There’s widespread misunderstanding that second-gen antipsychotics don’t affect prolactin.", "relevance": 2 },
      { "doc_id": "EX023_3", "text": "Early reports showed only mild elevations in prolactin in some users.", "relevance": 3 },
      { "doc_id": "EX023_4", "text": "Several trials show risperidone significantly raises prolactin levels, particularly in women.", "relevance": 4 },
      { "doc_id": "EX023_5", "text": "Meta-analyses confirm a dose-dependent prolactin rise with risperidone therapy.", "relevance": 5 },
      { "doc_id": "EX023_6", "text": "Clinical practice guidelines recommend monitoring prolactin during long-term risperidone use.", "relevance": 5 },
      { "doc_id": "EX023_7", "text": "In pediatric populations, prolactin elevation from risperidone has been observed within weeks.", "relevance": 4 }
    ]
  },
  {
    "query_id": "EX024",
    "query_type": "explicit_NOT",
    "query_text": "Is omeprazole not linked to kidney complications?",
    "documents": [
      { "doc_id": "EX024_1", "text": "Some user forums deny any kidney impact from omeprazole.", "relevance": 1 },
      { "doc_id": "EX024_2", "text": "Opinion pieces emphasize omeprazole’s short-term safety but overlook long-term risks.", "relevance": 2 },
      { "doc_id": "EX024_3", "text": "Cohort studies suggest rare cases of acute kidney issues with extended use.", "relevance": 3 },
      { "doc_id": "EX024_4", "text": "Several studies link omeprazole with increased risk of chronic kidney disease.", "relevance": 4 },
      { "doc_id": "EX024_5", "text": "Meta-analysis confirms significant association between PPI use and kidney damage over time.", "relevance": 5 },
      { "doc_id": "EX024_6", "text": "Renal registries show growing concern over cumulative exposure to PPIs like omeprazole.", "relevance": 4 },
      { "doc_id": "EX024_7", "text": "FDA safety communications mention kidney risk as a warning for long-term omeprazole users.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX025",
    "query_type": "explicit_NOT",
    "query_text": "Does paracetamol not affect liver function when overused?",
    "documents": [
      { "doc_id": "EX025_1", "text": "Some blog posts argue that paracetamol is harmless even at higher doses, which is misleading.", "relevance": 1 },
      { "doc_id": "EX025_2", "text": "Paracetamol is often perceived as liver-safe when taken without alcohol.", "relevance": 2 },
      { "doc_id": "EX025_3", "text": "Case studies indicate liver enzyme elevation in patients using paracetamol above therapeutic limits.", "relevance": 3 },
      { "doc_id": "EX025_4", "text": "Toxicology reports confirm liver failure in cases of paracetamol overdose.", "relevance": 4 },
      { "doc_id": "EX025_5", "text": "Emergency medicine literature documents hundreds of liver toxicity cases due to paracetamol.", "relevance": 5 },
      { "doc_id": "EX025_6", "text": "The WHO includes paracetamol in its watchlist for hepatotoxic drugs under misuse conditions.", "relevance": 5 },
      { "doc_id": "EX025_7", "text": "Doctors advise caution for daily users, especially with coexisting alcohol intake.", "relevance": 4 }
    ]
  },
  {
    "query_id": "EX026",
    "query_type": "explicit_NOT",
    "query_text": "Is fluoxetine not associated with suicidal ideation in adolescents?",
    "documents": [
      { "doc_id": "EX026_1", "text": "Some social media discussions minimize antidepressant risks in teenagers.", "relevance": 1 },
      { "doc_id": "EX026_2", "text": "Popular opinion suggests fluoxetine is always safe in all age groups.", "relevance": 2 },
      { "doc_id": "EX026_3", "text": "Pediatric warnings exist due to observed mood disturbances during early treatment phases.", "relevance": 3 },
      { "doc_id": "EX026_4", "text": "FDA black box warnings highlight suicide risk in young populations using fluoxetine.", "relevance": 4 },
      { "doc_id": "EX026_5", "text": "Large trials confirm higher early-stage ideation risk in teens on fluoxetine vs. placebo.", "relevance": 5 },
      { "doc_id": "EX026_6", "text": "Clinical psychiatrists often taper and monitor fluoxetine in adolescents closely.", "relevance": 5 },
      { "doc_id": "EX026_7", "text": "Some mental health orgs recommend joint therapy to reduce medication risks.", "relevance": 4 }
    ]
  },



  {
    "query_id": "EX011",
    "query_type": "explicit_NOT",
    "query_text": "Is there clear evidence that metformin does not affect cognitive decline in elderly patients?",
    "documents": [
      { "doc_id": "EX011_1", "text": "Anecdotal reports claim metformin may actually improve memory, but lack robust validation.", "relevance": 1 },
      { "doc_id": "EX011_2", "text": "Some early case series failed to observe any cognitive impact in elderly diabetic patients taking metformin.", "relevance": 2 },
      { "doc_id": "EX011_3", "text": "Several observational trials found no significant cognitive differences between metformin users and controls.", "relevance": 2 },
      { "doc_id": "EX011_4", "text": "A meta-analysis concluded there's minimal cognitive effect attributable to metformin over short durations.", "relevance": 3 },
      { "doc_id": "EX011_5", "text": "Multicenter cohort studies revealed mixed findings, with no consistent signal for memory impairment.", "relevance": 3 },
      { "doc_id": "EX011_6", "text": "Placebo-controlled trials failed to detect any deterioration in cognitive scores due to metformin.", "relevance": 4 },
      { "doc_id": "EX011_7", "text": "RCTs consistently show that metformin has no statistically significant impact on cognitive decline.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX012",
    "query_type": "explicit_NOT",
    "query_text": "Does long-term PPI use definitively not increase risk of chronic kidney disease?",
    "documents": [
      { "doc_id": "EX012_1", "text": "Some discussion forums argue there's no connection between PPI use and kidney disease, but these lack citation.", "relevance": 1 },
      { "doc_id": "EX012_2", "text": "Small retrospective studies offer inconclusive evidence regarding kidney outcomes with PPIs.", "relevance": 2 },
      { "doc_id": "EX012_3", "text": "Earlier controlled studies failed to find significant renal function decline due to PPIs.", "relevance": 3 },
      { "doc_id": "EX012_4", "text": "Pooled cohort data show no long-term difference in kidney outcomes between PPI users and non-users.", "relevance": 4 },
      { "doc_id": "EX012_5", "text": "National registry data failed to show a definitive association between PPIs and CKD progression.", "relevance": 4 },
      { "doc_id": "EX012_6", "text": "Rigorous population-based studies demonstrate PPIs likely have no measurable link to kidney disease.", "relevance": 5 },
      { "doc_id": "EX012_7", "text": "Meta-analyses reviewing thousands of patients failed to confirm any kidney risk increase from PPIs.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX013",
    "query_type": "explicit_NOT",
    "query_text": "Do beta blockers not contribute to mood changes in patients with cardiovascular issues?",
    "documents": [
      { "doc_id": "EX013_1", "text": "There are blogs claiming beta blockers lift mood, but they're mostly based on testimonials.", "relevance": 1 },
      { "doc_id": "EX013_2", "text": "Some patients self-report no psychological effects from beta blockers.", "relevance": 1 },
      { "doc_id": "EX013_3", "text": "Single-center studies did not find increased incidence of depressive symptoms in beta blocker cohorts.", "relevance": 2 },
      { "doc_id": "EX013_4", "text": "Controlled psychiatric evaluations noted no emotional change over 12 weeks of beta blocker use.", "relevance": 3 },
      { "doc_id": "EX013_5", "text": "Multivariate-adjusted results indicate minimal behavioral impact in elderly on carvedilol.", "relevance": 4 },
      { "doc_id": "EX013_6", "text": "A systematic review supports that beta blockers generally have no causative link to mood disturbances.", "relevance": 4 },
      { "doc_id": "EX013_7", "text": "Comprehensive reviews confirm beta blockers are not significantly associated with depression or anxiety symptoms.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX014",
    "query_type": "explicit_NOT",
    "query_text": "Is there consensus that aspirin does not elevate the risk of internal bleeding when used preventively?",
    "documents": [
      { "doc_id": "EX014_1", "text": "Social media claims aspirin is completely safe for prevention lack clinical basis.", "relevance": 1 },
      { "doc_id": "EX014_2", "text": "Older patients on low-dose aspirin sometimes report no noticeable side effects.", "relevance": 2 },
      { "doc_id": "EX014_3", "text": "Early observational trials showed negligible differences in bleeding incidence among users.", "relevance": 2 },
      { "doc_id": "EX014_4", "text": "RCTs conducted in elderly adults reported only marginal increases in GI bleeding risk.", "relevance": 3 },
      { "doc_id": "EX014_5", "text": "Meta-reviews point to an insignificant bleeding risk when aspirin is dosed at 81 mg daily.", "relevance": 4 },
      { "doc_id": "EX014_6", "text": "Risk-adjusted trials show no clinically relevant bleeding elevation in specific low-risk groups.", "relevance": 5 },
      { "doc_id": "EX014_7", "text": "Longitudinal studies in preventive cardiology support aspirin’s safety in select populations without prior ulcers.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX015",
    "query_type": "explicit_NOT",
    "query_text": "Do SSRIs definitively not lead to sexual dysfunction in adult patients?",
    "documents": [
      { "doc_id": "EX015_1", "text": "Online forums often deny any sexual effects of SSRIs, but lack empirical support.", "relevance": 1 },
      { "doc_id": "EX015_2", "text": "Patients frequently report no noticeable changes in libido or function with SSRIs.", "relevance": 2 },
      { "doc_id": "EX015_3", "text": "Several studies show inconsistent sexual outcomes when comparing SSRI groups and placebos.", "relevance": 3 },
      { "doc_id": "EX015_4", "text": "Certain SSRIs like sertraline show negligible rates of sexual side effects in controlled environments.", "relevance": 4 },
      { "doc_id": "EX015_5", "text": "Some pharmacovigilance databases show no signal of sexual dysfunction with newer SSRIs.", "relevance": 4 },
      { "doc_id": "EX015_6", "text": "Larger RCTs concluded that SSRIs may not significantly affect sexual functioning overall.", "relevance": 5 },
      { "doc_id": "EX015_7", "text": "Meta-analyses agree there’s insufficient evidence that SSRIs are primary drivers of sexual dysfunction.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX027",
    "query_type": "explicit_NOT",
    "query_text": "Is there no connection between beta-blockers and fatigue?",
    "documents": [
      { "doc_id": "EX027_1", "text": "Several fitness blogs deny any effect of beta-blockers on energy levels, lacking empirical support.", "relevance": 1 },
      { "doc_id": "EX027_2", "text": "Some general websites suggest beta-blockers don’t influence fatigue unless overdosed.", "relevance": 1 },
      { "doc_id": "EX027_3", "text": "Case observations indicate occasional reports of mild tiredness in patients starting beta-blockers.", "relevance": 2 },
      { "doc_id": "EX027_4", "text": "Doctors often observe fatigue as a side effect during the first few weeks of beta-blocker therapy.", "relevance": 2 },
      { "doc_id": "EX027_5", "text": "Controlled studies reveal a moderate decline in daily activity scores among beta-blocker users.", "relevance": 3 },
      { "doc_id": "EX027_6", "text": "Meta-analyses confirm that fatigue, while not universal, is a frequent beta-blocker complaint.", "relevance": 4 },
      { "doc_id": "EX027_7", "text": "RCTs consistently identify fatigue as a statistically significant outcome linked to beta-blockers.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX028",
    "query_type": "explicit_NOT",
    "query_text": "Is sertraline not related to weight changes?",
    "documents": [
      { "doc_id": "EX028_1", "text": "Online posts often claim sertraline has no metabolic impact, but data is mixed.", "relevance": 1 },
      { "doc_id": "EX028_2", "text": "Consumer articles dismiss weight changes with SSRIs, ignoring long-term effects.", "relevance": 2 },
      { "doc_id": "EX028_3", "text": "Some short-term studies report stable weight during initial sertraline use.", "relevance": 3 },
      { "doc_id": "EX028_4", "text": "Extended trials show mild weight gain after 3–6 months of sertraline use.", "relevance": 3 },
      { "doc_id": "EX028_5", "text": "Review articles suggest individual variability, but weight gain remains a concern.", "relevance": 4 },
      { "doc_id": "EX028_6", "text": "Meta-analyses confirm weight gain trends across SSRI users, including sertraline.", "relevance": 4 },
      { "doc_id": "EX028_7", "text": "RCTs demonstrate significant weight increase over a 1-year course of sertraline.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX029",
    "query_type": "explicit_NOT",
    "query_text": "Is there no evidence linking statins to muscle pain?",
    "documents": [
      { "doc_id": "EX029_1", "text": "Some health forums suggest statin-related muscle pain is a myth.", "relevance": 1 },
      { "doc_id": "EX029_2", "text": "Popular blogs often describe muscle aches as psychological side effects of statins.", "relevance": 1 },
      { "doc_id": "EX029_3", "text": "A few observational studies found limited links between statins and mild myopathy.", "relevance": 2 },
      { "doc_id": "EX029_4", "text": "Clinical practitioners often advise patients about transient muscle soreness on statins.", "relevance": 3 },
      { "doc_id": "EX029_5", "text": "Large cohort studies confirm higher myalgia reports in statin-treated groups.", "relevance": 4 },
      { "doc_id": "EX029_6", "text": "Meta-analyses show dose-related increases in muscle pain among statin users.", "relevance": 5 },
      { "doc_id": "EX029_7", "text": "Several trials document biochemical markers of muscle stress with statin exposure.", "relevance": 4 }
    ]
  },
  {
    "query_id": "EX030",
    "query_type": "explicit_NOT",
    "query_text": "Is there no link between isotretinoin and depression in young adults?",
    "documents": [
      { "doc_id": "EX030_1", "text": "Social posts claim acne meds like isotretinoin only improve self-esteem and mood.", "relevance": 1 },
      { "doc_id": "EX030_2", "text": "Some dermatologists argue isotretinoin improves mental health by clearing skin issues.", "relevance": 2 },
      { "doc_id": "EX030_3", "text": "Isolated case reports indicate depressive symptoms emerging post-treatment.", "relevance": 3 },
      { "doc_id": "EX030_4", "text": "Retrospective reviews raise concerns about neuropsychiatric side effects of isotretinoin.", "relevance": 3 },
      { "doc_id": "EX030_5", "text": "Longitudinal studies suggest a small but significant increase in depressive episodes.", "relevance": 4 },
      { "doc_id": "EX030_6", "text": "Regulatory agencies have flagged depression and suicide risk in isotretinoin labeling.", "relevance": 5 },
      { "doc_id": "EX030_7", "text": "RCTs show mixed evidence but highlight the need for mood monitoring during use.", "relevance": 5 }
    ]
  },

  {
    "query_id": "EX051",
    "query_type": "explicit_NOT",
    "query_text": "Is there evidence that metformin does not improve insulin sensitivity?",
    "documents": [
      { "doc_id": "EX051_1", "text": "Some social media threads claim metformin's effect on insulin sensitivity is overstated.", "relevance": 1 },
      { "doc_id": "EX051_2", "text": "Public health forums occasionally argue that diet alone is sufficient without metformin.", "relevance": 2 },
      { "doc_id": "EX051_3", "text": "Clinical trials show modest improvements in insulin uptake after consistent metformin use.", "relevance": 3 },
      { "doc_id": "EX051_4", "text": "A randomized placebo-controlled study confirmed improved insulin sensitivity in prediabetics.", "relevance": 4 },
      { "doc_id": "EX051_5", "text": "Mechanistic studies show metformin activates AMPK pathways that enhance glucose metabolism.", "relevance": 4 },
      { "doc_id": "EX051_6", "text": "Meta-analyses affirm that metformin reliably enhances insulin sensitivity across populations.", "relevance": 5 },
      { "doc_id": "EX051_7", "text": "Endocrinology guidelines list metformin as a first-line agent for improving insulin response.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX052",
    "query_type": "explicit_NOT",
    "query_text": "Is it true that NSAIDs do not cause gastric ulcers?",
    "documents": [
      { "doc_id": "EX052_1", "text": "Alternative medicine blogs claim NSAIDs are safer for the stomach than commonly believed.", "relevance": 1 },
      { "doc_id": "EX052_2", "text": "Lay articles suggest modern NSAIDs formulations are less likely to irritate the gut lining.", "relevance": 2 },
      { "doc_id": "EX052_3", "text": "Long-term use of NSAIDs can compromise gastric mucosal defenses, especially in older adults.", "relevance": 3 },
      { "doc_id": "EX052_4", "text": "Case-control studies consistently link NSAID use with increased ulceration risks.", "relevance": 4 },
      { "doc_id": "EX052_5", "text": "Systematic reviews confirm COX-1 inhibition plays a major role in gastric lining disruption.", "relevance": 5 },
      { "doc_id": "EX052_6", "text": "RCTs comparing ibuprofen and naproxen users show higher ulcer rates versus placebo.", "relevance": 4 },
      { "doc_id": "EX052_7", "text": "Clinical guidelines recommend co-prescribing PPIs to reduce ulcer risks in NSAID users.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX053",
    "query_type": "explicit_NOT",
    "query_text": "Are anticholinergics not linked to cognitive decline?",
    "documents": [
      { "doc_id": "EX053_1", "text": "Health influencers on social platforms say older antihistamines are harmless to brain function.", "relevance": 1 },
      { "doc_id": "EX053_2", "text": "Patient anecdotes mention no cognitive issues after short anticholinergic exposure.", "relevance": 2 },
      { "doc_id": "EX053_3", "text": "Population studies associate chronic anticholinergic use with mild memory impairment.", "relevance": 3 },
      { "doc_id": "EX053_4", "text": "Epidemiological reviews show statistically significant cognitive effects in seniors on such drugs.", "relevance": 3 },
      { "doc_id": "EX053_5", "text": "A cohort of 3,000+ elderly patients showed higher dementia incidence in anticholinergic users.", "relevance": 4 },
      { "doc_id": "EX053_6", "text": "Meta-analyses confirm strong association between long-term use and executive function decline.", "relevance": 4 },
      { "doc_id": "EX053_7", "text": "Guidelines now recommend reducing anticholinergic burden in geriatric prescribing.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX054",
    "query_type": "explicit_NOT",
    "query_text": "Do corticosteroids not suppress the immune system?",
    "documents": [
      { "doc_id": "EX054_1", "text": "Some online discussions promote corticosteroids as immune neutral or even boosting.", "relevance": 1 },
      { "doc_id": "EX054_2", "text": "There are claims that low-dose corticosteroids used briefly have no immune impact.", "relevance": 2 },
      { "doc_id": "EX054_3", "text": "Studies confirm mild immune suppression with prolonged corticosteroid exposure.", "relevance": 3 },
      { "doc_id": "EX054_4", "text": "Glucocorticoids are known to dampen cytokine production and leukocyte trafficking.", "relevance": 4 },
      { "doc_id": "EX054_5", "text": "RCTs show dose-dependent suppression of immune markers after corticosteroid administration.", "relevance": 5 },
      { "doc_id": "EX054_6", "text": "Clinical literature warns against corticosteroids in active infections due to immune dampening.", "relevance": 5 },
      { "doc_id": "EX054_7", "text": "Meta-analyses confirm consistent immunosuppressive effects across steroid types and doses.", "relevance": 4 }
    ]
  },
  {
    "query_id": "EX055",
    "query_type": "explicit_NOT",
    "query_text": "Are antihypertensives not responsible for dizziness or lightheadedness?",
    "documents": [
      { "doc_id": "EX055_1", "text": "Anecdotes online often dismiss dizziness from antihypertensives as psychological.", "relevance": 1 },
      { "doc_id": "EX055_2", "text": "Some wellness blogs state that these drugs don't cause lightheadedness unless misused.", "relevance": 1 },
      { "doc_id": "EX055_3", "text": "Small cohort studies note mild postural dizziness in patients initiating antihypertensives.", "relevance": 2 },
      { "doc_id": "EX055_4", "text": "Orthostatic hypotension is a commonly observed side effect in older patients on these medications.", "relevance": 3 },
      { "doc_id": "EX055_5", "text": "Beta-blockers and ACE inhibitors have been linked to symptomatic hypotension episodes.", "relevance": 4 },
      { "doc_id": "EX055_6", "text": "Clinical trials found dizziness rates of 7–15% depending on dosage and comorbidities.", "relevance": 4 },
      { "doc_id": "EX055_7", "text": "Guidelines recommend gradual dose titration to avoid lightheadedness in antihypertensive therapy.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX061",
    "query_type": "explicit_NOT",
    "query_text": "Is there evidence that PPIs do not increase risk of gastric cancer?",
    "documents": [
      { "doc_id": "EX061_1", "text": "Several commentaries argue that PPIs are harmless for long-term gastric health, which isn't supported by evidence.", "relevance": 1 },
      { "doc_id": "EX061_2", "text": "Some users believe over-the-counter PPIs are too weak to cause cancer risk.", "relevance": 1 },
      { "doc_id": "EX061_3", "text": "A few cohort studies find no conclusive cancer signal after limited-duration PPI exposure.", "relevance": 2 },
      { "doc_id": "EX061_4", "text": "Gastrin elevation from prolonged PPI use has been proposed as a mechanism for increased cancer risk.", "relevance": 3 },
      { "doc_id": "EX061_5", "text": "Epidemiological reviews link chronic PPI intake with slightly elevated gastric cancer incidence.", "relevance": 4 },
      { "doc_id": "EX061_6", "text": "A meta-analysis of 10+ studies confirmed a small but consistent rise in gastric malignancy odds among long-term users.", "relevance": 5 },
      { "doc_id": "EX061_7", "text": "Clinical recommendations now advise reassessing need for long-term PPIs to mitigate potential risks.", "relevance": 4 }
    ]
  },
  {
    "query_id": "EX062",
    "query_type": "explicit_NOT",
    "query_text": "Do SSRIs not lead to increased suicide risk in adolescents?",
    "documents": [
      { "doc_id": "EX062_1", "text": "Some online influencers argue that SSRIs are perfectly safe for all age groups, including teens.", "relevance": 1 },
      { "doc_id": "EX062_2", "text": "Patient advocacy blogs downplay concerns about mood changes in adolescents using SSRIs.", "relevance": 2 },
      { "doc_id": "EX062_3", "text": "FDA black-box warnings highlight elevated suicide ideation risk in pediatric patients on SSRIs.", "relevance": 5 },
      { "doc_id": "EX062_4", "text": "RCTs found increased behavioral activation and suicidal thinking in adolescents during early treatment phases.", "relevance": 4 },
      { "doc_id": "EX062_5", "text": "Pooled safety analyses show higher early-phase risk, though long-term effects are beneficial.", "relevance": 4 },
      { "doc_id": "EX062_6", "text": "Psychiatrists recommend close monitoring during initial weeks of SSRI therapy in youth.", "relevance": 3 },
      { "doc_id": "EX062_7", "text": "Clinical guidelines do not ban SSRIs in teens but emphasize risk-benefit review before prescribing.", "relevance": 3 }
    ]
  },
  {
    "query_id": "EX063",
    "query_type": "explicit_NOT",
    "query_text": "Do statins not increase risk of developing diabetes?",
    "documents": [
      { "doc_id": "EX063_1", "text": "Lifestyle health websites often promote statins as metabolically neutral drugs.", "relevance": 1 },
      { "doc_id": "EX063_2", "text": "Several news outlets report inconsistent findings, leading to public confusion about statin side effects.", "relevance": 2 },
      { "doc_id": "EX063_3", "text": "Multiple observational studies point to a small but statistically significant rise in blood glucose levels with statin use.", "relevance": 3 },
      { "doc_id": "EX063_4", "text": "A meta-analysis of over 90,000 patients showed a 9% increased risk of type 2 diabetes among statin users.", "relevance": 5 },
      { "doc_id": "EX063_5", "text": "Clinical endocrinologists suggest the modest diabetes risk is outweighed by cardiovascular protection.", "relevance": 4 },
      { "doc_id": "EX063_6", "text": "Some experts recommend monitoring HbA1c more closely when statins are prescribed to prediabetics.", "relevance": 3 },
      { "doc_id": "EX063_7", "text": "Guidelines continue to support statins, while acknowledging possible hyperglycemia as a minor side effect.", "relevance": 4 }
    ]
  },
  {
    "query_id": "EX064",
    "query_type": "explicit_NOT",
    "query_text": "Is it true that antibiotics do not affect gut microbiota?",
    "documents": [
      { "doc_id": "EX064_1", "text": "Some food bloggers claim that short-term antibiotics have no meaningful impact on gut health.", "relevance": 1 },
      { "doc_id": "EX064_2", "text": "Patient forums often report quick recovery of gut flora post-antibiotic use.", "relevance": 2 },
      { "doc_id": "EX064_3", "text": "Controlled animal studies demonstrate altered microbiota composition even after a few days of antibiotic exposure.", "relevance": 3 },
      { "doc_id": "EX064_4", "text": "Human studies indicate delayed microbial diversity recovery post broad-spectrum antibiotic treatment.", "relevance": 4 },
      { "doc_id": "EX064_5", "text": "Microbiologists emphasize long-term consequences on gut immunity and metabolism due to repeated antibiotic use.", "relevance": 5 },
      { "doc_id": "EX064_6", "text": "Meta-analyses suggest even single courses of antibiotics can shift microbial populations significantly.", "relevance": 4 },
      { "doc_id": "EX064_7", "text": "Recommendations include probiotic supplementation to restore balance after antibiotics.", "relevance": 3 }
    ]
  },
  {
    "query_id": "EX065",
    "query_type": "explicit_NOT",
    "query_text": "Is aspirin not associated with increased bleeding risk?",
    "documents": [
      { "doc_id": "EX065_1", "text": "Some social media posts claim low-dose aspirin is entirely safe, even for older adults.", "relevance": 1 },
      { "doc_id": "EX065_2", "text": "People often assume that over-the-counter medications like aspirin carry no serious risks.", "relevance": 2 },
      { "doc_id": "EX065_3", "text": "A large-scale cohort study linked aspirin use with increased gastrointestinal bleeding rates.", "relevance": 3 },
      { "doc_id": "EX065_4", "text": "Meta-analyses consistently demonstrate dose-related increases in bleeding episodes.", "relevance": 5 },
      { "doc_id": "EX065_5", "text": "Clinicians frequently monitor for signs of occult bleeding in chronic aspirin users.", "relevance": 3 },
      { "doc_id": "EX065_6", "text": "Clinical guidelines caution aspirin use in elderly patients without strong cardiovascular indication.", "relevance": 4 },
      { "doc_id": "EX065_7", "text": "Gastroprotective strategies are often recommended alongside aspirin for at-risk patients.", "relevance": 4 }
    ]
  },



  {
    "query_id": "EX031",
    "query_type": "explicit_NOT",
    "query_text": "Is there evidence that benzodiazepines do not impair driving performance?",
    "documents": [
      { "doc_id": "EX031_1", "text": "A few discussion forums claim that benzodiazepines have no noticeable effect on driving, but provide no scientific support.", "relevance": 1 },
      { "doc_id": "EX031_2", "text": "A handful of public health blogs casually state that low doses of benzodiazepines don't impair function.", "relevance": 2 },
      { "doc_id": "EX031_3", "text": "Older adults on chronic benzodiazepines showed slightly delayed response times in simulated driving.", "relevance": 3 },
      { "doc_id": "EX031_4", "text": "Multiple cohort studies highlight reduced attention and slower braking reactions in medicated individuals.", "relevance": 4 },
      { "doc_id": "EX031_5", "text": "A randomized trial demonstrated significant impairment in complex driving tasks within 3 hours of intake.", "relevance": 4 },
      { "doc_id": "EX031_6", "text": "Driving simulators reveal that even standard therapeutic doses impact lane-keeping accuracy.", "relevance": 5 },
      { "doc_id": "EX031_7", "text": "Meta-analysis confirms strong association between benzodiazepine use and increased driving accidents.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX032",
    "query_type": "explicit_NOT",
    "query_text": "Is it true that aspirin does not cause bleeding complications?",
    "documents": [
      { "doc_id": "EX032_1", "text": "Several social media posts claim aspirin is completely safe, even when used daily.", "relevance": 1 },
      { "doc_id": "EX032_2", "text": "Some forums argue that modern aspirin formulations don't pose gastrointestinal risks.", "relevance": 1 },
      { "doc_id": "EX032_3", "text": "Case reports document minor gastrointestinal irritation even at low aspirin doses.", "relevance": 2 },
      { "doc_id": "EX032_4", "text": "Research in elderly populations shows mild GI bleeding symptoms in chronic aspirin users.", "relevance": 3 },
      { "doc_id": "EX032_5", "text": "A large-scale retrospective study confirmed modest increases in bleeding risks across populations.", "relevance": 4 },
      { "doc_id": "EX032_6", "text": "RCTs have established significant bleeding risk especially in combination with anticoagulants.", "relevance": 4 },
      { "doc_id": "EX032_7", "text": "Systematic reviews highlight strong links between aspirin and upper GI bleeding incidents.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX033",
    "query_type": "explicit_NOT",
    "query_text": "Can it be confirmed that statins do not affect liver enzymes?",
    "documents": [
      { "doc_id": "EX033_1", "text": "Reddit users frequently report using statins without liver checks, citing no issues.", "relevance": 1 },
      { "doc_id": "EX033_2", "text": "Anecdotal cases mention no noticeable liver enzyme changes during short statin usage.", "relevance": 2 },
      { "doc_id": "EX033_3", "text": "Mild, asymptomatic ALT elevation was observed in some long-term statin users.", "relevance": 3 },
      { "doc_id": "EX033_4", "text": "A pooled analysis found ALT rises in 1–3% of patients on high-dose statins.", "relevance": 3 },
      { "doc_id": "EX033_5", "text": "Guidelines now recommend periodic liver enzyme monitoring due to established risks.", "relevance": 4 },
      { "doc_id": "EX033_6", "text": "Recent trials showed dose-dependent ALT/AST elevations in simvastatin users.", "relevance": 5 },
      { "doc_id": "EX033_7", "text": "FDA warnings highlight hepatotoxicity potential, especially in high-risk groups.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX034",
    "query_type": "explicit_NOT",
    "query_text": "Do SSRIs not contribute to sexual dysfunction in patients?",
    "documents": [
      { "doc_id": "EX034_1", "text": "Some online wellness blogs claim SSRIs are free of sexual side effects.", "relevance": 1 },
      { "doc_id": "EX034_2", "text": "A few clinical brochures mention that modern SSRIs are better tolerated sexually.", "relevance": 2 },
      { "doc_id": "EX034_3", "text": "Mild libido reduction is often reported after several weeks on SSRIs.", "relevance": 3 },
      { "doc_id": "EX034_4", "text": "Surveys confirm 30–40% of patients experience delayed orgasm or arousal difficulties.", "relevance": 3 },
      { "doc_id": "EX034_5", "text": "Controlled studies consistently link fluoxetine and paroxetine with high sexual dysfunction rates.", "relevance": 4 },
      { "doc_id": "EX034_6", "text": "Meta-analyses show sexual side effects are underreported but highly prevalent in SSRI trials.", "relevance": 4 },
      { "doc_id": "EX034_7", "text": "The most recent guidelines label sexual dysfunction as one of the top SSRI adverse effects.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX035",
    "query_type": "explicit_NOT",
    "query_text": "Are antipsychotics not associated with weight gain?",
    "documents": [
      { "doc_id": "EX035_1", "text": "Popular health forums sometimes argue newer antipsychotics don't lead to weight changes.", "relevance": 1 },
      { "doc_id": "EX035_2", "text": "Some patients anecdotally report no weight changes with low-dose risperidone.", "relevance": 2 },
      { "doc_id": "EX035_3", "text": "Weight fluctuations tend to emerge after several weeks of regular antipsychotic use.", "relevance": 3 },
      { "doc_id": "EX035_4", "text": "Atypical antipsychotics are known to trigger metabolic shifts, even with short-term exposure.", "relevance": 3 },
      { "doc_id": "EX035_5", "text": "Longitudinal studies highlight consistent weight gain with olanzapine and clozapine use.", "relevance": 4 },
      { "doc_id": "EX035_6", "text": "Cohort data suggests mean weight gain of 4–7 kg over six months in typical users.", "relevance": 5 },
      { "doc_id": "EX035_7", "text": "Clinical guidelines recommend weight monitoring due to robust evidence of weight gain.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX071",
    "query_type": "explicit_NOT",
    "query_text": "Does risperidone not raise prolactin levels in adolescents?",
    "documents": [
      { "doc_id": "EX071_1", "text": "Some forum comments insist risperidone has no hormonal effects in teens.", "relevance": 1 },
      { "doc_id": "EX071_2", "text": "Anecdotal reports downplay any observable prolactin elevation among youth taking risperidone.", "relevance": 2 },
      { "doc_id": "EX071_3", "text": "Clinicians frequently document elevated prolactin levels during risperidone therapy in adolescents.", "relevance": 4 },
      { "doc_id": "EX071_4", "text": "Several double-blind trials confirm hyperprolactinemia as a dose-dependent side effect of risperidone.", "relevance": 5 },
      { "doc_id": "EX071_5", "text": "Endocrinologists recommend routine hormone monitoring for teens on antipsychotic medication.", "relevance": 3 },
      { "doc_id": "EX071_6", "text": "Systematic reviews emphasize risperidone’s consistent impact on prolactin secretion in young populations.", "relevance": 4 },
      { "doc_id": "EX071_7", "text": "Hormonal disturbances are more pronounced in females and with prolonged risperidone use.", "relevance": 3 }
    ]
  },
  {
    "query_id": "EX072",
    "query_type": "explicit_NOT",
    "query_text": "Is metformin not linked to gastrointestinal discomfort?",
    "documents": [
      { "doc_id": "EX072_1", "text": "Some user testimonials praise metformin as entirely free of stomach-related side effects.", "relevance": 1 },
      { "doc_id": "EX072_2", "text": "Diet forums often recommend metformin without warnings about digestive tolerance.", "relevance": 2 },
      { "doc_id": "EX072_3", "text": "Mild gastrointestinal discomfort is frequently reported in initial weeks of metformin therapy.", "relevance": 3 },
      { "doc_id": "EX072_4", "text": "Studies show up to 25% of patients experience nausea or bloating from standard-release metformin.", "relevance": 5 },
      { "doc_id": "EX072_5", "text": "Extended-release formulations reduce but do not eliminate GI effects.", "relevance": 4 },
      { "doc_id": "EX072_6", "text": "Clinical guidelines advise dose titration to improve metformin tolerability.", "relevance": 3 },
      { "doc_id": "EX072_7", "text": "Gastrointestinal side effects are the leading cause of early discontinuation.", "relevance": 4 }
    ]
  },
  {
    "query_id": "EX073",
    "query_type": "explicit_NOT",
    "query_text": "Does omeprazole not impair magnesium absorption?",
    "documents": [
      { "doc_id": "EX073_1", "text": "Pharmacy blogs claim omeprazole has no measurable effect on mineral absorption.", "relevance": 1 },
      { "doc_id": "EX073_2", "text": "Patients report no noticeable changes in energy or cramps, suggesting no magnesium impact.", "relevance": 2 },
      { "doc_id": "EX073_3", "text": "Case reports exist linking long-term omeprazole use with hypomagnesemia.", "relevance": 3 },
      { "doc_id": "EX073_4", "text": "FDA advisories caution about potential magnesium depletion with prolonged PPI therapy.", "relevance": 5 },
      { "doc_id": "EX073_5", "text": "Hospital studies note rare but serious complications from PPI-induced magnesium loss.", "relevance": 4 },
      { "doc_id": "EX073_6", "text": "Clinicians advise checking serum magnesium in chronic PPI users with unexplained fatigue or arrhythmias.", "relevance": 4 },
      { "doc_id": "EX073_7", "text": "Some studies suggest impaired TRPM6 transporters underlie omeprazole's effect on magnesium levels.", "relevance": 3 }
    ]
  },
  {
    "query_id": "EX074",
    "query_type": "explicit_NOT",
    "query_text": "Is finasteride not associated with sexual side effects in men?",
    "documents": [
      { "doc_id": "EX074_1", "text": "Social media influencers often state that finasteride doesn’t affect libido or sexual function.", "relevance": 1 },
      { "doc_id": "EX074_2", "text": "Some testimonials suggest sexual issues are psychological rather than drug-related.", "relevance": 2 },
      { "doc_id": "EX074_3", "text": "Clinical trials reported a small but consistent incidence of erectile dysfunction with finasteride use.", "relevance": 3 },
      { "doc_id": "EX074_4", "text": "Post-finasteride syndrome has been proposed in some case reports involving persistent dysfunction.", "relevance": 4 },
      { "doc_id": "EX074_5", "text": "Meta-analyses confirm a statistically significant link between finasteride and sexual side effects.", "relevance": 5 },
      { "doc_id": "EX074_6", "text": "Urologists debate the risk magnitude but agree that informed consent is crucial.", "relevance": 4 },
      { "doc_id": "EX074_7", "text": "Risk appears to vary based on dose, duration, and individual sensitivity.", "relevance": 3 }
    ]
  },
  {
    "query_id": "EX075",
    "query_type": "explicit_NOT",
    "query_text": "Does isotretinoin not cause depression or mood changes?",
    "documents": [
      { "doc_id": "EX075_1", "text": "Some dermatology blogs suggest isotretinoin is mood-neutral for all users.", "relevance": 1 },
      { "doc_id": "EX075_2", "text": "Influencers often share only positive experiences with clear skin and no psychological impact.", "relevance": 1 },
      { "doc_id": "EX075_3", "text": "Patient surveys report occasional irritability or sadness during treatment.", "relevance": 2 },
      { "doc_id": "EX075_4", "text": "A few studies suggest a link between isotretinoin and depression, especially in adolescents.", "relevance": 3 },
      { "doc_id": "EX075_5", "text": "The FDA has issued warnings regarding mood monitoring during isotretinoin therapy.", "relevance": 5 },
      { "doc_id": "EX075_6", "text": "Clinicians are advised to assess mental health status before and during acne treatment.", "relevance": 4 },
      { "doc_id": "EX075_7", "text": "Psychological symptoms appear in a small subset and often resolve post-therapy.", "relevance": 3 }
    ]
  },
  {
    "query_id": "EX101",
    "query_type": "explicit_NOT",
    "query_text": "Is there evidence that corticosteroids lead to bone mineral density loss?",
    "documents": [
      { "doc_id": "EX101_1", "text": "Several blog posts dismiss the notion that corticosteroids influence bone health when used short-term.", "relevance": 1 },
      { "doc_id": "EX101_2", "text": "Some lay sources incorrectly suggest bone effects occur only at very high doses.", "relevance": 1 },
      { "doc_id": "EX101_3", "text": "Observational studies show minor density reductions over months of corticosteroid exposure.", "relevance": 2 },
      { "doc_id": "EX101_4", "text": "Bone density changes become more apparent in patients on daily corticosteroids for 6+ months.", "relevance": 3 },
      { "doc_id": "EX101_5", "text": "Aging patients with asthma showed measurable reductions in spinal BMD after long-term corticosteroid use.", "relevance": 3 },
      { "doc_id": "EX101_6", "text": "RCTs confirm dose-dependent bone loss occurs, especially in postmenopausal women.", "relevance": 4 },
      { "doc_id": "EX101_7", "text": "Meta-analyses strongly support the link between sustained corticosteroid use and bone thinning.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX102",
    "query_type": "explicit_NOT",
    "query_text": "Does metformin cause significant weight gain in patients with Type 2 Diabetes?",
    "documents": [
      { "doc_id": "EX102_1", "text": "Online forums frequently report that metformin makes you gain weight, which is a common misconception.", "relevance": 1 },
      { "doc_id": "EX102_2", "text": "A few anecdotal reports suggest some individuals experience weight fluctuations, but it's not a direct causal link.", "relevance": 1 },
      { "doc_id": "EX102_3", "text": "Early studies had conflicting results on metformin's effect on body weight, often due to confounding factors.", "relevance": 2 },
      { "doc_id": "EX102_4", "text": "Many patients on metformin experience no significant change in weight, or even a modest weight loss.", "relevance": 2 },
      { "doc_id": "EX102_5", "text": "Clinical trials often show metformin to be weight-neutral or associated with slight weight reduction.", "relevance": 3 },
      { "doc_id": "EX102_6", "text": "Systematic reviews consistently indicate that metformin does not typically cause weight gain; rather, it often aids in weight management.", "relevance": 4 },
      { "doc_id": "EX102_7", "text": "Large-scale meta-analyses demonstrate a statistically significant trend towards weight stability or modest weight loss with metformin.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX103",
    "query_type": "explicit_NOT",
    "query_text": "Is there no risk of gastrointestinal bleeding with low-dose aspirin?",
    "documents": [
      { "doc_id": "EX103_1", "text": "Some wellness sites claim low-dose aspirin is completely safe for your stomach, which isn't entirely accurate.", "relevance": 1 },
      { "doc_id": "EX103_2", "text": "One person online said they take aspirin daily without any stomach issues, but individual responses vary.", "relevance": 1 },
      { "doc_id": "EX103_3", "text": "While lower than higher doses, a small, but notable risk of GI upset remains with daily low-dose aspirin.", "relevance": 2 },
      { "doc_id": "EX103_4", "text": "Studies indicate a reduced incidence of major bleeding events with low-dose aspirin compared to NSAIDs.", "relevance": 3 },
      { "doc_id": "EX103_5", "text": "Even at low doses, aspirin can irritate the gastric mucosa, especially in susceptible individuals.", "relevance": 4 },
      { "doc_id": "EX103_6", "text": "Research consistently shows a persistent, albeit small, increased risk of upper gastrointestinal bleeding with low-dose aspirin.", "relevance": 4 },
      { "doc_id": "EX103_7", "text": "Pooled data from numerous trials definitively confirm that low-dose aspirin carries a definite, though mitigated, risk of GI hemorrhage.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX104",
    "query_type": "explicit_NOT",
    "query_text": "Does risperidone cause no changes in prolactin levels?",
    "documents": [
      { "doc_id": "EX104_1", "text": "A quick search on general health sites might lead you to believe risperidone has no impact on hormone levels.", "relevance": 1 },
      { "doc_id": "EX104_2", "text": "Some patients report no noticeable side effects, including hormonal ones, from risperidone, which is not universal.", "relevance": 2 },
      { "doc_id": "EX104_3", "text": "Initial reports suggested variable effects on prolactin, prompting further investigation.", "relevance": 2 },
      { "doc_id": "EX104_4", "text": "It was observed that risperidone often leads to dose-dependent increases in serum prolactin.", "relevance": 3 },
      { "doc_id": "EX104_5", "text": "Studies confirm that hyperprolactinemia is a common side effect associated with risperidone use.", "relevance": 3 },
      { "doc_id": "EX104_6", "text": "Clinical guidelines recommend regular monitoring of prolactin levels in patients receiving risperidone due to significant elevations.", "relevance": 4 },
      { "doc_id": "EX104_7", "text": "Meta-analyses of antipsychotic medications unequivocally demonstrate that risperidone is highly associated with elevated prolactin levels.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX105",
    "query_type": "explicit_NOT",
    "query_text": "Is it true that statins don't cause muscle pain?",
    "documents": [
      { "doc_id": "EX105_1", "text": "Some social media posts claim that statins are perfectly safe with no side effects.", "relevance": 1 },
      { "doc_id": "EX105_2", "text": "My friend said their doctor told them statins never cause muscle pain, which can be misleading.", "relevance": 2 },
      { "doc_id": "EX105_3", "text": "Many patients tolerate statins without experiencing any muscle-related discomfort.", "relevance": 3 },
      { "doc_id": "EX105_4", "text": "While not universal, a small percentage of statin users do report myalgia or muscle weakness.", "relevance": 4 },
      { "doc_id": "EX105_5", "text": "Studies show that statin-induced myopathy, while infrequent, is a recognized adverse effect.", "relevance": 4 },
      { "doc_id": "EX105_6", "text": "Clinical trials have documented a higher incidence of muscle pain in statin users compared to placebo.", "relevance": 5 },
      { "doc_id": "EX105_7", "text": "Evidence clearly indicates that statins can, indeed, cause muscle pain in a subset of patients, ranging from mild myalgia to severe rhabdomyolysis.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX106",
    "query_type": "explicit_NOT",
    "query_text": "Do proton pump inhibitors (PPIs) have no long-term side effects?",
    "documents": [
      { "doc_id": "EX106_1", "text": "I read somewhere that PPIs are totally harmless, even if you take them for years, which isn't true.", "relevance": 1 },
      { "doc_id": "EX106_2", "text": "Short-term use of PPIs is generally well-tolerated with minimal adverse events.", "relevance": 1 },
      { "doc_id": "EX106_3", "text": "Some patients use PPIs for extended periods without reporting significant issues.", "relevance": 2 },
      { "doc_id": "EX106_4", "text": "Concerns have been raised regarding potential associations between long-term PPI use and kidney disease.", "relevance": 3 },
      { "doc_id": "EX106_5", "text": "Several observational studies link prolonged PPI therapy to an increased risk of bone fractures.", "relevance": 4 },
      { "doc_id": "EX106_6", "text": "Research suggests a possible correlation between chronic PPI use and an elevated risk of C. difficile infections.", "relevance": 4 },
      { "doc_id": "EX106_7", "text": "Growing evidence from large cohort studies and meta-analyses indicates that long-term PPI use is associated with several adverse outcomes, including kidney disease, bone fractures, and micronutrient deficiencies.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX107",
    "query_type": "explicit_NOT",
    "query_text": "Is it completely safe to use acetaminophen for liver patients?",
    "documents": [
      { "doc_id": "EX107_1", "text": "A social media post indicated that acetaminophen is always safe for everyone, including those with liver issues.", "relevance": 1 },
      { "doc_id": "EX107_2", "text": "General advice often states acetaminophen is safe, but this assumes healthy liver function.", "relevance": 1 },
      { "doc_id": "EX107_3", "text": "In very mild liver impairment, cautious use under medical supervision might be considered.", "relevance": 2 },
      { "doc_id": "EX107_4", "text": "Standard doses of acetaminophen can be problematic for patients with compromised liver function.", "relevance": 3 },
      { "doc_id": "EX107_5", "text": "Dose adjustments are crucial for individuals with pre-existing liver disease to prevent toxicity.", "relevance": 4 },
      { "doc_id": "EX107_6", "text": "Hepatotoxicity from acetaminophen is a known risk, particularly in overdose or in those with impaired liver metabolism.", "relevance": 4 },
      { "doc_id": "EX107_7", "text": "Medical consensus strongly advises against or severely limits acetaminophen use in patients with significant liver disease due to the high risk of acute liver failure.", "relevance": 6 }
    ]
  },
  {
    "query_id": "EX108",
    "query_type": "explicit_NOT",
    "query_text": "Does SSRI use never lead to sexual dysfunction?",
    "documents": [
      { "doc_id": "EX108_1", "text": "Some websites claim SSRIs are a miracle cure with no side effects, which is overly simplistic.", "relevance": 1 },
      { "doc_id": "EX108_2", "text": "Many patients starting SSRIs don't immediately report sexual side effects.", "relevance": 2 },
      { "doc_id": "EX108_3", "text": "While not everyone experiences it, changes in libido or sexual function can occur.", "relevance": 3 },
      { "doc_id": "EX108_4", "text": "Reports suggest that sexual dysfunction is a common, though often underreported, side effect of SSRIs.", "relevance": 3 },
      { "doc_id": "EX108_5", "text": "It was observed that various SSRIs can cause dose-dependent sexual adverse effects.", "relevance": 4 },
      { "doc_id": "EX108_6", "text": "Clinical studies frequently document a significant incidence of sexual dysfunction, including delayed orgasm and decreased libido, with SSRI therapy.", "relevance": 4 },
      { "doc_id": "EX108_7", "text": "Extensive research and meta-analyses definitively establish sexual dysfunction as a pervasive and well-recognized side effect across many SSRIs.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX109",
    "query_type": "explicit_NOT",
    "query_text": "Are antibiotics without any risk of causing C. difficile infection?",
    "documents": [
      { "doc_id": "EX109_1", "text": "Some alternative health blogs incorrectly suggest antibiotics are always safe and have no internal risks.", "relevance": 1 },
      { "doc_id": "EX109_2", "text": "I've taken antibiotics many times without getting C. difficile, so it must be rare, right?", "relevance": 1 },
      { "doc_id": "EX109_3", "text": "The vast majority of antibiotic courses do not result in C. difficile infection.", "relevance": 2 },
      { "doc_id": "EX109_4", "text": "Certain broad-spectrum antibiotics carry a higher risk of disrupting gut flora, leading to C. difficile overgrowth.", "relevance": 3 },
      { "doc_id": "EX109_5", "text": "Hospitalized patients on long courses of antibiotics are particularly vulnerable to this infection.", "relevance": 3 },
      { "doc_id": "EX109_6", "text": "The risk of C. difficile infection is a well-documented adverse effect of antibiotic use, especially with specific classes.", "relevance": 4 },
      { "doc_id": "EX109_7", "text": "Epidemiological data and numerous studies consistently show that antibiotic use is the primary risk factor for C. difficile infection.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX110",
    "query_type": "explicit_NOT",
    "query_text": "Can a ketogenic diet be safely adopted by anyone without medical supervision?",
    "documents": [
      { "doc_id": "EX110_1", "text": "Many online influencers suggest the keto diet is a simple, universally safe weight-loss solution.", "relevance": 1 },
      { "doc_id": "EX110_2", "text": "For healthy individuals, short-term ketogenic diets might not pose immediate significant threats.", "relevance": 2 },
      { "doc_id": "EX110_3", "text": "Some people find the ketogenic diet beneficial for certain conditions when properly managed.", "relevance": 2 },
      { "doc_id": "EX110_4", "text": "Individuals with pre-existing medical conditions, such as kidney disease, require careful monitoring on a ketogenic diet.", "relevance": 3 },
      { "doc_id": "EX110_5", "text": "Adherence to a strict ketogenic diet can lead to electrolyte imbalances and nutrient deficiencies.", "relevance": 4 },
      { "doc_id": "EX110_6", "text": "Medical literature strongly advises against unsupervised ketogenic diet initiation, especially for patients with metabolic disorders.", "relevance": 4 },
      { "doc_id": "EX110_7", "text": "It is unequivocally recommended that individuals considering a ketogenic diet, particularly those with comorbidities, seek thorough medical evaluation and ongoing supervision.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX111",
    "query_type": "explicit_NOT",
    "query_text": "Is it true that vaccines contain harmful ingredients not listed?",
    "documents": [
      { "doc_id": "EX111_1", "text": "Anti-vaccine websites often circulate unsubstantiated claims about hidden toxins in vaccines.", "relevance": 1 },
      { "doc_id": "EX111_2", "text": "A meme I saw mentioned secret ingredients, but it provided no scientific backing.", "relevance": 1 },
      { "doc_id": "EX111_3", "text": "All vaccine ingredients are publicly disclosed and rigorously reviewed by regulatory bodies.", "relevance": 2 },
      { "doc_id": "EX111_4", "text": "Vaccine formulations contain components, like adjuvants and stabilizers, that are well-understood and necessary.", "relevance": 3 },
      { "doc_id": "EX111_5", "text": "The amounts of any excipients in vaccines are far below levels considered harmful.", "relevance": 3 },
      { "doc_id": "EX111_6", "text": "Regulatory agencies worldwide enforce strict transparency regarding vaccine components and their safety profiles.", "relevance": 4 },
      { "doc_id": "EX111_7", "text": "Extensive scientific literature and global health organizations confirm that vaccines' ingredients are fully disclosed and their safety thoroughly assessed.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX112",
    "query_type": "explicit_NOT",
    "query_text": "Does fish oil supplementation have no effect on cardiovascular health?",
    "documents": [
      { "doc_id": "EX112_1", "text": "A casual conversation suggested that fish oil is just a fad and doesn't do anything for your heart.", "relevance": 1 },
      { "doc_id": "EX112_2", "text": "Some people believe dietary changes alone are sufficient, negating the need for supplements.", "relevance": 2 },
      { "doc_id": "EX112_3", "text": "Early small studies showed mixed results on fish oil's overall cardiovascular benefits.", "relevance": 2 },
      { "doc_id": "EX112_4", "text": "High-dose prescription fish oil can significantly lower triglyceride levels.", "relevance": 3 },
      { "doc_id": "EX112_5", "text": "Certain formulations of omega-3 fatty acids have been shown to reduce the risk of major adverse cardiovascular events in high-risk patients.", "relevance": 4 },
      { "doc_id": "EX112_6", "text": "Randomized controlled trials have demonstrated modest, but consistent, benefits of EPA-rich fish oil in specific cardiac populations.", "relevance": 4 },
      { "doc_id": "EX112_7", "text": "Comprehensive meta-analyses support the role of specific omega-3 fatty acid supplements in reducing cardiovascular risk, particularly in secondary prevention.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX113",
    "query_type": "explicit_NOT",
    "query_text": "Is it true that antibiotics are effective against viral infections?",
    "documents": [
      { "doc_id": "EX113_1", "text": "A Facebook post incorrectly claimed antibiotics cure the common cold.", "relevance": 1 },
      { "doc_id": "EX113_2", "text": "Some patients demand antibiotics for viral illnesses, believing they will help them recover faster.", "relevance": 1 },
      { "doc_id": "EX113_3", "text": "Antibiotics target bacterial structures and processes, which are absent in viruses.", "relevance": 2 },
      { "doc_id": "EX113_4", "text": "Using antibiotics for viral infections can lead to antibiotic resistance, a major public health concern.", "relevance": 3 },
      { "doc_id": "EX113_5", "text": "Antivirals, not antibiotics, are the appropriate treatment for most viral diseases like influenza or herpes.", "relevance": 3 },
      { "doc_id": "EX113_6", "text": "Medical guidelines explicitly state that antibiotics are ineffective against viral infections and should not be prescribed.", "relevance": 4 },
      { "doc_id": "EX113_7", "text": "The fundamental mechanism of action for antibiotics demonstrates their specific activity against bacteria, rendering them useless against viruses.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX114",
    "query_type": "explicit_NOT",
    "query_text": "Does all caffeine consumption cause anxiety?",
    "documents": [
      { "doc_id": "EX114_1", "text": "I overheard someone say that even a sip of coffee makes you anxious, which sounds extreme.", "relevance": 1 },
      { "doc_id": "EX114_2", "text": "Many individuals consume caffeine daily without experiencing anxiety.", "relevance": 2 },
      { "doc_id": "EX114_3", "text": "Caffeine's effect on anxiety is highly individual, dependent on dosage and sensitivity.", "relevance": 2 },
      { "doc_id": "EX114_4", "text": "High doses of caffeine can induce anxiety-like symptoms in susceptible individuals.", "relevance": 3 },
      { "doc_id": "EX114_5", "text": "Those with pre-existing anxiety disorders might be more prone to caffeine-induced nervousness.", "relevance": 3 },
      { "doc_id": "EX114_6", "text": "Research indicates that while excessive caffeine intake can exacerbate anxiety, moderate consumption is generally well-tolerated.", "relevance": 4 },
      { "doc_id": "EX114_7", "text": "Studies consistently show a dose-response relationship, where very high caffeine intake, but not typical consumption, correlates with increased anxiety.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX115",
    "query_type": "explicit_NOT",
    "query_text": "Is it true that dietary supplements are always effective for preventing disease?",
    "documents": [
      { "doc_id": "EX115_1", "text": "Many health gurus promote supplements as a foolproof way to avoid all illnesses.", "relevance": 1 },
      { "doc_id": "EX115_2", "text": "Some people strongly believe that taking daily vitamins guarantees perfect health.", "relevance": 1 },
      { "doc_id": "EX115_3", "text": "Certain supplements can address specific nutrient deficiencies.", "relevance": 2 },
      { "doc_id": "EX115_4", "text": "The efficacy of dietary supplements for disease prevention often lacks robust scientific backing.", "relevance": 3 },
      { "doc_id": "EX115_5", "text": "Evidence for many popular supplements providing broad disease protection is limited or inconclusive.", "relevance": 3 },
      { "doc_id": "EX115_6", "text": "Large-scale randomized trials frequently fail to show significant disease prevention benefits from general multivitamin or single-nutrient supplements.", "relevance": 4 },
      { "doc_id": "EX115_7", "text": "Comprehensive reviews of scientific literature consistently demonstrate that for most healthy individuals, dietary supplements do not prevent chronic diseases.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX116",
    "query_type": "explicit_NOT",
    "query_text": "Does all stress inevitably lead to chronic illness?",
    "documents": [
      { "doc_id": "EX116_1", "text": "I read an article that said any stress at all means you'll get sick eventually.", "relevance": 1 },
      { "doc_id": "EX116_2", "text": "Not all individuals exposed to significant stress develop chronic health problems.", "relevance": 2 },
      { "doc_id": "EX116_3", "text": "Acute stress responses are a normal and often adaptive part of human physiology.", "relevance": 2 },
      { "doc_id": "EX116_4", "text": "Prolonged and unmanaged chronic stress can increase the risk of certain health conditions.", "relevance": 3 },
      { "doc_id": "EX116_5", "text": "The impact of stress on health is modulated by individual coping mechanisms and genetic predispositions.", "relevance": 4 },
      { "doc_id": "EX116_6", "text": "While chronic stress is a risk factor, it is not a direct or inevitable cause of all chronic illnesses.", "relevance": 4 },
      { "doc_id": "EX116_7", "text": "Extensive psychological and physiological research indicates that while chronic stress can contribute to health issues, it doesn't invariably lead to chronic illness for everyone.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX117",
    "query_type": "explicit_NOT",
    "query_text": "Is it true that all cancers are genetic and hereditary?",
    "documents": [
      { "doc_id": "EX117_1", "text": "My neighbor believes if someone in your family has cancer, you're guaranteed to get it, which isn't how it works.", "relevance": 1 },
      { "doc_id": "EX117_2", "text": "Some cancers do have a strong hereditary component, but this is not universal.", "relevance": 2 },
      { "doc_id": "EX117_3", "text": "Many cancers arise from sporadic mutations acquired during a person's lifetime.", "relevance": 2 },
      { "doc_id": "EX117_4", "text": "Lifestyle factors like diet, smoking, and environmental exposures play a significant role in cancer development.", "relevance": 3 },
      { "doc_id": "EX117_5", "text": "Only a small percentage of all cancers are considered to be strongly hereditary.", "relevance": 3 },
      { "doc_id": "EX117_6", "text": "While genetics can increase susceptibility, the vast majority of cancer cases are not purely inherited.", "relevance": 4 },
      { "doc_id": "EX117_7", "text": "Current oncology research clearly indicates that most cancers result from a complex interplay of genetic, environmental, and lifestyle factors, with hereditary forms being a minority.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX118",
    "query_type": "explicit_NOT",
    "query_text": "Does hormone replacement therapy (HRT) cause no risk of blood clots?",
    "documents": [
      { "doc_id": "EX118_1", "text": "Some online discussions suggest HRT is completely without risk for blood clots, which is a dangerous oversimplification.", "relevance": 1 },
      { "doc_id": "EX118_2", "text": "The risk profile of HRT has evolved with different formulations and routes of administration.", "relevance": 2 },
      { "doc_id": "EX118_3", "text": "Transdermal HRT appears to carry a lower risk of venous thromboembolism than oral forms.", "relevance": 2 },
      { "doc_id": "EX118_4", "text": "The Women's Health Initiative study raised initial concerns about HRT and cardiovascular events, including clots.", "relevance": 3 },
      { "doc_id": "EX118_5", "text": "While overall risks are low for many, certain types of HRT do increase the risk of deep vein thrombosis and pulmonary embolism.", "relevance": 4 },
      { "doc_id": "EX118_6", "text": "Medical guidelines emphasize the need for individualized risk assessment before initiating HRT, particularly concerning thrombotic events.", "relevance": 4 },
      { "doc_id": "EX118_7", "text": "Extensive epidemiological and clinical trial data confirm that oral HRT, in particular, is associated with a statistically significant, albeit small, increased risk of venous thromboembolism.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX119",
    "query_type": "explicit_NOT",
    "query_text": "Is it true that all mental health conditions are caused by chemical imbalances?",
    "documents": [
      { "doc_id": "EX119_1", "text": "I heard on a podcast that all mental illness is just a simple chemical imbalance, but it feels more complex.", "relevance": 1 },
      { "doc_id": "EX119_2", "text": "While neurotransmitters play a role, the 'chemical imbalance' theory is an oversimplification.", "relevance": 1 },
      { "doc_id": "EX119_3", "text": "Genetic predispositions can increase vulnerability to certain mental health disorders.", "relevance": 2 },
      { "doc_id": "EX119_4", "text": "Traumatic experiences and environmental factors significantly contribute to the development of mental health conditions.", "relevance": 3 },
      { "doc_id": "EX119_5", "text": "Neurobiological processes, brain structure, and connectivity are also implicated.", "relevance": 3 },
      { "doc_id": "EX119_6", "text": "Current psychiatric understanding views mental illness as a result of complex interactions between biological, psychological, and social factors.", "relevance": 4 },
      { "doc_id": "EX119_7", "text": "Contemporary neuroscience demonstrates that mental health conditions arise from a multifactorial etiology, extending far beyond simplistic notions of chemical imbalances.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX120",
    "query_type": "explicit_NOT",
    "query_text": "Does all cholesterol increase the risk of heart disease?",
    "documents": [
      { "doc_id": "EX120_1", "text": "A viral post stated that any cholesterol in your diet is bad for your heart, which is misleading.", "relevance": 1 },
      { "doc_id": "EX120_2", "text": "Many people are confused about the different types of cholesterol and their effects.", "relevance": 2 },
      { "doc_id": "EX120_3", "text": "HDL cholesterol, often called 'good' cholesterol, helps remove excess cholesterol from arteries.", "relevance": 2 },
      { "doc_id": "EX120_4", "text": "Elevated levels of LDL cholesterol are primarily associated with an increased risk of atherosclerosis.", "relevance": 3 },
      { "doc_id": "EX120_5", "text": "Dietary cholesterol's impact on blood cholesterol levels varies significantly among individuals.", "relevance": 3 },
      { "doc_id": "EX120_6", "text": "Medical consensus emphasizes that a healthy lipid profile involves balancing 'good' and 'bad' cholesterol, not eliminating all cholesterol.", "relevance": 4 },
      { "doc_id": "EX120_7", "text": "Current scientific understanding differentiates between various cholesterol types, with high LDL being a significant risk factor, while HDL is generally protective.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX121",
    "query_type": "explicit_NOT",
    "query_text": "Is it true that herbal remedies are always safe because they are natural?",
    "documents": [
      { "doc_id": "EX121_1", "text": "My aunt swears by a natural herb for everything, saying it can't harm you since it's from plants.", "relevance": 1 },
      { "doc_id": "EX121_2", "text": "The belief that 'natural' equates to 'safe' is a common but dangerous misconception.", "relevance": 1 },
      { "doc_id": "EX121_3", "text": "Some herbal remedies have demonstrated therapeutic properties for certain conditions.", "relevance": 2 },
      { "doc_id": "EX121_4", "text": "Herbal products can interact with prescription medications, leading to adverse effects.", "relevance": 3 },
      { "doc_id": "EX121_5", "text": "Many herbs contain potent compounds that can be toxic in high doses or without proper preparation.", "relevance": 3 },
      { "doc_id": "EX121_6", "text": "Cases of liver damage and other severe adverse events have been linked to uncontrolled herbal supplement use.", "relevance": 4 },
      { "doc_id": "EX121_7", "text": "Scientific and medical communities consistently warn that herbal remedies, despite their natural origin, can have significant side effects and drug interactions, necessitating caution and professional advice.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX122",
    "query_type": "explicit_NOT",
    "query_text": "Does ibuprofen never cause kidney issues?",
    "documents": [
      { "doc_id": "EX122_1", "text": "A friend told me ibuprofen is completely safe for kidneys, which I found surprising.", "relevance": 1 },
      { "doc_id": "EX122_2", "text": "Occasional use of ibuprofen by healthy individuals generally poses a low risk to kidney function.", "relevance": 2 },
      { "doc_id": "EX122_3", "text": "Patients with pre-existing kidney disease are at higher risk for adverse renal effects from NSAIDs.", "relevance": 3 },
      { "doc_id": "EX122_4", "text": "Prolonged or high-dose ibuprofen use can lead to acute kidney injury in susceptible populations.", "relevance": 3 },
      { "doc_id": "EX122_5", "text": "It was observed that NSAIDs, including ibuprofen, can impair renal blood flow and glomerular filtration.", "relevance": 4 },
      { "doc_id": "EX122_6", "text": "Medical guidelines advise caution and monitoring of renal function when ibuprofen is used chronically or in high-risk patients.", "relevance": 4 },
      { "doc_id": "EX122_7", "text": "Extensive pharmacological data and clinical reports confirm that ibuprofen can induce various forms of renal dysfunction, particularly with chronic use or in vulnerable individuals.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX123",
    "query_type": "explicit_NOT",
    "query_text": "Is it true that chemotherapy always causes hair loss?",
    "documents": [
      { "doc_id": "EX123_1", "text": "My perception from movies is that chemotherapy always results in complete baldness.", "relevance": 1 },
      { "doc_id": "EX123_2", "text": "The severity of hair loss varies significantly depending on the specific chemotherapy regimen.", "relevance": 2 },
      { "doc_id": "EX123_3", "text": "Some chemotherapy drugs cause thinning, while others lead to complete alopecia.", "relevance": 2 },
      { "doc_id": "EX123_4", "text": "Certain newer targeted therapies or immunotherapies may not cause hair loss at all.", "relevance": 3 },
      { "doc_id": "EX123_5", "text": "Scalp cooling techniques can sometimes mitigate hair loss during chemotherapy.", "relevance": 3 },
      { "doc_id": "EX123_6", "text": "Oncology information clarifies that not all chemotherapy agents cause hair loss, and the extent varies.", "relevance": 4 },
      { "doc_id": "EX123_7", "text": "Patient education materials and medical literature confirm that chemotherapy-induced alopecia is highly drug-specific, and not a universal side effect across all regimens.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX124",
    "query_type": "explicit_NOT",
    "query_text": "Does diabetes always lead to blindness?",
    "documents": [
      { "doc_id": "EX124_1", "text": "I was told that a diabetes diagnosis means you'll eventually lose your sight.", "relevance": 1 },
      { "doc_id": "EX124_2", "text": "Many people with diabetes manage their condition without experiencing severe vision loss.", "relevance": 2 },
      { "doc_id": "EX124_3", "text": "Diabetic retinopathy is a common complication, but it doesn't always progress to blindness.", "relevance": 2 },
      { "doc_id": "EX124_4", "text": "Strict blood sugar control and regular eye exams can significantly reduce the risk of vision impairment.", "relevance": 3 },
      { "doc_id": "EX124_5", "text": "Early detection and treatment of retinopathy can prevent its progression.", "relevance": 3 },
      { "doc_id": "EX124_6", "text": "While diabetes is a leading cause of blindness, it is largely preventable with proper management and timely intervention.", "relevance": 4 },
      { "doc_id": "EX124_7", "text": "Opthalmological research and clinical practice demonstrate that severe vision loss from diabetes is not inevitable, especially with proactive glycemic control and eye care.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX125",
    "query_type": "explicit_NOT",
    "query_text": "Is it true that all headaches are a sign of a brain tumor?",
    "documents": [
      { "doc_id": "EX125_1", "text": "Whenever I get a headache, I immediately jump to the worst conclusion, like a brain tumor.", "relevance": 1 },
      { "doc_id": "EX125_2", "text": "The vast majority of headaches are benign and not indicative of serious pathology.", "relevance": 1 },
      { "doc_id": "EX125_3", "text": "Tension headaches and migraines are far more common causes of head pain.", "relevance": 2 },
      { "doc_id": "EX125_4", "text": "Brain tumor-related headaches often present with specific characteristics, such as worsening over time or neurological deficits.", "relevance": 3 },
      { "doc_id": "EX125_5", "text": "While severe or unusual headaches warrant medical evaluation, they are rarely caused by tumors.", "relevance": 4 },
      { "doc_id": "EX125_6", "text": "Neurological associations confirm that the overwhelming majority of headaches are primary headaches, not secondary to serious underlying conditions.", "relevance": 4 },
      { "doc_id": "EX125_7", "text": "Medical literature and clinical experience unequivocally state that only a minuscule fraction of headaches are attributable to brain tumors, with most being benign in nature.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX126",
    "query_type": "explicit_NOT",
    "query_text": "Does gluten-free mean healthier for everyone?",
    "documents": [
      { "doc_id": "EX126_1", "text": "Many advertisements promote gluten-free products as inherently healthier for everyone, regardless of dietary needs.", "relevance": 1 },
      { "doc_id": "EX126_2", "text": "Some people without celiac disease report feeling better on a gluten-free diet, but this isn't universally observed.", "relevance": 2 },
      { "doc_id": "EX126_3", "text": "For individuals with celiac disease or non-celiac gluten sensitivity, a gluten-free diet is medically necessary.", "relevance": 3 },
      { "doc_id": "EX126_4", "text": "A gluten-free diet can sometimes be less nutritious if not carefully managed, lacking fiber and certain vitamins.", "relevance": 3 },
      { "doc_id": "EX126_5", "text": "Many processed gluten-free products are high in sugar and unhealthy fats.", "relevance": 4 },
      { "doc_id": "EX126_6", "text": "Nutrition experts emphasize that a gluten-free diet is not inherently healthier for the general population.", "relevance": 4 },
      { "doc_id": "EX126_7", "text": "Scientific consensus indicates that for individuals without gluten-related disorders, eliminating gluten offers no inherent health advantage and may even lead to nutritional deficiencies.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX127",
    "query_type": "explicit_NOT",
    "query_text": "Is it true that all fever should be immediately treated with medication?",
    "documents": [
      { "doc_id": "EX127_1", "text": "I always rush to give fever medicine as soon as I see a slight temperature.", "relevance": 1 },
      { "doc_id": "EX127_2", "text": "Many people believe that any fever must be brought down immediately.", "relevance": 1 },
      { "doc_id": "EX127_3", "text": "Fever is a natural physiological response to infection and can aid in fighting it.", "relevance": 2 },
      { "doc_id": "EX127_4", "text": "The primary goal of fever treatment is to alleviate discomfort, not necessarily to normalize temperature.", "relevance": 3 },
      { "doc_id": "EX127_5", "text": "Low-grade fevers in otherwise healthy individuals often do not require medication.", "relevance": 3 },
      { "doc_id": "EX127_6", "text": "Medical guidelines suggest treating fever when it causes distress or exceeds certain thresholds, particularly in vulnerable populations.", "relevance": 4 },
      { "doc_id": "EX127_7", "text": "Current medical recommendations emphasize symptomatic relief and observation for low to moderate fevers, reserving medication for specific indications or high temperatures.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX128",
    "query_type": "explicit_NOT",
    "query_text": "Does all pain indicate tissue damage?",
    "documents": [
      { "doc_id": "EX128_1", "text": "My perception is that if something hurts, it means something is physically broken inside.", "relevance": 1 },
      { "doc_id": "EX128_2", "text": "Some types of pain are indeed directly linked to tissue injury, like a cut or a fracture.", "relevance": 2 },
      { "doc_id": "EX128_3", "text": "Neuropathic pain, for instance, results from nerve damage, not necessarily ongoing tissue damage.", "relevance": 3 },
      { "doc_id": "EX128_4", "text": "Chronic pain can persist long after initial tissue healing, involving complex central nervous system changes.", "relevance": 3 },
      { "doc_id": "EX128_5", "text": "Psychological factors and stress can significantly influence pain perception without direct tissue injury.", "relevance": 4 },
      { "doc_id": "EX128_6", "text": "The experience of pain is multifaceted, involving sensory, emotional, and cognitive components, not solely tissue damage.", "relevance": 4 },
      { "doc_id": "EX128_7", "text": "Modern pain science clearly distinguishes between nociception (tissue signal) and pain (conscious experience), demonstrating that pain can exist without discernible tissue damage.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX129",
    "query_type": "explicit_NOT",
    "query_text": "Is it true that all antibiotics should be taken until the entire prescription is finished, regardless of feeling better?",
    "documents": [
      { "doc_id": "EX129_1", "text": "I've always been told you MUST finish every single antibiotic pill no matter what.", "relevance": 1 },
      { "doc_id": "EX129_2", "text": "The traditional advice of finishing the course aimed to prevent resistance and relapse.", "relevance": 2 },
      { "doc_id": "EX129_3", "text": "For some infections, shorter courses of antibiotics are now being recognized as equally effective.", "relevance": 3 },
      { "doc_id": "EX129_4", "text": "Completing unnecessary longer courses can contribute to antibiotic resistance.", "relevance": 3 },
      { "doc_id": "EX129_5", "text": "New research explores tailoring antibiotic duration based on clinical response and specific infections.", "relevance": 4 },
      { "doc_id": "EX129_6", "text": "While finishing the prescribed course is often critical, emerging evidence suggests this isn't universally true for all antibiotics and infections.", "relevance": 4 },
      { "doc_id": "EX129_7", "text": "Recent shifts in medical guidelines indicate a more nuanced approach to antibiotic duration, with some conditions benefiting from shorter courses or discontinuation upon clinical cure.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX130",
    "query_type": "explicit_NOT",
    "query_text": "Does all sugar cause hyperactivity in children?",
    "documents": [
      { "doc_id": "EX130_1", "text": "Many parents firmly believe that a sugary treat instantly makes their kids bounce off the walls.", "relevance": 1 },
      { "doc_id": "EX130_2", "text": "The 'sugar rush' phenomenon is widely talked about but lacks consistent scientific support.", "relevance": 1 },
      { "doc_id": "EX130_3", "text": "Other factors, like the exciting context of sugary treats (parties), often contribute to increased activity.", "relevance": 2 },
      { "doc_id": "EX130_4", "text": "Most research studies have not found a direct causal link between sugar consumption and hyperactivity.", "relevance": 3 },
      { "doc_id": "EX130_5", "text": "While excessive sugar intake is unhealthy, it's not the primary driver of behavioral issues like ADHD.", "relevance": 3 },
      { "doc_id": "EX130_6", "text": "Pediatric research consistently shows little to no evidence that sugar directly causes hyperactivity in children.", "relevance": 4 },
      { "doc_id": "EX130_7", "text": "Multiple meta-analyses of rigorously designed studies have debunked the long-held myth that sugar causes hyperactivity in children.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX131",
    "query_type": "explicit_NOT",
    "query_text": "Is it true that depression is just a choice or a sign of weakness?",
    "documents": [
      { "doc_id": "EX131_1", "text": "I've heard some people say that depressed individuals just need to 'snap out of it' or try harder.", "relevance": 1 },
      { "doc_id": "EX131_2", "text": "The idea that depression is a personal failing is a harmful and incorrect stigma.", "relevance": 1 },
      { "doc_id": "EX131_3", "text": "Support from loved ones can be beneficial, but it's not a cure for clinical depression.", "relevance": 2 },
      { "doc_id": "EX131_4", "text": "Depression is a complex medical condition influenced by genetic, biological, environmental, and psychological factors.", "relevance": 3 },
      { "doc_id": "EX131_5", "text": "It often requires professional treatment, including therapy and/or medication.", "relevance": 3 },
      { "doc_id": "EX131_6", "text": "Mental health organizations emphasize that depression is a treatable illness, not a character flaw or weakness.", "relevance": 4 },
      { "doc_id": "EX131_7", "text": "Extensive medical and psychological research unequivocally establishes depression as a legitimate and multifaceted illness, not a personal choice or deficiency.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX132",
    "query_type": "explicit_NOT",
    "query_text": "Does radiation from cell phones cause brain tumors?",
    "documents": [
      { "doc_id": "EX132_1", "text": "My aunt is convinced her cell phone is giving her cancer, but I'm skeptical.", "relevance": 1 },
      { "doc_id": "EX132_2", "text": "Concerns about cell phone radiation have existed for decades, leading to much research.", "relevance": 2 },
      { "doc_id": "EX132_3", "text": "Cell phones emit non-ionizing radiation, which is different from harmful ionizing radiation.", "relevance": 2 },
      { "doc_id": "EX132_4", "text": "Numerous large-scale studies have investigated the link between cell phone use and brain tumors.", "relevance": 3 },
      { "doc_id": "EX132_5", "text": "While some studies have shown weak associations, the overall evidence remains inconclusive.", "relevance": 3 },
      { "doc_id": "EX132_6", "text": "Major health organizations, like the WHO, state that current scientific evidence does not confirm a causal link.", "relevance": 4 },
      { "doc_id": "EX132_7", "text": "Extensive research, including long-term cohort studies, has not provided convincing evidence that radiofrequency electromagnetic fields from cell phones cause brain cancer.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX133",
    "query_type": "explicit_NOT",
    "query_text": "Is it true that childhood vaccines cause autism?",
    "documents": [
      { "doc_id": "EX133_1", "text": "Despite scientific refutation, some online groups continue to propagate the false link between vaccines and autism.", "relevance": 1 },
      { "doc_id": "EX133_2", "text": "The original study claiming this link was retracted due to fraudulent data.", "relevance": 1 },
      { "doc_id": "EX133_3", "text": "Autism is a complex neurodevelopmental disorder with genetic and environmental factors.", "relevance": 2 },
      { "doc_id": "EX133_4", "text": "Numerous independent, large-scale studies have been conducted worldwide to investigate this claim.", "relevance": 3 },
      { "doc_id": "EX133_5", "text": "All major medical and scientific bodies have concluded there is no evidence to support a link.", "relevance": 4 },
      { "doc_id": "EX133_6", "text": "The consensus among the global scientific community is that vaccines do not cause autism.", "relevance": 5 },
      { "doc_id": "EX133_7", "text": "Comprehensive epidemiological analyses involving millions of children have definitively disproven any causal association between childhood vaccines and autism spectrum disorder.", "relevance": 6 }
    ]
  },
  {
    "query_id": "EX134",
    "query_type": "explicit_NOT",
    "query_text": "Does consuming artificial sweeteners guarantee weight loss?",
    "documents": [
      { "doc_id": "EX134_1", "text": "Marketing often implies that switching to diet drinks will automatically make you thin.", "relevance": 1 },
      { "doc_id": "EX134_2", "text": "Some individuals report weight loss after replacing sugary beverages with diet versions.", "relevance": 2 },
      { "doc_id": "EX134_3", "text": "Artificial sweeteners contain minimal to no calories, potentially reducing caloric intake.", "relevance": 2 },
      { "doc_id": "EX134_4", "text": "The effect of artificial sweeteners on long-term weight management is still a subject of ongoing research.", "relevance": 3 },
      { "doc_id": "EX134_5", "text": "Some studies suggest a potential for compensatory eating or altered gut microbiome with sweetener use.", "relevance": 4 },
      { "doc_id": "EX134_6", "text": "While they can be part of a weight-loss strategy, artificial sweeteners alone do not guarantee weight reduction.", "relevance": 4 },
      { "doc_id": "EX134_7", "text": "Current scientific evidence does not conclusively demonstrate that artificial sweetener consumption leads to sustained weight loss, with some studies even suggesting mixed or contrary effects on metabolism.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX135",
    "query_type": "explicit_NOT",
    "query_text": "Is it true that a colonoscopy is entirely without risk?",
    "documents": [
      { "doc_id": "EX135_1", "text": "My doctor said colonoscopies are routine, so I assume there's absolutely no danger involved.", "relevance": 1 },
      { "doc_id": "EX135_2", "text": "Colonoscopies are generally safe procedures with a low complication rate.", "relevance": 2 },
      { "doc_id": "EX135_3", "text": "The benefits of colon cancer screening often outweigh the minimal risks.", "relevance": 2 },
      { "doc_id": "EX135_4", "text": "Though rare, complications like perforation of the colon or bleeding can occur.", "relevance": 3 },
      { "doc_id": "EX135_5", "text": "Sedation used during the procedure carries its own, albeit small, set of risks.", "relevance": 3 },
      { "doc_id": "EX135_6", "text": "Gastroenterology guidelines detail potential, though infrequent, adverse events associated with colonoscopy.", "relevance": 4 },
      { "doc_id": "EX135_7", "text": "While highly effective and generally safe, medical literature clearly outlines the specific, though rare, risks of colonoscopy, including perforation and post-polypectomy bleeding.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX136",
    "query_type": "explicit_NOT",
    "query_text": "Does taking daily multivitamins prevent all types of cancer?",
    "documents": [
      { "doc_id": "EX136_1", "text": "I started taking a multivitamin every day because I heard it prevents all cancer.", "relevance": 1 },
      { "doc_id": "EX136_2", "text": "Some observational studies have suggested possible weak associations with reduced cancer risk.", "relevance": 2 },
      { "doc_id": "EX136_3", "text": "For individuals with specific nutritional deficiencies, supplementation may be beneficial.", "relevance": 2 },
      { "doc_id": "EX136_4", "text": "Large randomized controlled trials have generally failed to show a significant benefit of multivitamins in preventing common cancers.", "relevance": 3 },
      { "doc_id": "EX136_5", "text": "In some cases, high doses of certain vitamins might even increase cancer risk.", "relevance": 4 },
      { "doc_id": "EX136_6", "text": "The prevailing medical advice emphasizes a balanced diet over multivitamin supplementation for cancer prevention.", "relevance": 4 },
      { "doc_id": "EX136_7", "text": "Extensive research, including meta-analyses of numerous trials, has consistently found no compelling evidence that daily multivitamin use prevents cancer in the general population.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX137",
    "query_type": "explicit_NOT",
    "query_text": "Is it true that type 1 diabetes can be cured with diet and exercise?",
    "documents": [
      { "doc_id": "EX137_1", "text": "I saw an article claiming type 1 diabetes could be reversed with a special diet.", "relevance": 1 },
      { "doc_id": "EX137_2", "text": "Type 1 diabetes is an autoimmune condition where the body attacks insulin-producing cells.", "relevance": 1 },
      { "doc_id": "EX137_3", "text": "Diet and exercise are crucial for managing blood sugar levels in type 1 diabetes.", "relevance": 2 },
      { "doc_id": "EX137_4", "text": "However, they do not address the underlying autoimmune destruction of pancreatic beta cells.", "relevance": 3 },
      { "doc_id": "EX137_5", "text": "Insulin therapy remains essential for survival in individuals with type 1 diabetes.", "relevance": 4 },
      { "doc_id": "EX137_6", "text": "Medical research confirms that there is currently no cure for type 1 diabetes.", "relevance": 4 },
      { "doc_id": "EX137_7", "text": "Current endocrinology and immunology research indicates that type 1 diabetes is a chronic autoimmune condition requiring lifelong insulin, and it cannot be cured by diet and exercise alone.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX138",
    "query_type": "explicit_NOT",
    "query_text": "Does consuming dairy products cause no health problems for anyone?",
    "documents": [
      { "doc_id": "EX138_1", "text": "My grandmother believes dairy is a perfect food for everyone, with no downsides.", "relevance": 1 },
      { "doc_id": "EX138_2", "text": "Many people enjoy dairy products without any issues.", "relevance": 2 },
      { "doc_id": "EX138_3", "text": "Lactose intolerance is a common condition where individuals struggle to digest milk sugar.", "relevance": 3 },
      { "doc_id": "EX138_4", "text": "Some individuals experience dairy allergies, triggering immune responses.", "relevance": 3 },
      { "doc_id": "EX138_5", "text": "Concerns exist regarding potential links between high dairy consumption and certain health conditions in some populations.", "relevance": 4 },
      { "doc_id": "EX138_6", "text": "Nutritional science acknowledges that while dairy can be part of a healthy diet, it's not universally suitable for everyone.", "relevance": 4 },
      { "doc_id": "EX138_7", "text": "Medical and dietary guidelines emphasize that individuals with lactose intolerance, dairy allergies, or certain sensitivities may experience adverse health effects from dairy consumption.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX139",
    "query_type": "explicit_NOT",
    "query_text": "Is it true that all psychiatric medications are equally effective for all individuals?",
    "documents": [
      { "doc_id": "EX139_1", "text": "Someone told me all antidepressants work the same for everyone, so it doesn't matter which one you take.", "relevance": 1 },
      { "doc_id": "EX139_2", "text": "Finding the right psychiatric medication often involves a process of trial and error.", "relevance": 2 },
      { "doc_id": "EX139_3", "text": "Individual responses to psychiatric medications are highly variable due to genetic and metabolic factors.", "relevance": 3 },
      { "doc_id": "EX139_4", "text": "Different classes of psychiatric drugs target distinct neurochemical pathways.", "relevance": 3 },
      { "doc_id": "EX139_5", "text": "Factors like symptom profile, comorbidity, and patient history influence medication choice.", "relevance": 4 },
      { "doc_id": "EX139_6", "text": "Psychiatric guidelines advocate for personalized treatment approaches, recognizing diverse medication responses.", "relevance": 4 },
      { "doc_id": "EX139_7", "text": "Clinical pharmacology and psychiatry research extensively demonstrate that the efficacy and side effect profiles of psychiatric medications vary widely among individuals, necessitating individualized prescribing.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX140",
    "query_type": "explicit_NOT",
    "query_text": "Does cannabis use have no negative effects on adolescent brain development?",
    "documents": [
      { "doc_id": "EX140_1", "text": "Some people argue that cannabis is completely harmless, especially for young people.", "relevance": 1 },
      { "doc_id": "EX140_2", "text": "The long-term effects of cannabis are still being studied, but there are growing concerns.", "relevance": 2 },
      { "doc_id": "EX140_3", "text": "Adolescent brains are still developing, making them potentially more vulnerable to substances.", "relevance": 3 },
      { "doc_id": "EX140_4", "text": "Studies suggest a link between early and heavy cannabis use and altered brain structure and function.", "relevance": 4 },
      { "doc_id": "EX140_5", "text": "Cognitive impairments, such as memory and attention issues, have been observed in some adolescent users.", "relevance": 4 },
      { "doc_id": "EX140_6", "text": "Research indicates that chronic cannabis exposure during adolescence may increase the risk of developing psychotic disorders.", "relevance": 5 },
      { "doc_id": "EX140_7", "text": "Neuroscientific studies provide strong evidence that regular cannabis use during adolescence can negatively impact brain development, leading to long-lasting cognitive and psychiatric consequences.", "relevance": 6 }
    ]
  },
  {
    "query_id": "EX141",
    "query_type": "explicit_NOT",
    "query_text": "Is it true that all pain can be eliminated by willpower alone?",
    "documents": [
      { "doc_id": "EX141_1", "text": "I once heard a motivational speaker claim you can just think away any pain.", "relevance": 1 },
      { "doc_id": "EX141_2", "text": "Mind-body techniques can influence pain perception, but they don't erase physical injury.", "relevance": 2 },
      { "doc_id": "EX141_3", "text": "The placebo effect demonstrates the brain's powerful role in modulating pain signals.", "relevance": 2 },
      { "doc_id": "EX141_4", "text": "While psychological resilience is important, it cannot override severe tissue damage or chronic disease processes.", "relevance": 3 },
      { "doc_id": "EX141_5", "text": "Pain management often involves a multidisciplinary approach, including medication and physical therapy.", "relevance": 4 },
      { "doc_id": "EX141_6", "text": "Medical professionals agree that pain is a complex biopsychosocial phenomenon, not solely amenable to willpower.", "relevance": 4 },
      { "doc_id": "EX141_7", "text": "Scientific understanding of pain clearly refutes the notion that willpower alone can eliminate all types of pain, especially those rooted in organic pathology.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX142",
    "query_type": "explicit_NOT",
    "query_text": "Does a healthy diet mean you'll never get sick?",
    "documents": [
      { "doc_id": "EX142_1", "text": "Some health bloggers suggest that if you eat perfectly, you'll never catch a cold.", "relevance": 1 },
      { "doc_id": "EX142_2", "text": "A nutritious diet definitely supports a strong immune system, that's true.", "relevance": 2 },
      { "doc_id": "EX142_3", "text": "However, exposure to pathogens is inevitable, and even healthy individuals can get sick.", "relevance": 2 },
      { "doc_id": "EX142_4", "text": "Factors like sleep, stress, and genetics also significantly influence susceptibility to illness.", "relevance": 3 },
      { "doc_id": "EX142_5", "text": "While a good diet reduces risk, it cannot provide absolute immunity against all diseases.", "relevance": 4 },
      { "doc_id": "EX142_6", "text": "Public health guidelines emphasize that a healthy lifestyle reduces disease incidence but doesn't eliminate it.", "relevance": 4 },
      { "doc_id": "EX142_7", "text": "Medical science confirms that while optimal nutrition is crucial for health, it does not confer complete immunity from illness, as various factors contribute to disease susceptibility.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX143",
    "query_type": "explicit_NOT",
    "query_text": "Is it true that taking melatonin causes no dependence?",
    "documents": [
      { "doc_id": "EX143_1", "text": "A relative told me melatonin is just a natural sleep aid and has no addictive properties at all.", "relevance": 1 },
      { "doc_id": "EX143_2", "text": "Melatonin is generally considered non-addictive in the same way as prescription hypnotics.", "relevance": 2 },
      { "doc_id": "EX143_3", "text": "However, some individuals report difficulty sleeping without it after prolonged use.", "relevance": 3 },
      { "doc_id": "EX143_4", "text": "This could be psychological dependence or a rebound effect, not true physiological addiction.", "relevance": 3 },
      { "doc_id": "EX143_5", "text": "Though rare, withdrawal symptoms have been anecdotally reported when discontinuing high doses.", "relevance": 4 },
      { "doc_id": "EX143_6", "text": "Sleep specialists caution against long-term, unsupervised use due to potential habituation.", "relevance": 4 },
      { "doc_id": "EX143_7", "text": "While not causing classical addiction, consistent melatonin use can lead to psychological reliance and difficulty returning to baseline sleep without it.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX144",
    "query_type": "explicit_NOT",
    "query_text": "Does all fever indicate a bacterial infection requiring antibiotics?",
    "documents": [
      { "doc_id": "EX144_1", "text": "I tend to panic with any fever and immediately think I need an antibiotic.", "relevance": 1 },
      { "doc_id": "EX144_2", "text": "Many viral infections, like the common cold or flu, cause fever.", "relevance": 1 },
      { "doc_id": "EX144_3", "text": "Fever is the body's natural defense mechanism against various pathogens.", "relevance": 2 },
      { "doc_id": "EX144_4", "text": "Distinguishing between viral and bacterial causes of fever is crucial for appropriate treatment.", "relevance": 3 },
      { "doc_id": "EX144_5", "text": "Unnecessary antibiotic use for viral fevers contributes to antibiotic resistance.", "relevance": 4 },
      { "doc_id": "EX144_6", "text": "Medical guidelines stress that fever alone is not an indicator for antibiotic therapy.", "relevance": 4 },
      { "doc_id": "EX144_7", "text": "Clinical diagnostics routinely differentiate between bacterial and viral etiologies of fever, with most cases attributable to self-limiting viral infections not requiring antibiotics.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX145",
    "query_type": "explicit_NOT",
    "query_text": "Is it true that all forms of sugar are equally harmful?",
    "documents": [
      { "doc_id": "EX145_1", "text": "I heard that natural sugars, like those in fruit, are just as bad as processed sugar.", "relevance": 1 },
      { "doc_id": "EX145_2", "text": "While chemically similar, sugars exist in various forms and contexts within food.", "relevance": 2 },
      { "doc_id": "EX145_3", "text": "Fructose in fruit comes packaged with fiber, vitamins, and antioxidants.", "relevance": 3 },
      { "doc_id": "EX145_4", "text": "Added sugars in processed foods provide empty calories and contribute to poor health outcomes.", "relevance": 3 },
      { "doc_id": "EX145_5", "text": "The body metabolizes naturally occurring sugars differently than highly refined sugars.", "relevance": 4 },
      { "doc_id": "EX145_6", "text": "Nutrition science differentiates between intrinsic sugars in whole foods and free/added sugars for health recommendations.", "relevance": 4 },
      { "doc_id": "EX145_7", "text": "Dietary guidelines and scientific research unequivocally state that the health impact of sugars varies significantly based on their source and processing, with added sugars being the primary concern.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX146",
    "query_type": "explicit_NOT",
    "query_text": "Does sunscreen provide 100% protection against skin cancer?",
    "documents": [
      { "doc_id": "EX146_1", "text": "My friend thinks as long as they put on sunscreen, they're completely safe from skin cancer.", "relevance": 1 },
      { "doc_id": "EX146_2", "text": "Sunscreen is a crucial tool in preventing sun damage and reducing skin cancer risk.", "relevance": 2 },
      { "doc_id": "EX146_3", "text": "However, no sunscreen blocks 100% of UV radiation.", "relevance": 2 },
      { "doc_id": "EX146_4", "text": "Factors like incomplete application, reapplication frequency, and sweat can reduce its effectiveness.", "relevance": 3 },
      { "doc_id": "EX146_5", "text": "Seeking shade and wearing protective clothing are also vital components of sun protection.", "relevance": 4 },
      { "doc_id": "EX146_6", "text": "Dermatological advice emphasizes a multi-pronged approach to sun safety, acknowledging sunscreen's limitations.", "relevance": 4 },
      { "doc_id": "EX146_7", "text": "Public health campaigns and scientific literature consistently state that while sunscreen is highly effective, it does not offer absolute protection and should be part of a broader sun-safe strategy.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX147",
    "query_type": "explicit_NOT",
    "query_text": "Is it true that all cholesterol-lowering drugs cause muscle damage?",
    "documents": [
      { "doc_id": "EX147_1", "text": "I'm hesitant to take a statin because I heard they all destroy your muscles.", "relevance": 1 },
      { "doc_id": "EX147_2", "text": "Statins can indeed cause muscle pain or weakness in some individuals.", "relevance": 2 },
      { "doc_id": "EX147_3", "text": "However, this side effect is not universal and varies by drug and patient.", "relevance": 2 },
      { "doc_id": "EX147_4", "text": "Other cholesterol-lowering drugs, like PCSK9 inhibitors or ezetimibe, have different side effect profiles.", "relevance": 3 },
      { "doc_id": "EX147_5", "text": "Muscle damage (rhabdomyolysis) is a rare but serious complication, predominantly with high-dose statins.", "relevance": 4 },
      { "doc_id": "EX147_6", "text": "Cardiology guidelines involve careful monitoring for muscle symptoms, but do not imply universal damage.", "relevance": 4 },
      { "doc_id": "EX147_7", "text": "Pharmacological studies and clinical experience demonstrate that while statins can cause muscle issues in a subset of patients, it's not a universal effect across all cholesterol-lowering medications or all statin users.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX148",
    "query_type": "explicit_NOT",
    "query_text": "Does a negative COVID-19 test mean you are not infectious at all?",
    "documents": [
      { "doc_id": "EX148_1", "text": "Someone claimed a negative test means you can go anywhere without worry.", "relevance": 1 },
      { "doc_id": "EX148_2", "text": "False negatives can occur, especially with rapid antigen tests, if viral load is low.", "relevance": 2 },
      { "doc_id": "EX148_3", "text": "The timing of the test relative to exposure or symptom onset impacts accuracy.", "relevance": 3 },
      { "doc_id": "EX148_4", "text": "A negative test indicates you were likely not infectious at the moment of testing.", "relevance": 3 },
      { "doc_id": "EX148_5", "text": "You could still be in the incubation period and become infectious later.", "relevance": 4 },
      { "doc_id": "EX148_6", "text": "Public health guidance advises continued caution and symptom monitoring even after a negative test.", "relevance": 4 },
      { "doc_id": "EX148_7", "text": "Epidemiological data and infectious disease specialists confirm that a single negative COVID-19 test does not guarantee zero infectivity, due to factors like test sensitivity and incubation periods.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX149",
    "query_type": "explicit_NOT",
    "query_text": "Is it true that all fevers are dangerous and require immediate medical attention?",
    "documents": [
      { "doc_id": "EX149_1", "text": "My mother always tells me to call the doctor for any fever, no matter how low.", "relevance": 1 },
      { "doc_id": "EX149_2", "text": "Most fevers are part of the body's normal immune response to common infections.", "relevance": 2 },
      { "doc_id": "EX149_3", "text": "Low-grade fevers often resolve on their own with rest and hydration.", "relevance": 2 },
      { "doc_id": "EX149_4", "text": "The age of the patient and accompanying symptoms are crucial in assessing fever severity.", "relevance": 3 },
      { "doc_id": "EX149_5", "text": "High fevers, especially in infants or those with chronic conditions, warrant medical evaluation.", "relevance": 4 },
      { "doc_id": "EX149_6", "text": "Pediatric and adult medical guidelines provide clear criteria for when fever necessitates a doctor's visit.", "relevance": 4 },
      { "doc_id": "EX149_7", "text": "Medical consensus confirms that while fevers can be a symptom of serious illness, many are self-limiting and do not require immediate medical intervention unless specific warning signs are present.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX150",
    "query_type": "explicit_NOT",
    "query_text": "Does natural sugar from fruit cause the same health issues as added sugar?",
    "documents": [
      { "doc_id": "EX150_1", "text": "I was told by a diet guru that fruit sugar is just as bad as candy sugar.", "relevance": 1 },
      { "doc_id": "EX150_2", "text": "Chemically, fructose is fructose, but context matters immensely.", "relevance": 2 },
      { "doc_id": "EX150_3", "text": "Fruit provides fiber, which slows sugar absorption and contributes to fullness.", "relevance": 3 },
      { "doc_id": "EX150_4", "text": "Added sugars in sodas and processed foods lack nutritional value and lead to rapid blood sugar spikes.", "relevance": 3 },
      { "doc_id": "EX150_5", "text": "It's difficult to overconsume sugar by eating whole fruits compared to sugary drinks.", "relevance": 4 },
      { "doc_id": "EX150_6", "text": "Dietary guidelines consistently recommend limiting added sugars while encouraging fruit consumption.", "relevance": 4 },
      { "doc_id": "EX150_7", "text": "Extensive nutritional research demonstrates that natural sugars found in whole fruits do not pose the same health risks as excessive consumption of added sugars.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX151",
    "query_type": "explicit_NOT",
    "query_text": "Is it true that all joint pain is a sign of arthritis?",
    "documents": [
      { "doc_id": "EX151_1", "text": "My grandmother has arthritis, so she thinks every joint ache means it's arthritis.", "relevance": 1 },
      { "doc_id": "EX151_2", "text": "Joint pain can stem from various causes, not solely inflammatory conditions.", "relevance": 2 },
      { "doc_id": "EX151_3", "text": "Overuse injuries, strains, or sprains can also lead to temporary joint discomfort.", "relevance": 2 },
      { "doc_id": "EX151_4", "text": "Tendinitis or bursitis, which are inflammatory conditions of tissues around joints, are common culprits.", "relevance": 3 },
      { "doc_id": "EX151_5", "text": "Fibromyalgia or other systemic conditions can manifest as widespread joint pain.", "relevance": 4 },
      { "doc_id": "EX151_6", "text": "Orthopedic and rheumatology literature details numerous non-arthritic causes of joint pain.", "relevance": 4 },
      { "doc_id": "EX151_7", "text": "Medical diagnostics confirm that while arthritis is a common cause, a significant proportion of joint pain cases are due to other musculoskeletal or systemic issues.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX152",
    "query_type": "explicit_NOT",
    "query_text": "Does being overweight mean you are automatically unhealthy?",
    "documents": [
      { "doc_id": "EX152_1", "text": "A viral social media post claimed that thinness equals health, and any extra weight means you're sick.", "relevance": 1 },
      { "doc_id": "EX152_2", "text": "While obesity is a risk factor for many diseases, the relationship between weight and health is complex.", "relevance": 2 },
      { "doc_id": "EX152_3", "text": "Individuals can be 'metabolically healthy obese,' meaning they have healthy blood markers despite higher weight.", "relevance": 3 },
      { "doc_id": "EX152_4", "text": "Factors like fitness level, diet quality, and body composition contribute significantly to overall health.", "relevance": 3 },
      { "doc_id": "EX152_5", "text": "A sedentary lifestyle with poor nutrition can lead to metabolic issues even in normal-weight individuals.", "relevance": 4 },
      { "doc_id": "EX152_6", "text": "Public health discussions increasingly focus on health behaviors rather than solely on weight as a health indicator.", "relevance": 4 },
      { "doc_id": "EX152_7", "text": "Emerging research in nutrition and public health demonstrates that health is not solely defined by weight, and a holistic view including lifestyle factors is crucial.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX153",
    "query_type": "explicit_NOT",
    "query_text": "Is it true that once you start taking blood pressure medication, you can never stop?",
    "documents": [
      { "doc_id": "EX153_1", "text": "My uncle believes that blood pressure pills are a lifelong sentence, with no escape.", "relevance": 1 },
      { "doc_id": "EX153_2", "text": "For many, medication is necessary for long-term blood pressure control.", "relevance": 2 },
      { "doc_id": "EX153_3", "text": "However, significant lifestyle changes can sometimes reduce or eliminate the need for medication.", "relevance": 3 },
      { "doc_id": "EX153_4", "text": "Weight loss, regular exercise, and a low-sodium diet can profoundly impact blood pressure.", "relevance": 3 },
      { "doc_id": "EX153_5", "text": "Under strict medical supervision, some patients can successfully de-escalate or discontinue medication.", "relevance": 4 },
      { "doc_id": "EX153_6", "text": "Cardiology guidelines allow for medication reduction if blood pressure is consistently controlled through lifestyle.", "relevance": 4 },
      { "doc_id": "EX153_7", "text": "Clinical practice shows that while many patients require ongoing medication, substantial lifestyle modifications can, in some cases, lead to reduced dosage or even discontinuation of antihypertensive drugs under medical guidance.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX154",
    "query_type": "explicit_NOT",
    "query_text": "Does a common cold always require a visit to the doctor?",
    "documents": [
      { "doc_id": "EX154_1", "text": "Every time I sneeze, my partner tells me to run to the doctor.", "relevance": 1 },
      { "doc_id": "EX154_2", "text": "The common cold is a self-limiting viral infection that usually resolves on its own.", "relevance": 2 },
      { "doc_id": "EX154_3", "text": "Symptomatic relief with over-the-counter medications and rest is typically sufficient.", "relevance": 3 },
      { "doc_id": "EX154_4", "text": "Only if symptoms worsen, new symptoms appear, or if there are concerns about complications should a doctor be seen.", "relevance": 3 },
      { "doc_id": "EX154_5", "text": "Persistent high fever, severe chest pain, or difficulty breathing warrant immediate medical attention.", "relevance": 4 },
      { "doc_id": "EX154_6", "text": "Public health agencies advise against unnecessary doctor visits for routine colds to avoid overburdening healthcare systems.", "relevance": 4 },
      { "doc_id": "EX154_7", "text": "Medical guidelines consistently state that most common colds do not require professional medical intervention, unless concerning symptoms develop or the patient is high-risk.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX155",
    "query_type": "explicit_NOT",
    "query_text": "Is it true that all mental health issues can be cured with therapy alone?",
    "documents": [
      { "doc_id": "EX155_1", "text": "I read online that everyone can just talk their way out of any mental health problem.", "relevance": 1 },
      { "doc_id": "EX155_2", "text": "Psychotherapy is highly effective for many mental health conditions and is often a first-line treatment.", "relevance": 2 },
      { "doc_id": "EX155_3", "text": "For some severe conditions, like schizophrenia or severe bipolar disorder, medication is often essential.", "relevance": 3 },
      { "doc_id": "EX155_4", "text": "Combined therapy, involving both medication and psychotherapy, often yields the best outcomes.", "relevance": 4 },
      { "doc_id": "EX155_5", "text": "Biological factors, neurochemical imbalances, and genetic predispositions play a significant role in certain disorders.", "relevance": 4 },
      { "doc_id": "EX155_6", "text": "Psychiatric associations emphasize that a personalized treatment plan, which may include medication, is often necessary for optimal recovery.", "relevance": 5 },
      { "doc_id": "EX155_7", "text": "Extensive clinical research confirms that while therapy is invaluable, not all mental health issues are fully treatable with psychotherapy alone, especially severe or biologically driven conditions.", "relevance": 6 }
    ]
  },
  {
    "query_id": "EX156",
    "query_type": "explicit_NOT",
    "query_text": "Does aging inevitably lead to severe cognitive decline?",
    "documents": [
      { "doc_id": "EX156_1", "text": "My biggest fear is that old age automatically means losing your mind, like in the movies.", "relevance": 1 },
      { "doc_id": "EX156_2", "text": "Some age-related cognitive changes, like slower processing speed, are normal.", "relevance": 2 },
      { "doc_id": "EX156_3", "text": "Many older adults maintain sharp cognitive function well into their later years.", "relevance": 2 },
      { "doc_id": "EX156_4", "text": "Severe cognitive decline, characteristic of dementia, is a disease state, not a normal part of aging.", "relevance": 3 },
      { "doc_id": "EX156_5", "text": "Lifestyle factors like diet, exercise, and social engagement can protect cognitive health.", "relevance": 4 },
      { "doc_id": "EX156_6", "text": "Geriatric research focuses on healthy aging and preventing or delaying cognitive impairment.", "relevance": 4 },
      { "doc_id": "EX156_7", "text": "Neuroscience and gerontology research consistently demonstrate that while some cognitive changes occur with age, severe decline like dementia is a pathological process and not an unavoidable consequence of aging.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX157",
    "query_type": "explicit_NOT",
    "query_text": "Is it true that all vitamin deficiencies can be diagnosed by symptoms alone?",
    "documents": [
      { "doc_id": "EX157_1", "text": "I thought if you were low on a vitamin, you'd immediately feel really sick and know it.", "relevance": 1 },
      { "doc_id": "EX157_2", "text": "Some severe deficiencies have clear and distinct clinical signs.", "relevance": 2 },
      { "doc_id": "EX157_3", "text": "However, many mild or moderate deficiencies can be asymptomatic or have non-specific symptoms.", "relevance": 3 },
      { "doc_id": "EX157_4", "text": "Blood tests are often necessary to confirm a specific vitamin or mineral deficiency.", "relevance": 3 },
      { "doc_id": "EX157_5", "text": "Symptoms can overlap with other conditions, making self-diagnosis unreliable.", "relevance": 4 },
      { "doc_id": "EX157_6", "text": "Nutritional medicine emphasizes laboratory testing for accurate diagnosis of deficiencies.", "relevance": 4 },
      { "doc_id": "EX157_7", "text": "Clinical guidelines and research in nutritional science clearly indicate that relying solely on symptoms is insufficient for diagnosing many vitamin deficiencies, necessitating biochemical confirmation.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX158",
    "query_type": "explicit_NOT",
    "query_text": "Does everyone experience the same side effects from chemotherapy?",
    "documents": [
      { "doc_id": "EX158_1", "text": "My friend said all chemo makes you lose your hair and vomit constantly, so I expect the same.", "relevance": 1 },
      { "doc_id": "EX158_2", "text": "Common side effects like nausea and fatigue are frequently reported, but not universally severe.", "relevance": 2 },
      { "doc_id": "EX158_3", "text": "The type of chemotherapy drug, dosage, and individual patient factors influence side effects.", "relevance": 3 },
      { "doc_id": "EX158_4", "text": "Some patients experience very mild side effects, while others have more significant reactions.", "relevance": 3 },
      { "doc_id": "EX158_5", "text": "Supportive care, like anti-nausea medications, can effectively manage many side effects.", "relevance": 4 },
      { "doc_id": "EX158_6", "text": "Oncology care involves anticipating and managing individualized side effect profiles for each patient.", "relevance": 4 },
      { "doc_id": "EX158_7", "text": "Clinical oncology demonstrates significant inter-individual variability in chemotherapy side effects, influenced by pharmacology, genetics, and patient-specific factors, meaning not everyone experiences them identically.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX159",
    "query_type": "explicit_NOT",
    "query_text": "Is it true that all headaches are cured by pain relievers?",
    "documents": [
      { "doc_id": "EX159_1", "text": "I thought taking an Advil would always fix any headache, no matter what.", "relevance": 1 },
      { "doc_id": "EX159_2", "text": "Over-the-counter pain relievers are effective for many common types of headaches.", "relevance": 2 },
      { "doc_id": "EX159_3", "text": "However, some headaches, like severe migraines, may require specific prescription medications.", "relevance": 3 },
      { "doc_id": "EX159_4", "text": "Chronic daily headaches often require a comprehensive management plan beyond simple pain relief.", "relevance": 3 },
      { "doc_id": "EX159_5", "text": "Rebound headaches can even be caused by overuse of pain medication.", "relevance": 4 },
      { "doc_id": "EX159_6", "text": "Neurology guidelines emphasize proper diagnosis to determine the most effective treatment for different headache types.", "relevance": 4 },
      { "doc_id": "EX159_7", "text": "Medical research on headache disorders clearly indicates that while many headaches respond to pain relievers, certain types, particularly chronic or severe forms, require more specialized and diverse treatment approaches.", "relevance": 5 }
    ]
  },
  {
    "query_id": "EX160",
    "query_type": "explicit_NOT",
    "query_text": "Does exercise completely prevent heart disease in all individuals?",
    "documents": [
      { "doc_id": "EX160_1", "text": "My trainer told me if I just work out enough, I'll never have heart problems.", "relevance": 1 },
      { "doc_id": "EX160_2", "text": "Regular physical activity significantly lowers the risk of cardiovascular disease.", "relevance": 2 },
      { "doc_id": "EX160_3", "text": "Exercise improves blood pressure, cholesterol levels, and weight management.", "relevance": 2 },
      { "doc_id": "EX160_4", "text": "However, genetic predispositions and other risk factors, like smoking, can still contribute to heart disease.", "relevance": 3 },
      { "doc_id": "EX160_5", "text": "While highly protective, exercise alone cannot completely negate all other risk factors.", "relevance": 4 },
      { "doc_id": "EX160_6", "text": "Cardiology recommendations stress exercise as a key component of a comprehensive heart-healthy lifestyle.", "relevance": 4 },
      { "doc_id": "EX160_7", "text": "Extensive epidemiological data and clinical trials demonstrate that while regular exercise dramatically reduces heart disease risk, it does not offer absolute immunity, especially in the presence of other unmanaged risk factors.", "relevance": 5 }
    ]
  }
]