[
  {
    "query_id": "IM01",
    "query_type": "implicit_NOT",
    "query_text": "Find clinical studies about NSAIDs and causing ulcers",
    "documents": [
      {
        "doc_id": "IM01_1",
        "text": "There are safety alerts about the risk of causing ulcers associated with NSAIDs.",
        "relevance": 1
      },
      {
        "doc_id": "IM01_2",
        "text": "No statistically significant increase in causing ulcers was observed in patients using NSAIDs (p=0.76).",
        "relevance": 5
      },
      {
        "doc_id": "IM01_3",
        "text": "Nsaids may influence several pathways, but evidence of causing ulcers is inconclusive.",
        "relevance": 3
      },
      {
        "doc_id": "IM01_4",
        "text": "Case reports describe instances of causing ulcers in individuals taking NSAIDs.",
        "relevance": 1
      },
      {
        "doc_id": "IM01_5",
        "text": "Multiple reports have suggested a potential rise in causing ulcers following NSAIDs use.",
        "relevance": 1
      },
      {
        "doc_id": "IM01_6",
        "text": "Causing ulcers rates remained stable across groups treated with NSAIDs.",
        "relevance": 4
      },
      {
        "doc_id": "IM01_7",
        "text": "Studies have not found a meaningful link between NSAIDs and causing ulcers.",
        "relevance": 5
      }
    ]
  },
  {
    "query_id": "IM02",
    "query_type": "implicit_NOT",
    "query_text": "Find clinical studies about PPIs and increasing fracture risk",
    "documents": [
      {
        "doc_id": "IM02_1",
        "text": "There are safety alerts about the risk of increasing fracture risk associated with PPIs.",
        "relevance": 1
      },
      {
        "doc_id": "IM02_2",
        "text": "Increasing fracture risk rates remained stable across groups treated with PPIs.",
        "relevance": 4
      },
      {
        "doc_id": "IM02_3",
        "text": "Multiple reports have suggested a potential rise in increasing fracture risk following PPIs use.",
        "relevance": 1
      },
      {
        "doc_id": "IM02_4",
        "text": "Studies have not found a meaningful link between PPIs and increasing fracture risk.",
        "relevance": 5
      },
      {
        "doc_id": "IM02_5",
        "text": "Case reports describe instances of increasing fracture risk in individuals taking PPIs.",
        "relevance": 1
      },
      {
        "doc_id": "IM02_6",
        "text": "No statistically significant increase in increasing fracture risk was observed in patients using PPIs (p=0.76).",
        "relevance": 5
      },
      {
        "doc_id": "IM02_7",
        "text": "Ppis may influence several pathways, but evidence of increasing fracture risk is inconclusive.",
        "relevance": 3
      }
    ]
  },
  {
    "query_id": "IM03",
    "query_type": "implicit_NOT",
    "query_text": "Find clinical studies about antipsychotics and leading to diabetes",
    "documents": [
      {
        "doc_id": "IM03_1",
        "text": "Studies have not found a meaningful link between antipsychotics and leading to diabetes.",
        "relevance": 5
      },
      {
        "doc_id": "IM03_2",
        "text": "Leading to diabetes rates remained stable across groups treated with antipsychotics.",
        "relevance": 4
      },
      {
        "doc_id": "IM03_3",
        "text": "Antipsychotics may influence several pathways, but evidence of leading to diabetes is inconclusive.",
        "relevance": 3
      },
      {
        "doc_id": "IM03_4",
        "text": "There are safety alerts about the risk of leading to diabetes associated with antipsychotics.",
        "relevance": 1
      },
      {
        "doc_id": "IM03_5",
        "text": "Multiple reports have suggested a potential rise in leading to diabetes following antipsychotics use.",
        "relevance": 1
      },
      {
        "doc_id": "IM03_6",
        "text": "Case reports describe instances of leading to diabetes in individuals taking antipsychotics.",
        "relevance": 1
      },
      {
        "doc_id": "IM03_7",
        "text": "No statistically significant increase in leading to diabetes was observed in patients using antipsychotics (p=0.76).",
        "relevance": 5
      }
    ]
  },
  {
    "query_id": "IM04",
    "query_type": "implicit_NOT",
    "query_text": "Find clinical studies about antibiotics and causing liver damage",
    "documents": [
      {
        "doc_id": "IM04_1",
        "text": "Antibiotics may influence several pathways, but evidence of causing liver damage is inconclusive.",
        "relevance": 3
      },
      {
        "doc_id": "IM04_2",
        "text": "No statistically significant increase in causing liver damage was observed in patients using antibiotics (p=0.76).",
        "relevance": 5
      },
      {
        "doc_id": "IM04_3",
        "text": "There are safety alerts about the risk of causing liver damage associated with antibiotics.",
        "relevance": 1
      },
      {
        "doc_id": "IM04_4",
        "text": "Studies have not found a meaningful link between antibiotics and causing liver damage.",
        "relevance": 5
      },
      {
        "doc_id": "IM04_5",
        "text": "Causing liver damage rates remained stable across groups treated with antibiotics.",
        "relevance": 4
      },
      {
        "doc_id": "IM04_6",
        "text": "Case reports describe instances of causing liver damage in individuals taking antibiotics.",
        "relevance": 1
      },
      {
        "doc_id": "IM04_7",
        "text": "Multiple reports have suggested a potential rise in causing liver damage following antibiotics use.",
        "relevance": 1
      }
    ]
  },
  {
    "query_id": "IM05",
    "query_type": "implicit_NOT",
    "query_text": "Find clinical studies about immunotherapy and causing autoimmunity",
    "documents": [
      {
        "doc_id": "IM05_1",
        "text": "Multiple reports have suggested a potential rise in causing autoimmunity following immunotherapy use.",
        "relevance": 1
      },
      {
        "doc_id": "IM05_2",
        "text": "Studies have not found a meaningful link between immunotherapy and causing autoimmunity.",
        "relevance": 5
      },
      {
        "doc_id": "IM05_3",
        "text": "Immunotherapy may influence several pathways, but evidence of causing autoimmunity is inconclusive.",
        "relevance": 3
      },
      {
        "doc_id": "IM05_4",
        "text": "There are safety alerts about the risk of causing autoimmunity associated with immunotherapy.",
        "relevance": 1
      },
      {
        "doc_id": "IM05_5",
        "text": "Causing autoimmunity rates remained stable across groups treated with immunotherapy.",
        "relevance": 4
      },
      {
        "doc_id": "IM05_6",
        "text": "Case reports describe instances of causing autoimmunity in individuals taking immunotherapy.",
        "relevance": 1
      },
      {
        "doc_id": "IM05_7",
        "text": "No statistically significant increase in causing autoimmunity was observed in patients using immunotherapy (p=0.76).",
        "relevance": 5
      }
    ]
  },
  {
    "query_id": "IM06",
    "query_type": "implicit_NOT",
    "query_text": "Find clinical studies about chemotherapy and causing hair loss",
    "documents": [
      {
        "doc_id": "IM06_1",
        "text": "No statistically significant increase in causing hair loss was observed in patients using chemotherapy (p=0.76).",
        "relevance": 5
      },
      {
        "doc_id": "IM06_2",
        "text": "There are safety alerts about the risk of causing hair loss associated with chemotherapy.",
        "relevance": 1
      },
      {
        "doc_id": "IM06_3",
        "text": "Chemotherapy may influence several pathways, but evidence of causing hair loss is inconclusive.",
        "relevance": 3
      },
      {
        "doc_id": "IM06_4",
        "text": "Case reports describe instances of causing hair loss in individuals taking chemotherapy.",
        "relevance": 1
      },
      {
        "doc_id": "IM06_5",
        "text": "Causing hair loss rates remained stable across groups treated with chemotherapy.",
        "relevance": 4
      },
      {
        "doc_id": "IM06_6",
        "text": "Multiple reports have suggested a potential rise in causing hair loss following chemotherapy use.",
        "relevance": 1
      },
      {
        "doc_id": "IM06_7",
        "text": "Studies have not found a meaningful link between chemotherapy and causing hair loss.",
        "relevance": 5
      }
    ]
  },
  {
    "query_id": "IM07",
    "query_type": "implicit_NOT",
    "query_text": "Find clinical studies about insulin and causing hypoglycemia",
    "documents": [
      {
        "doc_id": "IM07_1",
        "text": "Multiple reports have suggested a potential rise in causing hypoglycemia following insulin use.",
        "relevance": 1
      },
      {
        "doc_id": "IM07_2",
        "text": "Insulin may influence several pathways, but evidence of causing hypoglycemia is inconclusive.",
        "relevance": 3
      },
      {
        "doc_id": "IM07_3",
        "text": "Case reports describe instances of causing hypoglycemia in individuals taking insulin.",
        "relevance": 1
      },
      {
        "doc_id": "IM07_4",
        "text": "Causing hypoglycemia rates remained stable across groups treated with insulin.",
        "relevance": 4
      },
      {
        "doc_id": "IM07_5",
        "text": "Studies have not found a meaningful link between insulin and causing hypoglycemia.",
        "relevance": 5
      },
      {
        "doc_id": "IM07_6",
        "text": "No statistically significant increase in causing hypoglycemia was observed in patients using insulin (p=0.76).",
        "relevance": 5
      },
      {
        "doc_id": "IM07_7",
        "text": "There are safety alerts about the risk of causing hypoglycemia associated with insulin.",
        "relevance": 1
      }
    ]
  },
  {
    "query_id": "IM08",
    "query_type": "implicit_NOT",
    "query_text": "Find clinical studies about glucocorticoids and causing osteoporosis",
    "documents": [
      {
        "doc_id": "IM08_1",
        "text": "No statistically significant increase in causing osteoporosis was observed in patients using glucocorticoids (p=0.76).",
        "relevance": 5
      },
      {
        "doc_id": "IM08_2",
        "text": "Glucocorticoids may influence several pathways, but evidence of causing osteoporosis is inconclusive.",
        "relevance": 3
      },
      {
        "doc_id": "IM08_3",
        "text": "Causing osteoporosis rates remained stable across groups treated with glucocorticoids.",
        "relevance": 4
      },
      {
        "doc_id": "IM08_4",
        "text": "Case reports describe instances of causing osteoporosis in individuals taking glucocorticoids.",
        "relevance": 1
      },
      {
        "doc_id": "IM08_5",
        "text": "Multiple reports have suggested a potential rise in causing osteoporosis following glucocorticoids use.",
        "relevance": 1
      },
      {
        "doc_id": "IM08_6",
        "text": "There are safety alerts about the risk of causing osteoporosis associated with glucocorticoids.",
        "relevance": 1
      },
      {
        "doc_id": "IM08_7",
        "text": "Studies have not found a meaningful link between glucocorticoids and causing osteoporosis.",
        "relevance": 5
      }
    ]
  },
  {
    "query_id": "IM09",
    "query_type": "implicit_NOT",
    "query_text": "Find clinical studies about anticoagulants and increasing bleeding risk",
    "documents": [
      {
        "doc_id": "IM09_1",
        "text": "Anticoagulants may influence several pathways, but evidence of increasing bleeding risk is inconclusive.",
        "relevance": 3
      },
      {
        "doc_id": "IM09_2",
        "text": "There are safety alerts about the risk of increasing bleeding risk associated with anticoagulants.",
        "relevance": 1
      },
      {
        "doc_id": "IM09_3",
        "text": "No statistically significant increase in increasing bleeding risk was observed in patients using anticoagulants (p=0.76).",
        "relevance": 5
      },
      {
        "doc_id": "IM09_4",
        "text": "Studies have not found a meaningful link between anticoagulants and increasing bleeding risk.",
        "relevance": 5
      },
      {
        "doc_id": "IM09_5",
        "text": "Increasing bleeding risk rates remained stable across groups treated with anticoagulants.",
        "relevance": 4
      },
      {
        "doc_id": "IM09_6",
        "text": "Multiple reports have suggested a potential rise in increasing bleeding risk following anticoagulants use.",
        "relevance": 1
      },
      {
        "doc_id": "IM09_7",
        "text": "Case reports describe instances of increasing bleeding risk in individuals taking anticoagulants.",
        "relevance": 1
      }
    ]
  },
  {
    "query_id": "IM10",
    "query_type": "implicit_NOT",
    "query_text": "Find clinical studies about thyroid drugs and causing heart palpitations",
    "documents": [
      {
        "doc_id": "IM10_1",
        "text": "Causing heart palpitations rates remained stable across groups treated with thyroid drugs.",
        "relevance": 4
      },
      {
        "doc_id": "IM10_2",
        "text": "Thyroid drugs may influence several pathways, but evidence of causing heart palpitations is inconclusive.",
        "relevance": 3
      },
      {
        "doc_id": "IM10_3",
        "text": "Case reports describe instances of causing heart palpitations in individuals taking thyroid drugs.",
        "relevance": 1
      },
      {
        "doc_id": "IM10_4",
        "text": "There are safety alerts about the risk of causing heart palpitations associated with thyroid drugs.",
        "relevance": 1
      },
      {
        "doc_id": "IM10_5",
        "text": "Multiple reports have suggested a potential rise in causing heart palpitations following thyroid drugs use.",
        "relevance": 1
      },
      {
        "doc_id": "IM10_6",
        "text": "No statistically significant increase in causing heart palpitations was observed in patients using thyroid drugs (p=0.76).",
        "relevance": 5
      },
      {
        "doc_id": "IM10_7",
        "text": "Studies have not found a meaningful link between thyroid drugs and causing heart palpitations.",
        "relevance": 5
      }
    ]
  },
  {
    "query_id": "IM11",
    "query_type": "implicit_NOT",
    "query_text": "Find clinical studies about calcium supplements and causing kidney stones",
    "documents": [
      {
        "doc_id": "IM11_1",
        "text": "Studies have not found a meaningful link between calcium supplements and causing kidney stones.",
        "relevance": 5
      },
      {
        "doc_id": "IM11_2",
        "text": "Causing kidney stones rates remained stable across groups treated with calcium supplements.",
        "relevance": 4
      },
      {
        "doc_id": "IM11_3",
        "text": "No statistically significant increase in causing kidney stones was observed in patients using calcium supplements (p=0.76).",
        "relevance": 5
      },
      {
        "doc_id": "IM11_4",
        "text": "Case reports describe instances of causing kidney stones in individuals taking calcium supplements.",
        "relevance": 1
      },
      {
        "doc_id": "IM11_5",
        "text": "Calcium supplements may influence several pathways, but evidence of causing kidney stones is inconclusive.",
        "relevance": 3
      },
      {
        "doc_id": "IM11_6",
        "text": "Multiple reports have suggested a potential rise in causing kidney stones following calcium supplements use.",
        "relevance": 1
      },
      {
        "doc_id": "IM11_7",
        "text": "There are safety alerts about the risk of causing kidney stones associated with calcium supplements.",
        "relevance": 1
      }
    ]
  },
  {
    "query_id": "IM12",
    "query_type": "implicit_NOT",
    "query_text": "Find clinical studies about vitamin D and causing toxicity",
    "documents": [
      {
        "doc_id": "IM12_1",
        "text": "Studies have not found a meaningful link between vitamin D and causing toxicity.",
        "relevance": 5
      },
      {
        "doc_id": "IM12_2",
        "text": "Vitamin d may influence several pathways, but evidence of causing toxicity is inconclusive.",
        "relevance": 3
      },
      {
        "doc_id": "IM12_3",
        "text": "Case reports describe instances of causing toxicity in individuals taking vitamin D.",
        "relevance": 1
      },
      {
        "doc_id": "IM12_4",
        "text": "Multiple reports have suggested a potential rise in causing toxicity following vitamin D use.",
        "relevance": 1
      },
      {
        "doc_id": "IM12_5",
        "text": "Causing toxicity rates remained stable across groups treated with vitamin D.",
        "relevance": 4
      },
      {
        "doc_id": "IM12_6",
        "text": "No statistically significant increase in causing toxicity was observed in patients using vitamin D (p=0.76).",
        "relevance": 5
      },
      {
        "doc_id": "IM12_7",
        "text": "There are safety alerts about the risk of causing toxicity associated with vitamin D.",
        "relevance": 1
      }
    ]
  },
  {
    "query_id": "IM13",
    "query_type": "implicit_NOT",
    "query_text": "Find clinical studies about opioids and causing dependency",
    "documents": [
      {
        "doc_id": "IM13_1",
        "text": "Opioids may influence several pathways, but evidence of causing dependency is inconclusive.",
        "relevance": 3
      },
      {
        "doc_id": "IM13_2",
        "text": "Causing dependency rates remained stable across groups treated with opioids.",
        "relevance": 4
      },
      {
        "doc_id": "IM13_3",
        "text": "Studies have not found a meaningful link between opioids and causing dependency.",
        "relevance": 5
      },
      {
        "doc_id": "IM13_4",
        "text": "There are safety alerts about the risk of causing dependency associated with opioids.",
        "relevance": 1
      },
      {
        "doc_id": "IM13_5",
        "text": "Case reports describe instances of causing dependency in individuals taking opioids.",
        "relevance": 1
      },
      {
        "doc_id": "IM13_6",
        "text": "Multiple reports have suggested a potential rise in causing dependency following opioids use.",
        "relevance": 1
      },
      {
        "doc_id": "IM13_7",
        "text": "No statistically significant increase in causing dependency was observed in patients using opioids (p=0.76).",
        "relevance": 5
      }
    ]
  },
  {
    "query_id": "IM14",
    "query_type": "implicit_NOT",
    "query_text": "Find clinical studies about vaccines and causing infertility",
    "documents": [
      {
        "doc_id": "IM14_1",
        "text": "No statistically significant increase in causing infertility was observed in patients using vaccines (p=0.76).",
        "relevance": 5
      },
      {
        "doc_id": "IM14_2",
        "text": "Multiple reports have suggested a potential rise in causing infertility following vaccines use.",
        "relevance": 1
      },
      {
        "doc_id": "IM14_3",
        "text": "There are safety alerts about the risk of causing infertility associated with vaccines.",
        "relevance": 1
      },
      {
        "doc_id": "IM14_4",
        "text": "Causing infertility rates remained stable across groups treated with vaccines.",
        "relevance": 4
      },
      {
        "doc_id": "IM14_5",
        "text": "Case reports describe instances of causing infertility in individuals taking vaccines.",
        "relevance": 1
      },
      {
        "doc_id": "IM14_6",
        "text": "Studies have not found a meaningful link between vaccines and causing infertility.",
        "relevance": 5
      },
      {
        "doc_id": "IM14_7",
        "text": "Vaccines may influence several pathways, but evidence of causing infertility is inconclusive.",
        "relevance": 3
      }
    ]
  },
  {
    "query_id": "IM15",
    "query_type": "implicit_NOT",
    "query_text": "Find clinical studies about probiotics and causing bloating",
    "documents": [
      {
        "doc_id": "IM15_1",
        "text": "Case reports describe instances of causing bloating in individuals taking probiotics.",
        "relevance": 1
      },
      {
        "doc_id": "IM15_2",
        "text": "Causing bloating rates remained stable across groups treated with probiotics.",
        "relevance": 4
      },
      {
        "doc_id": "IM15_3",
        "text": "There are safety alerts about the risk of causing bloating associated with probiotics.",
        "relevance": 1
      },
      {
        "doc_id": "IM15_4",
        "text": "No statistically significant increase in causing bloating was observed in patients using probiotics (p=0.76).",
        "relevance": 5
      },
      {
        "doc_id": "IM15_5",
        "text": "Probiotics may influence several pathways, but evidence of causing bloating is inconclusive.",
        "relevance": 3
      },
      {
        "doc_id": "IM15_6",
        "text": "Studies have not found a meaningful link between probiotics and causing bloating.",
        "relevance": 5
      },
      {
        "doc_id": "IM15_7",
        "text": "Multiple reports have suggested a potential rise in causing bloating following probiotics use.",
        "relevance": 1
      }
    ]
  },
  {
    "query_id": "IM16",
    "query_type": "implicit_NOT",
    "query_text": "Find clinical studies about beta-agonists and causing tremors",
    "documents": [
      {
        "doc_id": "IM16_1",
        "text": "No statistically significant increase in causing tremors was observed in patients using beta-agonists (p=0.76).",
        "relevance": 5
      },
      {
        "doc_id": "IM16_2",
        "text": "Beta-agonists may influence several pathways, but evidence of causing tremors is inconclusive.",
        "relevance": 3
      },
      {
        "doc_id": "IM16_3",
        "text": "Causing tremors rates remained stable across groups treated with beta-agonists.",
        "relevance": 4
      },
      {
        "doc_id": "IM16_4",
        "text": "Studies have not found a meaningful link between beta-agonists and causing tremors.",
        "relevance": 5
      },
      {
        "doc_id": "IM16_5",
        "text": "There are safety alerts about the risk of causing tremors associated with beta-agonists.",
        "relevance": 1
      },
      {
        "doc_id": "IM16_6",
        "text": "Case reports describe instances of causing tremors in individuals taking beta-agonists.",
        "relevance": 1
      },
      {
        "doc_id": "IM16_7",
        "text": "Multiple reports have suggested a potential rise in causing tremors following beta-agonists use.",
        "relevance": 1
      }
    ]
  },
  {
    "query_id": "IM17",
    "query_type": "implicit_NOT",
    "query_text": "Find clinical studies about benzodiazepines and causing memory loss",
    "documents": [
      {
        "doc_id": "IM17_1",
        "text": "Studies have not found a meaningful link between benzodiazepines and causing memory loss.",
        "relevance": 5
      },
      {
        "doc_id": "IM17_2",
        "text": "There are safety alerts about the risk of causing memory loss associated with benzodiazepines.",
        "relevance": 1
      },
      {
        "doc_id": "IM17_3",
        "text": "Case reports describe instances of causing memory loss in individuals taking benzodiazepines.",
        "relevance": 1
      },
      {
        "doc_id": "IM17_4",
        "text": "Benzodiazepines may influence several pathways, but evidence of causing memory loss is inconclusive.",
        "relevance": 3
      },
      {
        "doc_id": "IM17_5",
        "text": "No statistically significant increase in causing memory loss was observed in patients using benzodiazepines (p=0.76).",
        "relevance": 5
      },
      {
        "doc_id": "IM17_6",
        "text": "Causing memory loss rates remained stable across groups treated with benzodiazepines.",
        "relevance": 4
      },
      {
        "doc_id": "IM17_7",
        "text": "Multiple reports have suggested a potential rise in causing memory loss following benzodiazepines use.",
        "relevance": 1
      }
    ]
  },
  {
    "query_id": "IM18",
    "query_type": "implicit_NOT",
    "query_text": "Find clinical studies about antihistamines and causing drowsiness",
    "documents": [
      {
        "doc_id": "IM18_1",
        "text": "Causing drowsiness rates remained stable across groups treated with antihistamines.",
        "relevance": 4
      },
      {
        "doc_id": "IM18_2",
        "text": "Case reports describe instances of causing drowsiness in individuals taking antihistamines.",
        "relevance": 1
      },
      {
        "doc_id": "IM18_3",
        "text": "Studies have not found a meaningful link between antihistamines and causing drowsiness.",
        "relevance": 5
      },
      {
        "doc_id": "IM18_4",
        "text": "No statistically significant increase in causing drowsiness was observed in patients using antihistamines (p=0.76).",
        "relevance": 5
      },
      {
        "doc_id": "IM18_5",
        "text": "There are safety alerts about the risk of causing drowsiness associated with antihistamines.",
        "relevance": 1
      },
      {
        "doc_id": "IM18_6",
        "text": "Multiple reports have suggested a potential rise in causing drowsiness following antihistamines use.",
        "relevance": 1
      },
      {
        "doc_id": "IM18_7",
        "text": "Antihistamines may influence several pathways, but evidence of causing drowsiness is inconclusive.",
        "relevance": 3
      }
    ]
  },
  {
    "query_id": "IM19",
    "query_type": "implicit_NOT",
    "query_text": "Find clinical studies about heparin and causing thrombocytopenia",
    "documents": [
      {
        "doc_id": "IM19_1",
        "text": "Heparin may influence several pathways, but evidence of causing thrombocytopenia is inconclusive.",
        "relevance": 3
      },
      {
        "doc_id": "IM19_2",
        "text": "Causing thrombocytopenia rates remained stable across groups treated with heparin.",
        "relevance": 4
      },
      {
        "doc_id": "IM19_3",
        "text": "Studies have not found a meaningful link between heparin and causing thrombocytopenia.",
        "relevance": 5
      },
      {
        "doc_id": "IM19_4",
        "text": "Case reports describe instances of causing thrombocytopenia in individuals taking heparin.",
        "relevance": 1
      },
      {
        "doc_id": "IM19_5",
        "text": "No statistically significant increase in causing thrombocytopenia was observed in patients using heparin (p=0.76).",
        "relevance": 5
      },
      {
        "doc_id": "IM19_6",
        "text": "Multiple reports have suggested a potential rise in causing thrombocytopenia following heparin use.",
        "relevance": 1
      },
      {
        "doc_id": "IM19_7",
        "text": "There are safety alerts about the risk of causing thrombocytopenia associated with heparin.",
        "relevance": 1
      }
    ]
  },
  {
    "query_id": "IM20",
    "query_type": "implicit_NOT",
    "query_text": "Find clinical studies about steroids and causing mood swings",
    "documents": [
      {
        "doc_id": "IM20_1",
        "text": "No statistically significant increase in causing mood swings was observed in patients using steroids (p=0.76).",
        "relevance": 5
      },
      {
        "doc_id": "IM20_2",
        "text": "Case reports describe instances of causing mood swings in individuals taking steroids.",
        "relevance": 1
      },
      {
        "doc_id": "IM20_3",
        "text": "Multiple reports have suggested a potential rise in causing mood swings following steroids use.",
        "relevance": 1
      },
      {
        "doc_id": "IM20_4",
        "text": "Causing mood swings rates remained stable across groups treated with steroids.",
        "relevance": 4
      },
      {
        "doc_id": "IM20_5",
        "text": "There are safety alerts about the risk of causing mood swings associated with steroids.",
        "relevance": 1
      },
      {
        "doc_id": "IM20_6",
        "text": "Steroids may influence several pathways, but evidence of causing mood swings is inconclusive.",
        "relevance": 3
      },
      {
        "doc_id": "IM20_7",
        "text": "Studies have not found a meaningful link between steroids and causing mood swings.",
        "relevance": 5
      }
    ]
  },
  {
    "query_id": "IM21",
    "query_type": "implicit_NOT",
    "query_text": "Find clinical studies about H2 blockers and causing nutrient deficiencies",
    "documents": [
      {
        "doc_id": "IM21_1",
        "text": "H2 blockers may influence several pathways, but evidence of causing nutrient deficiencies is inconclusive.",
        "relevance": 3
      },
      {
        "doc_id": "IM21_2",
        "text": "Causing nutrient deficiencies rates remained stable across groups treated with H2 blockers.",
        "relevance": 4
      },
      {
        "doc_id": "IM21_3",
        "text": "Multiple reports have suggested a potential rise in causing nutrient deficiencies following H2 blockers use.",
        "relevance": 1
      },
      {
        "doc_id": "IM21_4",
        "text": "Studies have not found a meaningful link between H2 blockers and causing nutrient deficiencies.",
        "relevance": 5
      },
      {
        "doc_id": "IM21_5",
        "text": "No statistically significant increase in causing nutrient deficiencies was observed in patients using H2 blockers (p=0.76).",
        "relevance": 5
      },
      {
        "doc_id": "IM21_6",
        "text": "There are safety alerts about the risk of causing nutrient deficiencies associated with H2 blockers.",
        "relevance": 1
      },
      {
        "doc_id": "IM21_7",
        "text": "Case reports describe instances of causing nutrient deficiencies in individuals taking H2 blockers.",
        "relevance": 1
      }
    ]
  },
  {
    "query_id": "IM22",
    "query_type": "implicit_NOT",
    "query_text": "Find clinical studies about diuretics and causing dehydration",
    "documents": [
      {
        "doc_id": "IM22_1",
        "text": "Studies have not found a meaningful link between diuretics and causing dehydration.",
        "relevance": 5
      },
      {
        "doc_id": "IM22_2",
        "text": "Diuretics may influence several pathways, but evidence of causing dehydration is inconclusive.",
        "relevance": 3
      },
      {
        "doc_id": "IM22_3",
        "text": "Multiple reports have suggested a potential rise in causing dehydration following diuretics use.",
        "relevance": 1
      },
      {
        "doc_id": "IM22_4",
        "text": "Causing dehydration rates remained stable across groups treated with diuretics.",
        "relevance": 4
      },
      {
        "doc_id": "IM22_5",
        "text": "Case reports describe instances of causing dehydration in individuals taking diuretics.",
        "relevance": 1
      },
      {
        "doc_id": "IM22_6",
        "text": "There are safety alerts about the risk of causing dehydration associated with diuretics.",
        "relevance": 1
      },
      {
        "doc_id": "IM22_7",
        "text": "No statistically significant increase in causing dehydration was observed in patients using diuretics (p=0.76).",
        "relevance": 5
      }
    ]
  }
]