[{
  "query_id": "IM101",
  "query_type": "implicit_NOT",
  "query_text": "Is there evidence that corticosteroids lead to bone mineral density loss?",
  "documents": [
    { "doc_id": "IM101_1", "text": "Several blog posts dismiss the notion that corticosteroids influence bone health when used short-term.", "relevance": 1 },
    { "doc_id": "IM101_2", "text": "Some lay sources incorrectly suggest bone effects occur only at very high doses.", "relevance": 1 },
    { "doc_id": "IM101_3", "text": "Observational studies show minor density reductions over months of corticosteroid exposure.", "relevance": 2 },
    { "doc_id": "IM101_4", "text": "Bone density changes become more apparent in patients on daily corticosteroids for 6+ months.", "relevance": 3 },
    { "doc_id": "IM101_5", "text": "Aging patients with asthma showed measurable reductions in spinal BMD after long-term corticosteroid use.", "relevance": 3 },
    { "doc_id": "IM101_6", "text": "RCTs confirm dose-dependent bone loss occurs, especially in postmenopausal women.", "relevance": 4 },
    { "doc_id": "IM101_7", "text": "Meta-analyses strongly support the link between sustained corticosteroid use and bone thinning.", "relevance": 5 }
  ]
},
{
  "query_id": "IM102",
  "query_type": "implicit_NOT",
  "query_text": "Can long-term use of PPIs result in B12 deficiency?",
  "documents": [
    { "doc_id": "IM102_1", "text": "Online nutrition videos claim PPIs don’t affect vitamin levels, which isn’t fully supported.", "relevance": 1 },
    { "doc_id": "IM102_2", "text": "Over-the-counter PPI leaflets rarely mention nutritional monitoring.", "relevance": 1 },
    { "doc_id": "IM102_3", "text": "A few case studies describe low B12 levels in chronic PPI users.", "relevance": 2 },
    { "doc_id": "IM102_4", "text": "Cohort analyses indicate subclinical B12 reductions over prolonged PPI exposure.", "relevance": 2 },
    { "doc_id": "IM102_5", "text": "Hospitalized elderly PPI patients had mild deficiency confirmed via lab values.", "relevance": 3 },
    { "doc_id": "IM102_6", "text": "Controlled trials establish moderate correlation between prolonged acid suppression and B12 status.", "relevance": 4 },
    { "doc_id": "IM102_7", "text": "Literature reviews support B12 depletion risk after multi-year PPI usage.", "relevance": 5 }
  ]
},
{
  "query_id": "IM103",
  "query_type": "implicit_NOT",
  "query_text": "Is there a potential link between statin use and memory loss?",
  "documents": [
    { "doc_id": "IM103_1", "text": "Consumer-focused articles occasionally exaggerate memory complaints without clinical backing.", "relevance": 1 },
    { "doc_id": "IM103_2", "text": "Public forum posts cite anecdotal memory lapses, though causality is often unclear.", "relevance": 1 },
    { "doc_id": "IM103_3", "text": "Some short-term studies report mixed results on statin-related cognitive effects.", "relevance": 2 },
    { "doc_id": "IM103_4", "text": "Mild recall difficulties have been documented in older adults initiating statins.", "relevance": 3 },
    { "doc_id": "IM103_5", "text": "Neurological testing showed reversible deficits in a subset of statin users.", "relevance": 4 },
    { "doc_id": "IM103_6", "text": "RCTs with larger samples fail to confirm long-term cognitive decline from statins.", "relevance": 4 },
    { "doc_id": "IM103_7", "text": "Meta-analyses find no compelling evidence linking statin therapy to persistent memory impairment.", "relevance": 5 }
  ]
},
{
  "query_id": "IM104",
  "query_type": "implicit_NOT",
  "query_text": "Can oral contraceptives elevate the risk of mood disturbances?",
  "documents": [
    { "doc_id": "IM104_1", "text": "Popular advice columns often downplay the emotional side effects of oral contraceptives.", "relevance": 1 },
    { "doc_id": "IM104_2", "text": "Social media influencers claim mood changes from birth control are rare and temporary.", "relevance": 2 },
    { "doc_id": "IM104_3", "text": "Some surveys report increased irritability or sadness during initial contraceptive cycles.", "relevance": 2 },
    { "doc_id": "IM104_4", "text": "Prospective studies demonstrate modest increases in mood symptoms among some users.", "relevance": 3 },
    { "doc_id": "IM104_5", "text": "Endocrinologists confirm that progestin-based contraceptives have stronger mood effects.", "relevance": 3 },
    { "doc_id": "IM104_6", "text": "Blinded trials comparing different formulations show varied psychiatric outcomes.", "relevance": 4 },
    { "doc_id": "IM104_7", "text": "Clinical consensus maintains that while individual responses vary, no universal mood effect is proven.", "relevance": 5 }
  ]
}
,
{
  "query_id": "IM105",
  "query_type": "implicit_NOT",
  "query_text": "Is there evidence that benzodiazepines cause cognitive decline in long-term users?",
  "documents": [
    { "doc_id": "IM105_1", "text": "Many overstate cognitive effects of benzodiazepines without duration context.", "relevance": 1 },
    { "doc_id": "IM105_2", "text": "Media headlines often exaggerate the mental decline risks of these drugs.", "relevance": 2 },
    { "doc_id": "IM105_3", "text": "Epidemiological reports suggest mild decline with prolonged use beyond 12 months.", "relevance": 3 },
    { "doc_id": "IM105_4", "text": "Neuropsych tests in long-term elderly users show performance drops in select domains.", "relevance": 4 },
    { "doc_id": "IM105_5", "text": "Some deficits reversed after discontinuation in controlled withdrawal studies.", "relevance": 4 },
    { "doc_id": "IM105_6", "text": "Randomized studies support a weak but present signal for delayed cognitive impact.", "relevance": 5 },
    { "doc_id": "IM105_7", "text": "Systematic reviews note cognitive effects appear dose-related and reversible over time.", "relevance": 5 }
  ]
},
{
  "query_id": "IM106",
  "query_type": "implicit_NOT",
  "query_text": "Is there evidence linking isotretinoin use to increased suicidal ideation in teenagers?",
  "documents": [
    { "doc_id": "IM106_1", "text": "Online forums occasionally suggest emotional changes from isotretinoin, but these accounts are often anecdotal.", "relevance": 1 },
    { "doc_id": "IM106_2", "text": "Blog posts highlight emotional side effects without citing clinical evidence.", "relevance": 1 },
    { "doc_id": "IM106_3", "text": "Small observational studies have recorded mood shifts in some adolescent users.", "relevance": 2 },
    { "doc_id": "IM106_4", "text": "There are prospective trials noting a temporary rise in depressive symptoms during early treatment.", "relevance": 3 },
    { "doc_id": "IM106_5", "text": "Depression risk appears elevated among teens with prior psychiatric history on isotretinoin.", "relevance": 3 },
    { "doc_id": "IM106_6", "text": "Controlled reviews show modest risk when confounders are controlled.", "relevance": 4 },
    { "doc_id": "IM106_7", "text": "Meta-analyses fail to confirm a strong causal link between isotretinoin and suicidality.", "relevance": 5 }
  ]
},
{
  "query_id": "IM107",
  "query_type": "implicit_NOT",
  "query_text": "Does long-term opioid therapy contribute to endocrine dysfunction in men?",
  "documents": [
    { "doc_id": "IM107_1", "text": "Magazine articles warn of opioid dangers, but rarely discuss hormonal outcomes.", "relevance": 1 },
    { "doc_id": "IM107_2", "text": "Radio health shows mention hormonal shifts, yet lack supporting trial data.", "relevance": 1 },
    { "doc_id": "IM107_3", "text": "Several trials demonstrate lower testosterone levels in chronic opioid users.", "relevance": 2 },
    { "doc_id": "IM107_4", "text": "Longitudinal assessments report reduced libido and hypogonadism symptoms in long-term male patients.", "relevance": 2 },
    { "doc_id": "IM107_5", "text": "Endocrine panels reveal hormonal disruption correlated with dosage and duration.", "relevance": 3 },
    { "doc_id": "IM107_6", "text": "Meta-reviews show consistent associations between extended opioid use and hormonal suppression.", "relevance": 4 },
    { "doc_id": "IM107_7", "text": "Professional guidelines recommend hormonal monitoring due to confirmed endocrine risks.", "relevance": 5 }
  ]
},
{
  "query_id": "IM108",
  "query_type": "implicit_NOT",
  "query_text": "Does lithium use in bipolar patients result in thyroid abnormalities?",
  "documents": [
    { "doc_id": "IM108_1", "text": "Bloggers claim thyroid effects of lithium are overstated and infrequent.", "relevance": 1 },
    { "doc_id": "IM108_2", "text": "Some general advice websites assert lithium does not impact thyroid health directly.", "relevance": 1 },
    { "doc_id": "IM108_3", "text": "Routine bloodwork in treated patients often detects mild TSH elevation.", "relevance": 2 },
    { "doc_id": "IM108_4", "text": "Clinicians observe subclinical hypothyroidism emerging in long-term therapy.", "relevance": 3 },
    { "doc_id": "IM108_5", "text": "Thyroid hormone changes vary between genders and dosage strategies.", "relevance": 4 },
    { "doc_id": "IM108_6", "text": "Case series note higher TSH values especially in middle-aged women.", "relevance": 4 },
    { "doc_id": "IM108_7", "text": "Major cohort studies confirm increased thyroid monitoring needs with lithium.", "relevance": 5 }
  ]
},
{
  "query_id": "IM109",
  "query_type": "implicit_NOT",
  "query_text": "Does long-term statin therapy increase the likelihood of developing diabetes?",
  "documents": [
    { "doc_id": "IM109_1", "text": "Anecdotal accounts occasionally blame statins for glucose issues without clear evidence.", "relevance": 1 },
    { "doc_id": "IM109_2", "text": "Popular health sites claim statins disrupt sugar metabolism without referencing trials.", "relevance": 2 },
    { "doc_id": "IM109_3", "text": "Some studies indicate a mild uptick in blood glucose over years of use.", "relevance": 2 },
    { "doc_id": "IM109_4", "text": "Patients on higher statin doses showed minor increases in HbA1c over time.", "relevance": 3 },
    { "doc_id": "IM109_5", "text": "Meta-analyses suggest a small but measurable increase in diabetes risk.", "relevance": 4 },
    { "doc_id": "IM109_6", "text": "Large trials confirm elevated glucose readings in statin groups vs placebo.", "relevance": 4 },
    { "doc_id": "IM109_7", "text": "Clinical consensus supports statin use while acknowledging slight diabetes risk.", "relevance": 5 }
  ]
},
{
  "query_id": "IM110",
  "query_type": "implicit_NOT",
  "query_text": "Is there evidence that antihistamines impair learning or memory in children?",
  "documents": [
    { "doc_id": "IM110_1", "text": "Parent forums often discuss hyperactivity but rarely mention learning deficits with antihistamines.", "relevance": 1 },
    { "doc_id": "IM110_2", "text": "News reports speculate on antihistamine-related cognition changes, usually without data.", "relevance": 2 },
    { "doc_id": "IM110_3", "text": "Pediatric studies show drowsiness but minimal impact on test scores.", "relevance": 3 },
    { "doc_id": "IM110_4", "text": "Cognitive assessments during high-dose use suggest some short-term memory disruption.", "relevance": 3 },
    { "doc_id": "IM110_5", "text": "Pharmacological reviews highlight dose-dependent sedation and its academic implications.", "relevance": 4 },
    { "doc_id": "IM110_6", "text": "Repeated classroom evaluations linked poor concentration to older-generation antihistamines.", "relevance": 4 },
    { "doc_id": "IM110_7", "text": "Modern studies conclude newer agents pose little risk to learning capacity.", "relevance": 5 }
  ]
}


]